rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#ifndef PLATFORM_REG_H
#define PLATFORM_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================                PLATFORM Register               ================ */
/* ===========     Reference: RL7019_SoC_Vendor_register_table_250812A.xlsx     =========== */
/* ================================================================================ */
#define PLATFORM_REG_RSVD_0000                  0x0000
#define PLATFORM_REG_LOW_PRI_INT_STATUS         0x0004
#define PLATFORM_REG_LOW_PRI_INT_MODE           0x0008
#define PLATFORM_REG_LOW_PRI_INT_EN             0x000c
#define PLATFORM_BTMACinterrupt                 0x0010
#define PLATFORM_RXIinterrupt                   0x0014
#define PLATFORM_Interruptedgeoption            0x0018
#define PLATFORM_REG_DEBUG_SEL                  0x001C
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL        0x0020
#define PLATFORM_DUMMY                          0x0024
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL         0x0028
#define PLATFORM_REG_SYSTICK_TIMER_CTRL         0x002C
#define PLATFORM_REG_SYSTICK_TIMER_CNT          0x0030
#define PLATFORM_REG_TMETER_CTRL                0x0034
#define PLATFORM_REG_TMETER_INT_STS             0x0038
#define PLATFORM_REG_CM33_NMI_INT_EN            0x003C
#define PLATFORM_REG_BIST_RSTN                  0x0040
#define PLATFORM_REG_BIST_MODE                  0x0044
#define PLATFORM_REG_DRF_BIST_MODE              0x0048
#define PLATFORM_REG_BIST_TEST_RESUME           0x004C
#define PLATFORM_REG_BIST_START_PAUSE           0x0050
#define PLATFORM_REG_BIST_DONE                  0x0054
#define PLATFORM_REG_BIST_FAIL                  0x0058
#define PLATFORM_REG_DRF_BIST_DONE              0x005C
#define PLATFORM_REG_DRF_BIST_FAIL              0x0060
#define PLATFORM_REG_MCU_ROM0_MISR0             0x0064
#define PLATFORM_REG_MCU_ROM0_MISR1             0x0068
#define PLATFORM_REG_MCU_ROM1_MISR0             0x006C
#define PLATFORM_REG_MCU_ROM1_MISR1             0x0070
#define PLATFORM_REG_MCU_ROM2_MISR0             0x0074
#define PLATFORM_REG_MCU_ROM2_MISR1             0x0078
#define PLATFORM_REG_MCU_ROM3_MISR0             0x007C
#define PLATFORM_REG_MCU_ROM3_MISR1             0x0080
#define PLATFORM_REG_MCU_ROM4_MISR0             0x0084
#define PLATFORM_REG_MCU_ROM4_MISR1             0x0088
#define PLATFORM_REG_I2C_MAILBOX_OUT_DATA0      0x0090
#define PLATFORM_REG_I2C_MAILBOX_OUT_DATA1      0x0094
#define PLATFORM_REG_I2C_MAILBOX_IN_DATA0       0x0098
#define PLATFORM_REG_I2C_MAILBOX_IN_DATA1       0x009C
#define PLATFORM_REG_I2C_MAILBOX_CTRL           0x00A0
#define PLATFORM_WIC_HANDSHAKE                  0x00A4
#define PLATFORM_WKUP_REASON_CORE               0x00A8
#define PLATFORM_Reserved                       0x00AC
#define PLATFORM_Reserved_1                     0x00B0
#define PLATFORM_Reserved_2                     0x00B4
#define PLATFORM_REG_SNPS_SRAM_CTRL             0x00B8
#define PLATFORM_Reserved_3                     0x00BC
#define PLATFORM_Reserved_4                     0x00C0
#define PLATFORM_Reserved_5                     0x00C4
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL       0x00C8
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL        0x00CC
#define PLATFORM_REG_MBISR_SRAM_RESULT          0x00D0
#define PLATFORM_REG_DYN_READ_EN                0x00D4
#define PLATFORM_REG_BIST_LOOP_MODE             0x00D8
#define PLATFORM_REG_BT_BIST_LOOP_MODE          0x00DC
#define PLATFORM_REG_BT_BIST_RSTN               0x00E0
#define PLATFORM_REG_BT_BIST_MODE               0x00E4
#define PLATFORM_REG_BT_DRF_BIST_MODE           0x00E8
#define PLATFORM_REG_BT_BIST_TEST_RESUME        0x00EC
#define PLATFORM_REG_BT_BIST_START_PAUSE        0x00F0
#define PLATFORM_REG_BT_BIST_DONE               0x00F4
#define PLATFORM_REG_BT_BIST_FAIL               0x00F8
#define PLATFORM_REG_BT_DRF_BIST_DONE           0x00FC
#define PLATFORM_REG_BT_DRF_BIST_FAIL           0x0100
#define PLATFORM_Reserved_6                     0x0130
#define PLATFORM_Reserved_7                     0x0134
#define PLATFORM_REG_WDT_CTL                    0x01E0
#define PLATFORM_REG_WDT_KICK                   0x01E4
#define PLATFORM_REG_WDT_CURRENT                0x01E8
#define PLATFORM_REG_WDT_VER                    0x01EC
#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL        0x01F0
#define PLATFORM_RNGControlRegister             0x0200
#define PLATFORM_Reserved_8                     0x0204
#define PLATFORM_Reserved_9                     0x0208
#define PLATFORM_Reserved_10                    0x020C
#define PLATFORM_Reserved_11                    0x0210
#define PLATFORM_Reserved_12                    0x0214
#define PLATFORM_Reserved_13                    0x0218
#define PLATFORM_RNG_return0                    0x021C
#define PLATFORM_RNG_return1                    0x0220
#define PLATFORM_RNG_return2                    0x0224
#define PLATFORM_RNG_result                     0x0228
#define PLATFORM_RNG_lfsr_poly_lsb              0x022C
#define PLATFORM_RNG_lfsr_poly_msb              0x0230
#define PLATFORM_Reserved_14                    0x0234
#define PLATFORM_RNG_POWER                      0x0238
#define PLATFORM_RNG_st                         0x023C
#define PLATFORM_RNG_st_return                  0x0240
#define PLATFORM_Reserved_15                    0x0244
#define PLATFORM_Reserved_16                    0x0248
#define PLATFORM_Reserved_17                    0x024C
#define PLATFORM_Reserved_18                    0x0250
#define PLATFORM_RNGinterrupt                   0x0254
#define PLATFORM_Reserved_19                    0x0258
#define PLATFORM_Reserved_20                    0x025C
#define PLATFORM_RNG_st_thr_err                 0x0260
#define PLATFORM_RNGinterruptenable             0x0264
#define PLATFORM_SPIC0PGMfifointerrtup0         0x02cc
#define PLATFORM_SPIC0PGMfifointerrtup1         0x02d0
#define PLATFORM_SPIC0PGMfifointerrtup2         0x02d4
#define PLATFORM_SPIC0PGMfifointerrtup3         0x02d8
#define PLATFORM_SPIC0PGMfifointerrtup4         0x02dc
#define PLATFORM_SPIC0PGMfifointerrtup5         0x02e0
#define PLATFORM_SPIC0PGMfifointerrtup6         0x02e4
#define PLATFORM_SPIC0PGMfifointerrtup7         0x02e8
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS     0x02ec
#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS      0x02f0
#define PLATFORM_REG_TIMER1_EVNT_STS            0x02f4
#define PLATFORM_REG_TIMER1_TASK_STS            0x02f8
#define PLATFORM_REG_GPIO_0_EVNT_STS            0x02fc
#define PLATFORM_REG_GPIO_1_EVENT_STS           0x0300
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS      0x0314
#define PLATFORM_REG_GPIO_1_TASK_DRCLR_STS      0x0318
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS      0x031c
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS      0x0320
#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS   0x0324
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS   0x0328
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS        0x0344
#define PLATFORM_REG_I2C0_TASK_EVNT_STS         0x0348
#define PLATFORM_REG_I2C1_TASK_EVNT_STS         0x034c
#define PLATFORM_REG_AUXADC_TASK_EVNT_STS       0x0350
#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS     0x0354
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS     0x0358
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS      0x035c
#define PLATFORM_REG_TMETER_TASK_EVNT_STS       0x0364
#define PLATFORM_REG_DMA_TASK_EVNT_STS          0x0368
#define PLATFORM_REG_SDMK_TASK_EVNT_STS         0x036C
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS   0x0370
#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS   0x0374

/* 0x0000   0x4000_6000
    31:0    R       RESERVED                                            32'h0
 */
typedef union _PLATFORM_REG_RSVD_0000_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED;
    };
} PLATFORM_REG_RSVD_0000_TYPE;

/*0x4000_6000 PLATFORM_REG_RSVD_0000*/
#define PLATFORM_REG_RSVD_0000_RESERVED_Pos                                                                  0U
#define PLATFORM_REG_RSVD_0000_RESERVED_Msk                                                                  (0xFFFFFFFFUL << PLATFORM_REG_RSVD_0000_RESERVED_Pos)

