rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/* 0x0004   0x4000_6004
    0       R       RESERVED_15                                         0
    1       R       RESERVED_14                                         0
    2       R       RESERVED_13                                         0
    3       R       RESERVED_12                                         0
    4       R       RESERVED_11                                         0
    5       R       RESERVED_10                                         0
    6       R       RESERVED_9                                          0
    7       R       RESERVED_8                                          0
    8       R       RESERVED_7                                          0
    9       R       RESERVED_6                                          0
    10      R       RESERVED_5                                          0
    11      R       RESERVED_4                                          0
    12      R       RESERVED_3                                          0
    13      R       RESERVED_2                                          0
    14      R       RESERVED_1                                          0
    15      R/W1C   utmi_resume_intr                                    0
    31:16   R       RESERVED                                            15'h0
 */
typedef union _PLATFORM_REG_LOW_PRI_INT_STATUS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RESERVED_15: 1;
        uint32_t RESERVED_14: 1;
        uint32_t RESERVED_13: 1;
        uint32_t RESERVED_12: 1;
        uint32_t RESERVED_11: 1;
        uint32_t RESERVED_10: 1;
        uint32_t RESERVED_9: 1;
        uint32_t RESERVED_8: 1;
        uint32_t RESERVED_7: 1;
        uint32_t RESERVED_6: 1;
        uint32_t RESERVED_5: 1;
        uint32_t RESERVED_4: 1;
        uint32_t RESERVED_3: 1;
        uint32_t RESERVED_2: 1;
        uint32_t RESERVED_1: 1;
        uint32_t utmi_resume_intr: 1;
        uint32_t RESERVED: 16;
    };
} PLATFORM_REG_LOW_PRI_INT_STATUS_TYPE;

/*0x4000_6004 PLATFORM_REG_LOW_PRI_INT_STATUS*/
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_15_Pos                                                      0U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_15_Msk                                                      (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_15_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_14_Pos                                                      1U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_14_Msk                                                      (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_14_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_13_Pos                                                      2U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_13_Msk                                                      (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_13_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_12_Pos                                                      3U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_12_Msk                                                      (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_12_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_11_Pos                                                      4U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_11_Msk                                                      (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_11_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_10_Pos                                                      5U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_10_Msk                                                      (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_10_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_9_Pos                                                       6U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_9_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_9_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_8_Pos                                                       7U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_8_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_8_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_7_Pos                                                       8U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_7_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_7_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_6_Pos                                                       9U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_6_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_6_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_5_Pos                                                       10U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_5_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_5_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_4_Pos                                                       11U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_4_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_4_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_3_Pos                                                       12U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_3_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_3_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_2_Pos                                                       13U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_2_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_2_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_1_Pos                                                       14U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_1_Msk                                                       (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_1_Pos)

