rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_LOW_PRI_INT_STATUS_utmi_resume_intr_Pos                                                 15U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_utmi_resume_intr_Msk                                                 (0x1UL << PLATFORM_REG_LOW_PRI_INT_STATUS_utmi_resume_intr_Pos)

#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_Pos                                                         16U
#define PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_Msk                                                         (0xFFFFUL << PLATFORM_REG_LOW_PRI_INT_STATUS_RESERVED_Pos)

/* 0x0008   0x4000_6008
    15:0    R/W     BIT_LOW_PRI_INT_MODE                                16'hFFFF
    31:16   R       RSVD                                                16'h0
 */
typedef union _PLATFORM_REG_LOW_PRI_INT_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BIT_LOW_PRI_INT_MODE: 16;
        uint32_t RSVD: 16;
    };
} PLATFORM_REG_LOW_PRI_INT_MODE_TYPE;

/*0x4000_6008 PLATFORM_REG_LOW_PRI_INT_MODE*/
#define PLATFORM_REG_LOW_PRI_INT_MODE_BIT_LOW_PRI_INT_MODE_Pos                                               0U
#define PLATFORM_REG_LOW_PRI_INT_MODE_BIT_LOW_PRI_INT_MODE_Msk                                               (0xFFFFUL << PLATFORM_REG_LOW_PRI_INT_MODE_BIT_LOW_PRI_INT_MODE_Pos)

#define PLATFORM_REG_LOW_PRI_INT_MODE_RSVD_Pos                                                               16U
#define PLATFORM_REG_LOW_PRI_INT_MODE_RSVD_Msk                                                               (0xFFFFUL << PLATFORM_REG_LOW_PRI_INT_MODE_RSVD_Pos)

/* 0x000c   0x4000_600c
    15:0    R/W     BIT_LOW_PRI_INT_EN                                  16'h0
    31:16   R       RSVD                                                16'h0
 */
typedef union _PLATFORM_REG_LOW_PRI_INT_EN_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BIT_LOW_PRI_INT_EN: 16;
        uint32_t RSVD: 16;
    };
} PLATFORM_REG_LOW_PRI_INT_EN_TYPE;

/*0x4000_600c PLATFORM_REG_LOW_PRI_INT_EN*/
#define PLATFORM_REG_LOW_PRI_INT_EN_BIT_LOW_PRI_INT_EN_Pos                                                   0U
#define PLATFORM_REG_LOW_PRI_INT_EN_BIT_LOW_PRI_INT_EN_Msk                                                   (0xFFFFUL << PLATFORM_REG_LOW_PRI_INT_EN_BIT_LOW_PRI_INT_EN_Pos)

#define PLATFORM_REG_LOW_PRI_INT_EN_RSVD_Pos                                                                 16U
#define PLATFORM_REG_LOW_PRI_INT_EN_RSVD_Msk                                                                 (0xFFFFUL << PLATFORM_REG_LOW_PRI_INT_EN_RSVD_Pos)

/* 0x0010   0x4000_6010
    0       R       timer_intr1andtimer_intr0                           0
    1       R       bluewiz_intr_r                                      0
    2       R       hci_dma_intr                                        0
    3       R       btverdor_reg_intr                                   0
    4       R       pro_intr_r                                          0
    31:5    R       RSVD                                                27'h0
 */
typedef union _PLATFORM_BTMACinterrupt_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t timer_intr1andtimer_intr0: 1;
        uint32_t bluewiz_intr_r: 1;
        uint32_t hci_dma_intr: 1;
        uint32_t btverdor_reg_intr: 1;
        uint32_t pro_intr_r: 1;
        uint32_t RSVD: 27;
    };
} PLATFORM_BTMACinterrupt_TYPE;

/*0x4000_6010 PLATFORM_BTMACinterrupt*/
#define PLATFORM_BTMACinterrupt_timer_intr1andtimer_intr0_Pos                                                0U
#define PLATFORM_BTMACinterrupt_timer_intr1andtimer_intr0_Msk                                                (0x1UL << PLATFORM_BTMACinterrupt_timer_intr1andtimer_intr0_Pos)

#define PLATFORM_BTMACinterrupt_bluewiz_intr_r_Pos                                                           1U
#define PLATFORM_BTMACinterrupt_bluewiz_intr_r_Msk                                                           (0x1UL << PLATFORM_BTMACinterrupt_bluewiz_intr_r_Pos)

#define PLATFORM_BTMACinterrupt_hci_dma_intr_Pos                                                             2U
#define PLATFORM_BTMACinterrupt_hci_dma_intr_Msk                                                             (0x1UL << PLATFORM_BTMACinterrupt_hci_dma_intr_Pos)

#define PLATFORM_BTMACinterrupt_btverdor_reg_intr_Pos                                                        3U
#define PLATFORM_BTMACinterrupt_btverdor_reg_intr_Msk                                                        (0x1UL << PLATFORM_BTMACinterrupt_btverdor_reg_intr_Pos)

#define PLATFORM_BTMACinterrupt_pro_intr_r_Pos                                                               4U
#define PLATFORM_BTMACinterrupt_pro_intr_r_Msk                                                               (0x1UL << PLATFORM_BTMACinterrupt_pro_intr_r_Pos)

#define PLATFORM_BTMACinterrupt_RSVD_Pos                                                                     5U
#define PLATFORM_BTMACinterrupt_RSVD_Msk                                                                     (0x7FFFFFFUL << PLATFORM_BTMACinterrupt_RSVD_Pos)

/* 0x0014   0x4000_6014
    15:0    R       RSVD_2                                              16'h0
    16      R       rxi300_intr                                         0
    17      R       rdp_intr                                            0
    18      R       rxi300_ah_intr                                      0
    23:19   R       RSVD_1                                              5'h0
    24      R/W     rxi300_intr_en                                      1
    25      R/W     rdp_intr_en                                         0
    26      R/W     rxi300_ah_intr_en                                   0
    31:27   R       RSVD                                                5'h0
 */
typedef union _PLATFORM_RXIinterrupt_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_2: 16;
        uint32_t rxi300_intr: 1;
        uint32_t rdp_intr: 1;
        uint32_t rxi300_ah_intr: 1;
        uint32_t RSVD_1: 5;
        uint32_t rxi300_intr_en: 1;
        uint32_t rdp_intr_en: 1;
        uint32_t rxi300_ah_intr_en: 1;
        uint32_t RSVD: 5;
    };
} PLATFORM_RXIinterrupt_TYPE;

