rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_6014 PLATFORM_RXIinterrupt*/
#define PLATFORM_RXIinterrupt_RSVD_2_Pos                                                                     0U
#define PLATFORM_RXIinterrupt_RSVD_2_Msk                                                                     (0xFFFFUL << PLATFORM_RXIinterrupt_RSVD_2_Pos)

#define PLATFORM_RXIinterrupt_rxi300_intr_Pos                                                                16U
#define PLATFORM_RXIinterrupt_rxi300_intr_Msk                                                                (0x1UL << PLATFORM_RXIinterrupt_rxi300_intr_Pos)

#define PLATFORM_RXIinterrupt_rdp_intr_Pos                                                                   17U
#define PLATFORM_RXIinterrupt_rdp_intr_Msk                                                                   (0x1UL << PLATFORM_RXIinterrupt_rdp_intr_Pos)

#define PLATFORM_RXIinterrupt_rxi300_ah_intr_Pos                                                             18U
#define PLATFORM_RXIinterrupt_rxi300_ah_intr_Msk                                                             (0x1UL << PLATFORM_RXIinterrupt_rxi300_ah_intr_Pos)

#define PLATFORM_RXIinterrupt_RSVD_1_Pos                                                                     19U
#define PLATFORM_RXIinterrupt_RSVD_1_Msk                                                                     (0x1FUL << PLATFORM_RXIinterrupt_RSVD_1_Pos)

#define PLATFORM_RXIinterrupt_rxi300_intr_en_Pos                                                             24U
#define PLATFORM_RXIinterrupt_rxi300_intr_en_Msk                                                             (0x1UL << PLATFORM_RXIinterrupt_rxi300_intr_en_Pos)

#define PLATFORM_RXIinterrupt_rdp_intr_en_Pos                                                                25U
#define PLATFORM_RXIinterrupt_rdp_intr_en_Msk                                                                (0x1UL << PLATFORM_RXIinterrupt_rdp_intr_en_Pos)

#define PLATFORM_RXIinterrupt_rxi300_ah_intr_en_Pos                                                          26U
#define PLATFORM_RXIinterrupt_rxi300_ah_intr_en_Msk                                                          (0x1UL << PLATFORM_RXIinterrupt_rxi300_ah_intr_en_Pos)

#define PLATFORM_RXIinterrupt_RSVD_Pos                                                                       27U
#define PLATFORM_RXIinterrupt_RSVD_Msk                                                                       (0x1FUL << PLATFORM_RXIinterrupt_RSVD_Pos)

/* 0x0018   0x4000_6018
    15:0    R/W     int_pol                                             16'h0
    31:16   R       RSVD                                                16'h0
 */
typedef union _PLATFORM_Interruptedgeoption_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t int_pol: 16;
        uint32_t RSVD: 16;
    };
} PLATFORM_Interruptedgeoption_TYPE;

/*0x4000_6018 PLATFORM_Interruptedgeoption*/
#define PLATFORM_Interruptedgeoption_int_pol_Pos                                                             0U
#define PLATFORM_Interruptedgeoption_int_pol_Msk                                                             (0xFFFFUL << PLATFORM_Interruptedgeoption_int_pol_Pos)

#define PLATFORM_Interruptedgeoption_RSVD_Pos                                                                16U
#define PLATFORM_Interruptedgeoption_RSVD_Msk                                                                (0xFFFFUL << PLATFORM_Interruptedgeoption_RSVD_Pos)

/* 0x001C   0x4000_601c
    13:0    R/W     debug_sel                                           14'h0
    15:14   R/W     uart_force_cg_en                                    2'h0
    23:16   R/W     IRQLATENCY                                          8'h0
    24      R/W     uart0_pclk_no_latency_en                            1'h0
    25      R/W     uart1_pclk_no_latency_en                            1'h0
    26      R/W     uart2_pclk_no_latency_en                            1'h0
    27      R/W     uart3_pclk_no_latency_en                            1'h0
    28      R       RSVD_1                                              1'h0
    29      R/W     spi_speed_up_sim                                    0
    30      R       RSVD                                                0
    31      R/W     uartlog_sir_inv                                     0
 */
typedef union _PLATFORM_REG_DEBUG_SEL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t debug_sel: 14;
        uint32_t uart_force_cg_en: 2;
        uint32_t IRQLATENCY: 8;
        uint32_t uart0_pclk_no_latency_en: 1;
        uint32_t uart1_pclk_no_latency_en: 1;
        uint32_t uart2_pclk_no_latency_en: 1;
        uint32_t uart3_pclk_no_latency_en: 1;
        uint32_t RSVD_1: 1;
        uint32_t spi_speed_up_sim: 1;
        uint32_t RSVD: 1;
        uint32_t uartlog_sir_inv: 1;
    };
} PLATFORM_REG_DEBUG_SEL_TYPE;

/*0x4000_601c PLATFORM_REG_DEBUG_SEL*/
#define PLATFORM_REG_DEBUG_SEL_debug_sel_Pos                                                                 0U
#define PLATFORM_REG_DEBUG_SEL_debug_sel_Msk                                                                 (0x3FFFUL << PLATFORM_REG_DEBUG_SEL_debug_sel_Pos)

#define PLATFORM_REG_DEBUG_SEL_uart_force_cg_en_Pos                                                          14U
#define PLATFORM_REG_DEBUG_SEL_uart_force_cg_en_Msk                                                          (0x3UL << PLATFORM_REG_DEBUG_SEL_uart_force_cg_en_Pos)

#define PLATFORM_REG_DEBUG_SEL_IRQLATENCY_Pos                                                                16U
#define PLATFORM_REG_DEBUG_SEL_IRQLATENCY_Msk                                                                (0xFFUL << PLATFORM_REG_DEBUG_SEL_IRQLATENCY_Pos)

#define PLATFORM_REG_DEBUG_SEL_uart0_pclk_no_latency_en_Pos                                                  24U
#define PLATFORM_REG_DEBUG_SEL_uart0_pclk_no_latency_en_Msk                                                  (0x1UL << PLATFORM_REG_DEBUG_SEL_uart0_pclk_no_latency_en_Pos)

