rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_DEBUG_SEL_uart1_pclk_no_latency_en_Pos                                                  25U
#define PLATFORM_REG_DEBUG_SEL_uart1_pclk_no_latency_en_Msk                                                  (0x1UL << PLATFORM_REG_DEBUG_SEL_uart1_pclk_no_latency_en_Pos)

#define PLATFORM_REG_DEBUG_SEL_uart2_pclk_no_latency_en_Pos                                                  26U
#define PLATFORM_REG_DEBUG_SEL_uart2_pclk_no_latency_en_Msk                                                  (0x1UL << PLATFORM_REG_DEBUG_SEL_uart2_pclk_no_latency_en_Pos)

#define PLATFORM_REG_DEBUG_SEL_uart3_pclk_no_latency_en_Pos                                                  27U
#define PLATFORM_REG_DEBUG_SEL_uart3_pclk_no_latency_en_Msk                                                  (0x1UL << PLATFORM_REG_DEBUG_SEL_uart3_pclk_no_latency_en_Pos)

#define PLATFORM_REG_DEBUG_SEL_RSVD_1_Pos                                                                    28U
#define PLATFORM_REG_DEBUG_SEL_RSVD_1_Msk                                                                    (0x1UL << PLATFORM_REG_DEBUG_SEL_RSVD_1_Pos)

#define PLATFORM_REG_DEBUG_SEL_spi_speed_up_sim_Pos                                                          29U
#define PLATFORM_REG_DEBUG_SEL_spi_speed_up_sim_Msk                                                          (0x1UL << PLATFORM_REG_DEBUG_SEL_spi_speed_up_sim_Pos)

#define PLATFORM_REG_DEBUG_SEL_RSVD_Pos                                                                      30U
#define PLATFORM_REG_DEBUG_SEL_RSVD_Msk                                                                      (0x1UL << PLATFORM_REG_DEBUG_SEL_RSVD_Pos)

#define PLATFORM_REG_DEBUG_SEL_uartlog_sir_inv_Pos                                                           31U
#define PLATFORM_REG_DEBUG_SEL_uartlog_sir_inv_Msk                                                           (0x1UL << PLATFORM_REG_DEBUG_SEL_uartlog_sir_inv_Pos)

/* 0x0020   0x4000_6020
    0       R/W     BIT_I2C0_TX_BIT_SWAP_EN                             0
    1       R/W     BIT_I2C0_RX_BIT_SWAP_EN                             0
    2       R/W     BIT_I2C1_TX_BIT_SWAP_EN                             0
    3       R/W     BIT_I2C1_RX_BIT_SWAP_EN                             0
    4       R/W     BIT_I2C2_TX_BIT_SWAP_EN                             0
    5       R/W     BIT_I2C2_RX_BIT_SWAP_EN                             0
    6       R/W     BIT_I2C3_TX_BIT_SWAP_EN                             0
    7       R/W     BIT_I2C3_RX_BIT_SWAP_EN                             0
    8       R/W     BIT_SPI0_TX_BIT_SWAP_EN                             0
    9       R/W     BIT_SPI0_RX_BIT_SWAP_EN                             0
    10      R/W     BIT_SPI1_TX_BIT_SWAP_EN                             0
    11      R/W     BIT_SPI1_RX_BIT_SWAP_EN                             0
    12      R/W     BIT_SPI2_TX_BIT_SWAP_EN                             0
    13      R/W     BIT_SPI2_RX_BIT_SWAP_EN                             0
    15:14   R       RSVD_1                                              2'h0
    16      R/W     SPI0_TX_BYTE_SWAP_EN                                0
    17      R/W     SPI0_RX_BYTE_SWAP_EN                                0
    18      R/W     SPI1_TX_BYTE_SWAP_EN                                0
    19      R/W     SPI1_RX_BYTE_SWAP_EN                                0
    20      R/W     SPI2_TX_BYTE_SWAP_EN                                0
    21      R/W     SPI2_RX_BYTE_SWAP_EN                                0
    28:22   R       RSVD                                                7'h0
    29      W1O     EFUSE_RP_bk1                                        0
    30      W1O     EFUSE_WP                                            0
    31      W1O     EFUSE_RP                                            0
 */
typedef union _PLATFORM_REG_DATA_FIFO_SWAP_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t BIT_I2C0_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C0_RX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C1_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C1_RX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C2_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C2_RX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C3_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_I2C3_RX_BIT_SWAP_EN: 1;
        uint32_t BIT_SPI0_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_SPI0_RX_BIT_SWAP_EN: 1;
        uint32_t BIT_SPI1_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_SPI1_RX_BIT_SWAP_EN: 1;
        uint32_t BIT_SPI2_TX_BIT_SWAP_EN: 1;
        uint32_t BIT_SPI2_RX_BIT_SWAP_EN: 1;
        uint32_t RSVD_1: 2;
        uint32_t SPI0_TX_BYTE_SWAP_EN: 1;
        uint32_t SPI0_RX_BYTE_SWAP_EN: 1;
        uint32_t SPI1_TX_BYTE_SWAP_EN: 1;
        uint32_t SPI1_RX_BYTE_SWAP_EN: 1;
        uint32_t SPI2_TX_BYTE_SWAP_EN: 1;
        uint32_t SPI2_RX_BYTE_SWAP_EN: 1;
        uint32_t RSVD: 7;
        uint32_t EFUSE_RP_bk1: 1;
        uint32_t EFUSE_WP: 1;
        uint32_t EFUSE_RP: 1;
    };
} PLATFORM_REG_DATA_FIFO_SWAP_CTRL_TYPE;

/*0x4000_6020 PLATFORM_REG_DATA_FIFO_SWAP_CTRL*/
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C0_TX_BIT_SWAP_EN_Pos                                         0U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C0_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C0_TX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C0_RX_BIT_SWAP_EN_Pos                                         1U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C0_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C0_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C1_TX_BIT_SWAP_EN_Pos                                         2U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C1_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C1_TX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C1_RX_BIT_SWAP_EN_Pos                                         3U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C1_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C1_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C2_TX_BIT_SWAP_EN_Pos                                         4U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C2_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C2_TX_BIT_SWAP_EN_Pos)

