rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C2_RX_BIT_SWAP_EN_Pos                                         5U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C2_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C2_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C3_TX_BIT_SWAP_EN_Pos                                         6U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C3_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C3_TX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C3_RX_BIT_SWAP_EN_Pos                                         7U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C3_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_I2C3_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI0_TX_BIT_SWAP_EN_Pos                                         8U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI0_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI0_TX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI0_RX_BIT_SWAP_EN_Pos                                         9U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI0_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI0_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI1_TX_BIT_SWAP_EN_Pos                                         10U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI1_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI1_TX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI1_RX_BIT_SWAP_EN_Pos                                         11U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI1_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI1_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI2_TX_BIT_SWAP_EN_Pos                                         12U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI2_TX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI2_TX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI2_RX_BIT_SWAP_EN_Pos                                         13U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI2_RX_BIT_SWAP_EN_Msk                                         (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_BIT_SPI2_RX_BIT_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_RSVD_1_Pos                                                          14U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_RSVD_1_Msk                                                          (0x3UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_RSVD_1_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI0_TX_BYTE_SWAP_EN_Pos                                            16U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI0_TX_BYTE_SWAP_EN_Msk                                            (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI0_TX_BYTE_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI0_RX_BYTE_SWAP_EN_Pos                                            17U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI0_RX_BYTE_SWAP_EN_Msk                                            (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI0_RX_BYTE_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI1_TX_BYTE_SWAP_EN_Pos                                            18U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI1_TX_BYTE_SWAP_EN_Msk                                            (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI1_TX_BYTE_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI1_RX_BYTE_SWAP_EN_Pos                                            19U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI1_RX_BYTE_SWAP_EN_Msk                                            (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI1_RX_BYTE_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI2_TX_BYTE_SWAP_EN_Pos                                            20U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI2_TX_BYTE_SWAP_EN_Msk                                            (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI2_TX_BYTE_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI2_RX_BYTE_SWAP_EN_Pos                                            21U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI2_RX_BYTE_SWAP_EN_Msk                                            (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_SPI2_RX_BYTE_SWAP_EN_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_RSVD_Pos                                                            22U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_RSVD_Msk                                                            (0x7FUL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_RSVD_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_RP_bk1_Pos                                                    29U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_RP_bk1_Msk                                                    (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_RP_bk1_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_WP_Pos                                                        30U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_WP_Msk                                                        (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_WP_Pos)

#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_RP_Pos                                                        31U
#define PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_RP_Msk                                                        (0x1UL << PLATFORM_REG_DATA_FIFO_SWAP_CTRL_EFUSE_RP_Pos)

/* 0x0024   0x4000_6024
    0       R       RSVD_11                                             0
    1       R       RSVD_10                                             0
    2       R       RSVD_9                                              0
    3       R       RSVD_8                                              0
    4       R       RSVD_7                                              0
    5       R       RSVD_6                                              0
    6       R       RSVD_5                                              0
    7       R       RSVD_4                                              0
    8       R/W     spic0_mem_wr_en                                     0
    9       R/W     spic1_mem_wr_en                                     0
    10      W1O     dram_c2s_remap_dis                                  1
    11      R/W     spic_icg_disable                                    0
    12      R/W     ic_icg_disable                                      0
    13      R/W     dmac_clk_always_disable                             0
    14      R/W     dmac_clk_always_enable                              0
    15      R/W     rxi300_auto_icg_en                                  1
    23:16   R/W     RSVD_3                                              8'h0
    24      W1O     dram_c2s_remap_dis_wlock                            0
    25      R/W     RSVD_2                                              0
    26      R/W     RSVD_1                                              0
    30:27   R       RSVD                                                4'd0
    31      R/W     fwpi_enable                                         1
 */
typedef union _PLATFORM_DUMMY_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_11: 1;
        uint32_t RSVD_10: 1;
        uint32_t RSVD_9: 1;
        uint32_t RSVD_8: 1;
        uint32_t RSVD_7: 1;
        uint32_t RSVD_6: 1;
        uint32_t RSVD_5: 1;
        uint32_t RSVD_4: 1;
        uint32_t spic0_mem_wr_en: 1;
        uint32_t spic1_mem_wr_en: 1;
        uint32_t dram_c2s_remap_dis: 1;
        uint32_t spic_icg_disable: 1;
        uint32_t ic_icg_disable: 1;
        uint32_t dmac_clk_always_disable: 1;
        uint32_t dmac_clk_always_enable: 1;
        uint32_t rxi300_auto_icg_en: 1;
        uint32_t RSVD_3: 8;
        uint32_t dram_c2s_remap_dis_wlock: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 4;
        uint32_t fwpi_enable: 1;
    };
} PLATFORM_DUMMY_TYPE;

/*0x4000_6024 PLATFORM_DUMMY*/
#define PLATFORM_DUMMY_RSVD_11_Pos                                                                           0U
#define PLATFORM_DUMMY_RSVD_11_Msk                                                                           (0x1UL << PLATFORM_DUMMY_RSVD_11_Pos)

#define PLATFORM_DUMMY_RSVD_10_Pos                                                                           1U
#define PLATFORM_DUMMY_RSVD_10_Msk                                                                           (0x1UL << PLATFORM_DUMMY_RSVD_10_Pos)

#define PLATFORM_DUMMY_RSVD_9_Pos                                                                            2U
#define PLATFORM_DUMMY_RSVD_9_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_9_Pos)

#define PLATFORM_DUMMY_RSVD_8_Pos                                                                            3U
#define PLATFORM_DUMMY_RSVD_8_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_8_Pos)

