rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_DUMMY_RSVD_7_Pos                                                                            4U
#define PLATFORM_DUMMY_RSVD_7_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_7_Pos)

#define PLATFORM_DUMMY_RSVD_6_Pos                                                                            5U
#define PLATFORM_DUMMY_RSVD_6_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_6_Pos)

#define PLATFORM_DUMMY_RSVD_5_Pos                                                                            6U
#define PLATFORM_DUMMY_RSVD_5_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_5_Pos)

#define PLATFORM_DUMMY_RSVD_4_Pos                                                                            7U
#define PLATFORM_DUMMY_RSVD_4_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_4_Pos)

#define PLATFORM_DUMMY_spic0_mem_wr_en_Pos                                                                   8U
#define PLATFORM_DUMMY_spic0_mem_wr_en_Msk                                                                   (0x1UL << PLATFORM_DUMMY_spic0_mem_wr_en_Pos)

#define PLATFORM_DUMMY_spic1_mem_wr_en_Pos                                                                   9U
#define PLATFORM_DUMMY_spic1_mem_wr_en_Msk                                                                   (0x1UL << PLATFORM_DUMMY_spic1_mem_wr_en_Pos)

#define PLATFORM_DUMMY_dram_c2s_remap_dis_Pos                                                                10U
#define PLATFORM_DUMMY_dram_c2s_remap_dis_Msk                                                                (0x1UL << PLATFORM_DUMMY_dram_c2s_remap_dis_Pos)

#define PLATFORM_DUMMY_spic_icg_disable_Pos                                                                  11U
#define PLATFORM_DUMMY_spic_icg_disable_Msk                                                                  (0x1UL << PLATFORM_DUMMY_spic_icg_disable_Pos)

#define PLATFORM_DUMMY_ic_icg_disable_Pos                                                                    12U
#define PLATFORM_DUMMY_ic_icg_disable_Msk                                                                    (0x1UL << PLATFORM_DUMMY_ic_icg_disable_Pos)

#define PLATFORM_DUMMY_dmac_clk_always_disable_Pos                                                           13U
#define PLATFORM_DUMMY_dmac_clk_always_disable_Msk                                                           (0x1UL << PLATFORM_DUMMY_dmac_clk_always_disable_Pos)

#define PLATFORM_DUMMY_dmac_clk_always_enable_Pos                                                            14U
#define PLATFORM_DUMMY_dmac_clk_always_enable_Msk                                                            (0x1UL << PLATFORM_DUMMY_dmac_clk_always_enable_Pos)

#define PLATFORM_DUMMY_rxi300_auto_icg_en_Pos                                                                15U
#define PLATFORM_DUMMY_rxi300_auto_icg_en_Msk                                                                (0x1UL << PLATFORM_DUMMY_rxi300_auto_icg_en_Pos)

#define PLATFORM_DUMMY_RSVD_3_Pos                                                                            16U
#define PLATFORM_DUMMY_RSVD_3_Msk                                                                            (0xFFUL << PLATFORM_DUMMY_RSVD_3_Pos)

#define PLATFORM_DUMMY_dram_c2s_remap_dis_wlock_Pos                                                          24U
#define PLATFORM_DUMMY_dram_c2s_remap_dis_wlock_Msk                                                          (0x1UL << PLATFORM_DUMMY_dram_c2s_remap_dis_wlock_Pos)

#define PLATFORM_DUMMY_RSVD_2_Pos                                                                            25U
#define PLATFORM_DUMMY_RSVD_2_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_2_Pos)

#define PLATFORM_DUMMY_RSVD_1_Pos                                                                            26U
#define PLATFORM_DUMMY_RSVD_1_Msk                                                                            (0x1UL << PLATFORM_DUMMY_RSVD_1_Pos)

#define PLATFORM_DUMMY_RSVD_Pos                                                                              27U
#define PLATFORM_DUMMY_RSVD_Msk                                                                              (0xFUL << PLATFORM_DUMMY_RSVD_Pos)

#define PLATFORM_DUMMY_fwpi_enable_Pos                                                                       31U
#define PLATFORM_DUMMY_fwpi_enable_Msk                                                                       (0x1UL << PLATFORM_DUMMY_fwpi_enable_Pos)

/* 0x0028   0x4000_6028
    5:0     R/W     enhtimer_gpio_trig_sel                              6'h3f
    6       R/W     RSVD_2                                              0
    7       R/W     RSVD_1                                              0
    23:8    R/W     enhtimer_gpio_trig_deb_cnt_limit                    16'h1
    24      R/W     enhtimer_gpio_trig_deb_en                           1'h0
    25      R       enhtimer_gpio_trig_deb_sts                          1'h0
    29:26   R       RSVD                                                4'h0
    30      R/W     enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_data   1'h0
    31      R/W     enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_en     1'h0
 */
typedef union _PLATFORM_REG_ENHTIMER_TRIG_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t enhtimer_gpio_trig_sel: 6;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t enhtimer_gpio_trig_deb_cnt_limit: 16;
        uint32_t enhtimer_gpio_trig_deb_en: 1;
        uint32_t enhtimer_gpio_trig_deb_sts: 1;
        uint32_t RSVD: 4;
        uint32_t enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_data: 1;
        uint32_t enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_en: 1;
    };
} PLATFORM_REG_ENHTIMER_TRIG_CTRL_TYPE;

