rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_6028 PLATFORM_REG_ENHTIMER_TRIG_CTRL*/
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_sel_Pos                                           0U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_sel_Msk                                           (0x3FUL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_sel_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_2_Pos                                                           6U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_2_Msk                                                           (0x1UL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_2_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_1_Pos                                                           7U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_1_Msk                                                           (0x1UL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_1_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_cnt_limit_Pos                                 8U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_cnt_limit_Msk                                 (0xFFFFUL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_cnt_limit_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_en_Pos                                        24U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_en_Msk                                        (0x1UL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_en_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_sts_Pos                                       25U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_sts_Msk                                       (0x1UL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_trig_deb_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_Pos                                                             26U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_Msk                                                             (0xFUL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_RSVD_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_data_Pos                30U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_data_Msk                (0x1UL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_data_Pos)

#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_en_Pos                  31U
#define PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_en_Msk                  (0x1UL << PLATFORM_REG_ENHTIMER_TRIG_CTRL_enhtimer_gpio_deb_clk_q_ch_qactive_fw_manual_en_Pos)

/* 0x002C   0x4000_602c
    0       R/W     r_systick_timer_manual_rstb                         0
    1       R/W     r_systick_timer_rst_sel                             1
    31:2    R       RSVD                                                30'h0
 */
typedef union _PLATFORM_REG_SYSTICK_TIMER_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_systick_timer_manual_rstb: 1;
        uint32_t r_systick_timer_rst_sel: 1;
        uint32_t RSVD: 30;
    };
} PLATFORM_REG_SYSTICK_TIMER_CTRL_TYPE;

/*0x4000_602c PLATFORM_REG_SYSTICK_TIMER_CTRL*/
#define PLATFORM_REG_SYSTICK_TIMER_CTRL_r_systick_timer_manual_rstb_Pos                                      0U
#define PLATFORM_REG_SYSTICK_TIMER_CTRL_r_systick_timer_manual_rstb_Msk                                      (0x1UL << PLATFORM_REG_SYSTICK_TIMER_CTRL_r_systick_timer_manual_rstb_Pos)

#define PLATFORM_REG_SYSTICK_TIMER_CTRL_r_systick_timer_rst_sel_Pos                                          1U
#define PLATFORM_REG_SYSTICK_TIMER_CTRL_r_systick_timer_rst_sel_Msk                                          (0x1UL << PLATFORM_REG_SYSTICK_TIMER_CTRL_r_systick_timer_rst_sel_Pos)

#define PLATFORM_REG_SYSTICK_TIMER_CTRL_RSVD_Pos                                                             2U
#define PLATFORM_REG_SYSTICK_TIMER_CTRL_RSVD_Msk                                                             (0x3FFFFFFFUL << PLATFORM_REG_SYSTICK_TIMER_CTRL_RSVD_Pos)

/* 0x0030   0x4000_6030
    31:0    R       cpu_systick_timer_cnt                               32'h0
 */
typedef union _PLATFORM_REG_SYSTICK_TIMER_CNT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t cpu_systick_timer_cnt;
    };
} PLATFORM_REG_SYSTICK_TIMER_CNT_TYPE;

/*0x4000_6030 PLATFORM_REG_SYSTICK_TIMER_CNT*/
#define PLATFORM_REG_SYSTICK_TIMER_CNT_cpu_systick_timer_cnt_Pos                                             0U
#define PLATFORM_REG_SYSTICK_TIMER_CNT_cpu_systick_timer_cnt_Msk                                             (0xFFFFFFFFUL << PLATFORM_REG_SYSTICK_TIMER_CNT_cpu_systick_timer_cnt_Pos)

/* 0x0034   0x4000_6034
    0       R/W     TIMER_INT_EN                                        1'b0
    1       R/W     VLD_TIMER                                           1'b0
    30:2    R       RSVD                                                29'h0
    31      R/W     VLD_TIMER_FAKE_INFPGA                               1'b0
 */
typedef union _PLATFORM_REG_TMETER_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t TIMER_INT_EN: 1;
        uint32_t VLD_TIMER: 1;
        uint32_t RSVD: 29;
        uint32_t VLD_TIMER_FAKE_INFPGA: 1;
    };
} PLATFORM_REG_TMETER_CTRL_TYPE;

/*0x4000_6034 PLATFORM_REG_TMETER_CTRL*/
#define PLATFORM_REG_TMETER_CTRL_TIMER_INT_EN_Pos                                                            0U
#define PLATFORM_REG_TMETER_CTRL_TIMER_INT_EN_Msk                                                            (0x1UL << PLATFORM_REG_TMETER_CTRL_TIMER_INT_EN_Pos)

#define PLATFORM_REG_TMETER_CTRL_VLD_TIMER_Pos                                                               1U
#define PLATFORM_REG_TMETER_CTRL_VLD_TIMER_Msk                                                               (0x1UL << PLATFORM_REG_TMETER_CTRL_VLD_TIMER_Pos)

#define PLATFORM_REG_TMETER_CTRL_RSVD_Pos                                                                    2U
#define PLATFORM_REG_TMETER_CTRL_RSVD_Msk                                                                    (0x1FFFFFFFUL << PLATFORM_REG_TMETER_CTRL_RSVD_Pos)

#define PLATFORM_REG_TMETER_CTRL_VLD_TIMER_FAKE_INFPGA_Pos                                                   31U
#define PLATFORM_REG_TMETER_CTRL_VLD_TIMER_FAKE_INFPGA_Msk                                                   (0x1UL << PLATFORM_REG_TMETER_CTRL_VLD_TIMER_FAKE_INFPGA_Pos)

/* 0x0038   0x4000_6038
    0       R/W1C   VLD_TIMER_INT                                       1'b0
    31:1    R       RSVD                                                31'h0
 */
typedef union _PLATFORM_REG_TMETER_INT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t VLD_TIMER_INT: 1;
        uint32_t RSVD: 31;
    };
} PLATFORM_REG_TMETER_INT_STS_TYPE;

/*0x4000_6038 PLATFORM_REG_TMETER_INT_STS*/
#define PLATFORM_REG_TMETER_INT_STS_VLD_TIMER_INT_Pos                                                        0U
#define PLATFORM_REG_TMETER_INT_STS_VLD_TIMER_INT_Msk                                                        (0x1UL << PLATFORM_REG_TMETER_INT_STS_VLD_TIMER_INT_Pos)

#define PLATFORM_REG_TMETER_INT_STS_RSVD_Pos                                                                 1U
#define PLATFORM_REG_TMETER_INT_STS_RSVD_Msk                                                                 (0x7FFFFFFFUL << PLATFORM_REG_TMETER_INT_STS_RSVD_Pos)

