rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/* 0x003C   0x4000_603c
    0       R/W     cm33_nmi_int_enable                                 1'b0
    31:1    R       RSVD                                                31'h0
 */
typedef union _PLATFORM_REG_CM33_NMI_INT_EN_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t cm33_nmi_int_enable: 1;
        uint32_t RSVD: 31;
    };
} PLATFORM_REG_CM33_NMI_INT_EN_TYPE;

/*0x4000_603c PLATFORM_REG_CM33_NMI_INT_EN*/
#define PLATFORM_REG_CM33_NMI_INT_EN_cm33_nmi_int_enable_Pos                                                 0U
#define PLATFORM_REG_CM33_NMI_INT_EN_cm33_nmi_int_enable_Msk                                                 (0x1UL << PLATFORM_REG_CM33_NMI_INT_EN_cm33_nmi_int_enable_Pos)

#define PLATFORM_REG_CM33_NMI_INT_EN_RSVD_Pos                                                                1U
#define PLATFORM_REG_CM33_NMI_INT_EN_RSVD_Msk                                                                (0x7FFFFFFFUL << PLATFORM_REG_CM33_NMI_INT_EN_RSVD_Pos)

/* 0x0040   0x4000_6040
    0       R/W     bist_rstn_mcu_rom                                   0
    1       R/W     bist_rstn_data_ram                                  0
    2       R/W     bist_rstn_cpu_ram                                   0
    3       R/W     bist_rstn_usb_ram                                   0
    4       R/W     bist_rstn_can_ram                                   0
    5       R/W     bist_rstn_cache_ram                                 0
    6       R/W     bist_rstn_amu_ram                                   0
    31:7    R       RSVD                                                25'h0
 */
typedef union _PLATFORM_REG_BIST_RSTN_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_rstn_mcu_rom: 1;
        uint32_t bist_rstn_data_ram: 1;
        uint32_t bist_rstn_cpu_ram: 1;
        uint32_t bist_rstn_usb_ram: 1;
        uint32_t bist_rstn_can_ram: 1;
        uint32_t bist_rstn_cache_ram: 1;
        uint32_t bist_rstn_amu_ram: 1;
        uint32_t RSVD: 25;
    };
} PLATFORM_REG_BIST_RSTN_TYPE;

/*0x4000_6040 PLATFORM_REG_BIST_RSTN*/
#define PLATFORM_REG_BIST_RSTN_bist_rstn_mcu_rom_Pos                                                         0U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_mcu_rom_Msk                                                         (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_mcu_rom_Pos)

#define PLATFORM_REG_BIST_RSTN_bist_rstn_data_ram_Pos                                                        1U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_data_ram_Msk                                                        (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_data_ram_Pos)

#define PLATFORM_REG_BIST_RSTN_bist_rstn_cpu_ram_Pos                                                         2U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_cpu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_cpu_ram_Pos)

#define PLATFORM_REG_BIST_RSTN_bist_rstn_usb_ram_Pos                                                         3U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_usb_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_usb_ram_Pos)

#define PLATFORM_REG_BIST_RSTN_bist_rstn_can_ram_Pos                                                         4U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_can_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_can_ram_Pos)

#define PLATFORM_REG_BIST_RSTN_bist_rstn_cache_ram_Pos                                                       5U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_cache_ram_Msk                                                       (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_cache_ram_Pos)

#define PLATFORM_REG_BIST_RSTN_bist_rstn_amu_ram_Pos                                                         6U
#define PLATFORM_REG_BIST_RSTN_bist_rstn_amu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_RSTN_bist_rstn_amu_ram_Pos)

#define PLATFORM_REG_BIST_RSTN_RSVD_Pos                                                                      7U
#define PLATFORM_REG_BIST_RSTN_RSVD_Msk                                                                      (0x1FFFFFFUL << PLATFORM_REG_BIST_RSTN_RSVD_Pos)

/* 0x0044   0x4000_6044
    0       R/W     bist_mode_mcu_rom                                   0
    1       R/W     bist_mode_data_ram                                  0
    2       R/W     bist_mode_cpu_ram                                   0
    3       R/W     bist_mode_usb_ram                                   0
    4       R/W     bist_mode_can_ram                                   0
    5       R/W     bist_mode_cache_ram                                 0
    6       R/W     bist_mode_amu_ram                                   0
    31:7    R       RSVD                                                25'h0
 */
typedef union _PLATFORM_REG_BIST_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_mode_mcu_rom: 1;
        uint32_t bist_mode_data_ram: 1;
        uint32_t bist_mode_cpu_ram: 1;
        uint32_t bist_mode_usb_ram: 1;
        uint32_t bist_mode_can_ram: 1;
        uint32_t bist_mode_cache_ram: 1;
        uint32_t bist_mode_amu_ram: 1;
        uint32_t RSVD: 25;
    };
} PLATFORM_REG_BIST_MODE_TYPE;

/*0x4000_6044 PLATFORM_REG_BIST_MODE*/
#define PLATFORM_REG_BIST_MODE_bist_mode_mcu_rom_Pos                                                         0U
#define PLATFORM_REG_BIST_MODE_bist_mode_mcu_rom_Msk                                                         (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_mcu_rom_Pos)

#define PLATFORM_REG_BIST_MODE_bist_mode_data_ram_Pos                                                        1U
#define PLATFORM_REG_BIST_MODE_bist_mode_data_ram_Msk                                                        (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_data_ram_Pos)

#define PLATFORM_REG_BIST_MODE_bist_mode_cpu_ram_Pos                                                         2U
#define PLATFORM_REG_BIST_MODE_bist_mode_cpu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_cpu_ram_Pos)

#define PLATFORM_REG_BIST_MODE_bist_mode_usb_ram_Pos                                                         3U
#define PLATFORM_REG_BIST_MODE_bist_mode_usb_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_usb_ram_Pos)

