rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_BIST_MODE_bist_mode_can_ram_Pos                                                         4U
#define PLATFORM_REG_BIST_MODE_bist_mode_can_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_can_ram_Pos)

#define PLATFORM_REG_BIST_MODE_bist_mode_cache_ram_Pos                                                       5U
#define PLATFORM_REG_BIST_MODE_bist_mode_cache_ram_Msk                                                       (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_cache_ram_Pos)

#define PLATFORM_REG_BIST_MODE_bist_mode_amu_ram_Pos                                                         6U
#define PLATFORM_REG_BIST_MODE_bist_mode_amu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_MODE_bist_mode_amu_ram_Pos)

#define PLATFORM_REG_BIST_MODE_RSVD_Pos                                                                      7U
#define PLATFORM_REG_BIST_MODE_RSVD_Msk                                                                      (0x1FFFFFFUL << PLATFORM_REG_BIST_MODE_RSVD_Pos)

/* 0x0048   0x4000_6048
    0       R/W     bist_mode_drf_data_ram                              0
    1       R/W     bist_mode_drf_cpu_ram                               0
    2       R/W     bist_mode_drf_usb_ram                               0
    3       R/W     bist_mode_drf_can_ram                               0
    4       R/W     bist_mode_drf_cache_ram                             0
    5       R/W     bist_mode_drf_amu_ram                               0
    31:6    R       RSVD                                                26'h0
 */
typedef union _PLATFORM_REG_DRF_BIST_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_mode_drf_data_ram: 1;
        uint32_t bist_mode_drf_cpu_ram: 1;
        uint32_t bist_mode_drf_usb_ram: 1;
        uint32_t bist_mode_drf_can_ram: 1;
        uint32_t bist_mode_drf_cache_ram: 1;
        uint32_t bist_mode_drf_amu_ram: 1;
        uint32_t RSVD: 26;
    };
} PLATFORM_REG_DRF_BIST_MODE_TYPE;

/*0x4000_6048 PLATFORM_REG_DRF_BIST_MODE*/
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_data_ram_Pos                                                0U
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_data_ram_Msk                                                (0x1UL << PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_data_ram_Pos)

#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_cpu_ram_Pos                                                 1U
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_cpu_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_cpu_ram_Pos)

#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_usb_ram_Pos                                                 2U
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_usb_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_usb_ram_Pos)

#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_can_ram_Pos                                                 3U
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_can_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_can_ram_Pos)

#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_cache_ram_Pos                                               4U
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_cache_ram_Msk                                               (0x1UL << PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_cache_ram_Pos)

#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_amu_ram_Pos                                                 5U
#define PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_amu_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_MODE_bist_mode_drf_amu_ram_Pos)

#define PLATFORM_REG_DRF_BIST_MODE_RSVD_Pos                                                                  6U
#define PLATFORM_REG_DRF_BIST_MODE_RSVD_Msk                                                                  (0x3FFFFFFUL << PLATFORM_REG_DRF_BIST_MODE_RSVD_Pos)

/* 0x004C   0x4000_604c
    0       R/W     bist_test_resume_data_ram                           0
    1       R/W     bist_test_resume_cpu_ram                            0
    2       R/W     bist_test_resume_usb_ram                            0
    3       R/W     bist_test_resume_can_ram                            0
    4       R/W     bist_test_resume_cache_ram                          0
    5       R/W     bist_test_resume_amu_ram                            0
    31:6    R       RSVD                                                26'h0
 */
typedef union _PLATFORM_REG_BIST_TEST_RESUME_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_test_resume_data_ram: 1;
        uint32_t bist_test_resume_cpu_ram: 1;
        uint32_t bist_test_resume_usb_ram: 1;
        uint32_t bist_test_resume_can_ram: 1;
        uint32_t bist_test_resume_cache_ram: 1;
        uint32_t bist_test_resume_amu_ram: 1;
        uint32_t RSVD: 26;
    };
} PLATFORM_REG_BIST_TEST_RESUME_TYPE;

/*0x4000_604c PLATFORM_REG_BIST_TEST_RESUME*/
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_data_ram_Pos                                          0U
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_data_ram_Msk                                          (0x1UL << PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_data_ram_Pos)

#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_cpu_ram_Pos                                           1U
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_cpu_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_cpu_ram_Pos)

#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_usb_ram_Pos                                           2U
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_usb_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_usb_ram_Pos)

#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_can_ram_Pos                                           3U
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_can_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_can_ram_Pos)

#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_cache_ram_Pos                                         4U
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_cache_ram_Msk                                         (0x1UL << PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_cache_ram_Pos)

#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_amu_ram_Pos                                           5U
#define PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_amu_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_TEST_RESUME_bist_test_resume_amu_ram_Pos)

#define PLATFORM_REG_BIST_TEST_RESUME_RSVD_Pos                                                               6U
#define PLATFORM_REG_BIST_TEST_RESUME_RSVD_Msk                                                               (0x3FFFFFFUL << PLATFORM_REG_BIST_TEST_RESUME_RSVD_Pos)

/* 0x0050   0x4000_6050
    0       R       bist_start_pause_data_ram                           0
    1       R       bist_start_pause_cpu_ram                            0
    2       R       bist_start_pause_usb_ram                            0
    3       R       bist_start_pause_can_ram                            0
    4       R       bist_start_pause_cache_ram                          0
    5       R       bist_start_pause_amu_ram                            0
    31:6    R       RSVD                                                26'h0
 */
typedef union _PLATFORM_REG_BIST_START_PAUSE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_start_pause_data_ram: 1;
        uint32_t bist_start_pause_cpu_ram: 1;
        uint32_t bist_start_pause_usb_ram: 1;
        uint32_t bist_start_pause_can_ram: 1;
        uint32_t bist_start_pause_cache_ram: 1;
        uint32_t bist_start_pause_amu_ram: 1;
        uint32_t RSVD: 26;
    };
} PLATFORM_REG_BIST_START_PAUSE_TYPE;

