rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_6050 PLATFORM_REG_BIST_START_PAUSE*/
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_data_ram_Pos                                          0U
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_data_ram_Msk                                          (0x1UL << PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_data_ram_Pos)

#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_cpu_ram_Pos                                           1U
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_cpu_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_cpu_ram_Pos)

#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_usb_ram_Pos                                           2U
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_usb_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_usb_ram_Pos)

#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_can_ram_Pos                                           3U
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_can_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_can_ram_Pos)

#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_cache_ram_Pos                                         4U
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_cache_ram_Msk                                         (0x1UL << PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_cache_ram_Pos)

#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_amu_ram_Pos                                           5U
#define PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_amu_ram_Msk                                           (0x1UL << PLATFORM_REG_BIST_START_PAUSE_bist_start_pause_amu_ram_Pos)

#define PLATFORM_REG_BIST_START_PAUSE_RSVD_Pos                                                               6U
#define PLATFORM_REG_BIST_START_PAUSE_RSVD_Msk                                                               (0x3FFFFFFUL << PLATFORM_REG_BIST_START_PAUSE_RSVD_Pos)

/* 0x0054   0x4000_6054
    0       R       bist_done_mcu_rom                                   0
    1       R       bist_done_data_ram                                  0
    2       R       bisr_done_data_ram                                  0
    3       R       bist_done_cpu_ram                                   0
    4       R       bist_done_usb_ram                                   0
    5       R       bist_done_can_ram                                   0
    6       R       bist_done_cache_ram                                 0
    7       R       bist_done_amu_ram                                   0
    31:8    R       RSVD                                                25'h0
 */
typedef union _PLATFORM_REG_BIST_DONE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_done_mcu_rom: 1;
        uint32_t bist_done_data_ram: 1;
        uint32_t bisr_done_data_ram: 1;
        uint32_t bist_done_cpu_ram: 1;
        uint32_t bist_done_usb_ram: 1;
        uint32_t bist_done_can_ram: 1;
        uint32_t bist_done_cache_ram: 1;
        uint32_t bist_done_amu_ram: 1;
        uint32_t RSVD: 24;
    };
} PLATFORM_REG_BIST_DONE_TYPE;

/*0x4000_6054 PLATFORM_REG_BIST_DONE*/
#define PLATFORM_REG_BIST_DONE_bist_done_mcu_rom_Pos                                                         0U
#define PLATFORM_REG_BIST_DONE_bist_done_mcu_rom_Msk                                                         (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_mcu_rom_Pos)

#define PLATFORM_REG_BIST_DONE_bist_done_data_ram_Pos                                                        1U
#define PLATFORM_REG_BIST_DONE_bist_done_data_ram_Msk                                                        (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_data_ram_Pos)

#define PLATFORM_REG_BIST_DONE_bisr_done_data_ram_Pos                                                        2U
#define PLATFORM_REG_BIST_DONE_bisr_done_data_ram_Msk                                                        (0x1UL << PLATFORM_REG_BIST_DONE_bisr_done_data_ram_Pos)

#define PLATFORM_REG_BIST_DONE_bist_done_cpu_ram_Pos                                                         3U
#define PLATFORM_REG_BIST_DONE_bist_done_cpu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_cpu_ram_Pos)

#define PLATFORM_REG_BIST_DONE_bist_done_usb_ram_Pos                                                         4U
#define PLATFORM_REG_BIST_DONE_bist_done_usb_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_usb_ram_Pos)

#define PLATFORM_REG_BIST_DONE_bist_done_can_ram_Pos                                                         5U
#define PLATFORM_REG_BIST_DONE_bist_done_can_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_can_ram_Pos)

#define PLATFORM_REG_BIST_DONE_bist_done_cache_ram_Pos                                                       6U
#define PLATFORM_REG_BIST_DONE_bist_done_cache_ram_Msk                                                       (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_cache_ram_Pos)

#define PLATFORM_REG_BIST_DONE_bist_done_amu_ram_Pos                                                         7U
#define PLATFORM_REG_BIST_DONE_bist_done_amu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_DONE_bist_done_amu_ram_Pos)

#define PLATFORM_REG_BIST_DONE_RSVD_Pos                                                                      8U
#define PLATFORM_REG_BIST_DONE_RSVD_Msk                                                                      (0xFFFFFFUL << PLATFORM_REG_BIST_DONE_RSVD_Pos)

/* 0x0058   0x4000_6058
    4:0     R       bist_fail_data_ram                                  5'h0
    5       R       bist_fail_cpu_ram                                   0
    6       R       bist_fail_usb_ram                                   0
    7       R       bist_fail_can_ram                                   0
    16:8    R       bist_fail_cache_ram                                 9'h0
    17      R       bist_fail_amu_ram                                   0
    31:18   R       RSVD                                                14'h0
 */
typedef union _PLATFORM_REG_BIST_FAIL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_fail_data_ram: 5;
        uint32_t bist_fail_cpu_ram: 1;
        uint32_t bist_fail_usb_ram: 1;
        uint32_t bist_fail_can_ram: 1;
        uint32_t bist_fail_cache_ram: 9;
        uint32_t bist_fail_amu_ram: 1;
        uint32_t RSVD: 14;
    };
} PLATFORM_REG_BIST_FAIL_TYPE;

/*0x4000_6058 PLATFORM_REG_BIST_FAIL*/
#define PLATFORM_REG_BIST_FAIL_bist_fail_data_ram_Pos                                                        0U
#define PLATFORM_REG_BIST_FAIL_bist_fail_data_ram_Msk                                                        (0x1FUL << PLATFORM_REG_BIST_FAIL_bist_fail_data_ram_Pos)

#define PLATFORM_REG_BIST_FAIL_bist_fail_cpu_ram_Pos                                                         5U
#define PLATFORM_REG_BIST_FAIL_bist_fail_cpu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_FAIL_bist_fail_cpu_ram_Pos)

#define PLATFORM_REG_BIST_FAIL_bist_fail_usb_ram_Pos                                                         6U
#define PLATFORM_REG_BIST_FAIL_bist_fail_usb_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_FAIL_bist_fail_usb_ram_Pos)

#define PLATFORM_REG_BIST_FAIL_bist_fail_can_ram_Pos                                                         7U
#define PLATFORM_REG_BIST_FAIL_bist_fail_can_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_FAIL_bist_fail_can_ram_Pos)

#define PLATFORM_REG_BIST_FAIL_bist_fail_cache_ram_Pos                                                       8U
#define PLATFORM_REG_BIST_FAIL_bist_fail_cache_ram_Msk                                                       (0x1FFUL << PLATFORM_REG_BIST_FAIL_bist_fail_cache_ram_Pos)

#define PLATFORM_REG_BIST_FAIL_bist_fail_amu_ram_Pos                                                         17U
#define PLATFORM_REG_BIST_FAIL_bist_fail_amu_ram_Msk                                                         (0x1UL << PLATFORM_REG_BIST_FAIL_bist_fail_amu_ram_Pos)

#define PLATFORM_REG_BIST_FAIL_RSVD_Pos                                                                      18U
#define PLATFORM_REG_BIST_FAIL_RSVD_Msk                                                                      (0x3FFFUL << PLATFORM_REG_BIST_FAIL_RSVD_Pos)

/* 0x005C   0x4000_605c
    0       R       bist_done_drf_data_ram                              0
    1       R       bist_done_drf_cpu_ram                               0
    2       R       bist_done_drf_usb_ram                               0
    3       R       bist_done_drf_can_ram                               0
    4       R       bist_done_drf_cache_ram                             0
    5       R       bist_done_drf_amu_ram                               0
    6       R       bisr_done_drf_data_ram                              0
    31:7    R       RSVD                                                26'h0
 */
typedef union _PLATFORM_REG_DRF_BIST_DONE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_done_drf_data_ram: 1;
        uint32_t bist_done_drf_cpu_ram: 1;
        uint32_t bist_done_drf_usb_ram: 1;
        uint32_t bist_done_drf_can_ram: 1;
        uint32_t bist_done_drf_cache_ram: 1;
        uint32_t bist_done_drf_amu_ram: 1;
        uint32_t bisr_done_drf_data_ram: 1;
        uint32_t RSVD: 25;
    };
} PLATFORM_REG_DRF_BIST_DONE_TYPE;

/*0x4000_605c PLATFORM_REG_DRF_BIST_DONE*/
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_data_ram_Pos                                                0U
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_data_ram_Msk                                                (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_data_ram_Pos)

#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_cpu_ram_Pos                                                 1U
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_cpu_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_cpu_ram_Pos)

#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_usb_ram_Pos                                                 2U
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_usb_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_usb_ram_Pos)

