rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_can_ram_Pos                                                 3U
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_can_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_can_ram_Pos)

#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_cache_ram_Pos                                               4U
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_cache_ram_Msk                                               (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_cache_ram_Pos)

#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_amu_ram_Pos                                                 5U
#define PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_amu_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bist_done_drf_amu_ram_Pos)

#define PLATFORM_REG_DRF_BIST_DONE_bisr_done_drf_data_ram_Pos                                                6U
#define PLATFORM_REG_DRF_BIST_DONE_bisr_done_drf_data_ram_Msk                                                (0x1UL << PLATFORM_REG_DRF_BIST_DONE_bisr_done_drf_data_ram_Pos)

#define PLATFORM_REG_DRF_BIST_DONE_RSVD_Pos                                                                  7U
#define PLATFORM_REG_DRF_BIST_DONE_RSVD_Msk                                                                  (0x1FFFFFFUL << PLATFORM_REG_DRF_BIST_DONE_RSVD_Pos)

/* 0x0060   0x4000_6060
    4:0     R       bist_fail_drf_data_ram                              5'h0
    5       R       bist_fail_drf_cpu_ram                               0
    6       R       bist_fail_drf_usb_ram                               0
    7       R       bist_fail_drf_can_ram                               0
    16:8    R       bist_fail_drf_cache_ram                             9'h0
    17      R       bist_fail_drf_amu_ram                               0
    31:18   R       RSVD                                                14'h0
 */
typedef union _PLATFORM_REG_DRF_BIST_FAIL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_fail_drf_data_ram: 5;
        uint32_t bist_fail_drf_cpu_ram: 1;
        uint32_t bist_fail_drf_usb_ram: 1;
        uint32_t bist_fail_drf_can_ram: 1;
        uint32_t bist_fail_drf_cache_ram: 9;
        uint32_t bist_fail_drf_amu_ram: 1;
        uint32_t RSVD: 14;
    };
} PLATFORM_REG_DRF_BIST_FAIL_TYPE;

/*0x4000_6060 PLATFORM_REG_DRF_BIST_FAIL*/
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_data_ram_Pos                                                0U
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_data_ram_Msk                                                (0x1FUL << PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_data_ram_Pos)

#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_cpu_ram_Pos                                                 5U
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_cpu_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_cpu_ram_Pos)

#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_usb_ram_Pos                                                 6U
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_usb_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_usb_ram_Pos)

#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_can_ram_Pos                                                 7U
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_can_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_can_ram_Pos)

#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_cache_ram_Pos                                               8U
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_cache_ram_Msk                                               (0x1FFUL << PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_cache_ram_Pos)

#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_amu_ram_Pos                                                 17U
#define PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_amu_ram_Msk                                                 (0x1UL << PLATFORM_REG_DRF_BIST_FAIL_bist_fail_drf_amu_ram_Pos)

#define PLATFORM_REG_DRF_BIST_FAIL_RSVD_Pos                                                                  18U
#define PLATFORM_REG_DRF_BIST_FAIL_RSVD_Msk                                                                  (0x3FFFUL << PLATFORM_REG_DRF_BIST_FAIL_RSVD_Pos)

/* 0x0064   0x4000_6064
    31:0    R       mcu_rom0_misr31_0                                   32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM0_MISR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t mcu_rom0_misr31_0;
    };
} PLATFORM_REG_MCU_ROM0_MISR0_TYPE;

/*0x4000_6064 PLATFORM_REG_MCU_ROM0_MISR0*/
#define PLATFORM_REG_MCU_ROM0_MISR0_mcu_rom0_misr31_0_Pos                                                    0U
#define PLATFORM_REG_MCU_ROM0_MISR0_mcu_rom0_misr31_0_Msk                                                    (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM0_MISR0_mcu_rom0_misr31_0_Pos)

/* 0x0068   0x4000_6068
    31:0    R       mcu_rom0_misr63_32                                  32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM0_MISR1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t mcu_rom0_misr63_32;
    };
} PLATFORM_REG_MCU_ROM0_MISR1_TYPE;

/*0x4000_6068 PLATFORM_REG_MCU_ROM0_MISR1*/
#define PLATFORM_REG_MCU_ROM0_MISR1_mcu_rom0_misr63_32_Pos                                                   0U
#define PLATFORM_REG_MCU_ROM0_MISR1_mcu_rom0_misr63_32_Msk                                                   (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM0_MISR1_mcu_rom0_misr63_32_Pos)

/* 0x006C   0x4000_606c
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM1_MISR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM1_MISR0_TYPE;

/*0x4000_606c PLATFORM_REG_MCU_ROM1_MISR0*/
#define PLATFORM_REG_MCU_ROM1_MISR0_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM1_MISR0_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM1_MISR0_RSVD_Pos)

