rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/* 0x0070   0x4000_6070
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM1_MISR1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM1_MISR1_TYPE;

/*0x4000_6070 PLATFORM_REG_MCU_ROM1_MISR1*/
#define PLATFORM_REG_MCU_ROM1_MISR1_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM1_MISR1_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM1_MISR1_RSVD_Pos)

/* 0x0074   0x4000_6074
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM2_MISR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM2_MISR0_TYPE;

/*0x4000_6074 PLATFORM_REG_MCU_ROM2_MISR0*/
#define PLATFORM_REG_MCU_ROM2_MISR0_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM2_MISR0_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM2_MISR0_RSVD_Pos)

/* 0x0078   0x4000_6078
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM2_MISR1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM2_MISR1_TYPE;

/*0x4000_6078 PLATFORM_REG_MCU_ROM2_MISR1*/
#define PLATFORM_REG_MCU_ROM2_MISR1_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM2_MISR1_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM2_MISR1_RSVD_Pos)

/* 0x007C   0x4000_607c
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM3_MISR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM3_MISR0_TYPE;

/*0x4000_607c PLATFORM_REG_MCU_ROM3_MISR0*/
#define PLATFORM_REG_MCU_ROM3_MISR0_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM3_MISR0_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM3_MISR0_RSVD_Pos)

/* 0x0080   0x4000_6080
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM3_MISR1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM3_MISR1_TYPE;

/*0x4000_6080 PLATFORM_REG_MCU_ROM3_MISR1*/
#define PLATFORM_REG_MCU_ROM3_MISR1_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM3_MISR1_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM3_MISR1_RSVD_Pos)

/* 0x0084   0x4000_6084
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM4_MISR0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM4_MISR0_TYPE;

/*0x4000_6084 PLATFORM_REG_MCU_ROM4_MISR0*/
#define PLATFORM_REG_MCU_ROM4_MISR0_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM4_MISR0_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM4_MISR0_RSVD_Pos)

/* 0x0088   0x4000_6088
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_REG_MCU_ROM4_MISR1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_REG_MCU_ROM4_MISR1_TYPE;

/*0x4000_6088 PLATFORM_REG_MCU_ROM4_MISR1*/
#define PLATFORM_REG_MCU_ROM4_MISR1_RSVD_Pos                                                                 0U
#define PLATFORM_REG_MCU_ROM4_MISR1_RSVD_Msk                                                                 (0xFFFFFFFFUL << PLATFORM_REG_MCU_ROM4_MISR1_RSVD_Pos)

/* 0x0090   0x4000_6090
    31:0    R/W     OUT_DATA0                                           32'h0
 */
typedef union _PLATFORM_REG_I2C_MAILBOX_OUT_DATA0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OUT_DATA0;
    };
} PLATFORM_REG_I2C_MAILBOX_OUT_DATA0_TYPE;

/*0x4000_6090 PLATFORM_REG_I2C_MAILBOX_OUT_DATA0*/
#define PLATFORM_REG_I2C_MAILBOX_OUT_DATA0_OUT_DATA0_Pos                                                     0U
#define PLATFORM_REG_I2C_MAILBOX_OUT_DATA0_OUT_DATA0_Msk                                                     (0xFFFFFFFFUL << PLATFORM_REG_I2C_MAILBOX_OUT_DATA0_OUT_DATA0_Pos)

/* 0x0094   0x4000_6094
    31:0    R/W     OUT_DATA1                                           32'h0
 */
typedef union _PLATFORM_REG_I2C_MAILBOX_OUT_DATA1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t OUT_DATA1;
    };
} PLATFORM_REG_I2C_MAILBOX_OUT_DATA1_TYPE;

/*0x4000_6094 PLATFORM_REG_I2C_MAILBOX_OUT_DATA1*/
#define PLATFORM_REG_I2C_MAILBOX_OUT_DATA1_OUT_DATA1_Pos                                                     0U
#define PLATFORM_REG_I2C_MAILBOX_OUT_DATA1_OUT_DATA1_Msk                                                     (0xFFFFFFFFUL << PLATFORM_REG_I2C_MAILBOX_OUT_DATA1_OUT_DATA1_Pos)

/* 0x0098   0x4000_6098
    31:0    R       IN_DATA0                                            32'h0
 */
typedef union _PLATFORM_REG_I2C_MAILBOX_IN_DATA0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t IN_DATA0;
    };
} PLATFORM_REG_I2C_MAILBOX_IN_DATA0_TYPE;

/*0x4000_6098 PLATFORM_REG_I2C_MAILBOX_IN_DATA0*/
#define PLATFORM_REG_I2C_MAILBOX_IN_DATA0_IN_DATA0_Pos                                                       0U
#define PLATFORM_REG_I2C_MAILBOX_IN_DATA0_IN_DATA0_Msk                                                       (0xFFFFFFFFUL << PLATFORM_REG_I2C_MAILBOX_IN_DATA0_IN_DATA0_Pos)

/* 0x009C   0x4000_609c
    31:0    R       IN_DATA1                                            32'h0
 */
typedef union _PLATFORM_REG_I2C_MAILBOX_IN_DATA1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t IN_DATA1;
    };
} PLATFORM_REG_I2C_MAILBOX_IN_DATA1_TYPE;

/*0x4000_609c PLATFORM_REG_I2C_MAILBOX_IN_DATA1*/
#define PLATFORM_REG_I2C_MAILBOX_IN_DATA1_IN_DATA1_Pos                                                       0U
#define PLATFORM_REG_I2C_MAILBOX_IN_DATA1_IN_DATA1_Msk                                                       (0xFFFFFFFFUL << PLATFORM_REG_I2C_MAILBOX_IN_DATA1_IN_DATA1_Pos)

/* 0x00A0   0x4000_60a0
    0       R/W1C   outbox_rdy_r                                        0
    1       R/W     out_empty_inten                                     0
    2       R/W     out_int_mode                                        0
    3       R/W1C   out_edge_sts                                        0
    4       R       rx_data_crc_ok                                      0
    15:5    R       RSVD_1                                              11'h0
    16      R/W1C   inbox_rdy_r                                         0
    17      R/W     in_rdy_inten                                        0
    30:18   R       RSVD                                                13'h0
    31      R/W     pta_i2c_en                                          0
 */
typedef union _PLATFORM_REG_I2C_MAILBOX_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t outbox_rdy_r: 1;
        uint32_t out_empty_inten: 1;
        uint32_t out_int_mode: 1;
        uint32_t out_edge_sts: 1;
        uint32_t rx_data_crc_ok: 1;
        uint32_t RSVD_1: 11;
        uint32_t inbox_rdy_r: 1;
        uint32_t in_rdy_inten: 1;
        uint32_t RSVD: 13;
        uint32_t pta_i2c_en: 1;
    };
} PLATFORM_REG_I2C_MAILBOX_CTRL_TYPE;

