rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_60a0 PLATFORM_REG_I2C_MAILBOX_CTRL*/
#define PLATFORM_REG_I2C_MAILBOX_CTRL_outbox_rdy_r_Pos                                                       0U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_outbox_rdy_r_Msk                                                       (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_outbox_rdy_r_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_out_empty_inten_Pos                                                    1U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_out_empty_inten_Msk                                                    (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_out_empty_inten_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_out_int_mode_Pos                                                       2U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_out_int_mode_Msk                                                       (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_out_int_mode_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_out_edge_sts_Pos                                                       3U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_out_edge_sts_Msk                                                       (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_out_edge_sts_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_rx_data_crc_ok_Pos                                                     4U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_rx_data_crc_ok_Msk                                                     (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_rx_data_crc_ok_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_RSVD_1_Pos                                                             5U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_RSVD_1_Msk                                                             (0x7FFUL << PLATFORM_REG_I2C_MAILBOX_CTRL_RSVD_1_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_inbox_rdy_r_Pos                                                        16U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_inbox_rdy_r_Msk                                                        (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_inbox_rdy_r_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_in_rdy_inten_Pos                                                       17U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_in_rdy_inten_Msk                                                       (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_in_rdy_inten_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_RSVD_Pos                                                               18U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_RSVD_Msk                                                               (0x1FFFUL << PLATFORM_REG_I2C_MAILBOX_CTRL_RSVD_Pos)

#define PLATFORM_REG_I2C_MAILBOX_CTRL_pta_i2c_en_Pos                                                         31U
#define PLATFORM_REG_I2C_MAILBOX_CTRL_pta_i2c_en_Msk                                                         (0x1UL << PLATFORM_REG_I2C_MAILBOX_CTRL_pta_i2c_en_Pos)

/* 0x00A4   0x4000_60a4
    0       R/W     CM33_WICEN_REQ                                      1'b0
    1       R       CM33_WICEN_ACK                                      1'b0
    31:2    R       RSVD                                                30'h0
 */
typedef union _PLATFORM_WIC_HANDSHAKE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t CM33_WICEN_REQ: 1;
        uint32_t CM33_WICEN_ACK: 1;
        uint32_t RSVD: 30;
    };
} PLATFORM_WIC_HANDSHAKE_TYPE;

/*0x4000_60a4 PLATFORM_WIC_HANDSHAKE*/
#define PLATFORM_WIC_HANDSHAKE_CM33_WICEN_REQ_Pos                                                            0U
#define PLATFORM_WIC_HANDSHAKE_CM33_WICEN_REQ_Msk                                                            (0x1UL << PLATFORM_WIC_HANDSHAKE_CM33_WICEN_REQ_Pos)

#define PLATFORM_WIC_HANDSHAKE_CM33_WICEN_ACK_Pos                                                            1U
#define PLATFORM_WIC_HANDSHAKE_CM33_WICEN_ACK_Msk                                                            (0x1UL << PLATFORM_WIC_HANDSHAKE_CM33_WICEN_ACK_Pos)

#define PLATFORM_WIC_HANDSHAKE_RSVD_Pos                                                                      2U
#define PLATFORM_WIC_HANDSHAKE_RSVD_Msk                                                                      (0x3FFFFFFFUL << PLATFORM_WIC_HANDSHAKE_RSVD_Pos)

/* 0x00A8   0x4000_60a8
    3:0     R/W1C   WKUP_REASON_W1C                                     4'd0
    15:4    R       RSVD_1                                              12'd0
    19:16   R       RO_WKUP_REASON                                      4'd0
    31:20   R       RSVD                                                12'd0
 */
typedef union _PLATFORM_WKUP_REASON_CORE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WKUP_REASON_W1C: 4;
        uint32_t RSVD_1: 12;
        uint32_t RO_WKUP_REASON: 4;
        uint32_t RSVD: 12;
    };
} PLATFORM_WKUP_REASON_CORE_TYPE;

/*0x4000_60a8 PLATFORM_WKUP_REASON_CORE*/
#define PLATFORM_WKUP_REASON_CORE_WKUP_REASON_W1C_Pos                                                        0U
#define PLATFORM_WKUP_REASON_CORE_WKUP_REASON_W1C_Msk                                                        (0xFUL << PLATFORM_WKUP_REASON_CORE_WKUP_REASON_W1C_Pos)

#define PLATFORM_WKUP_REASON_CORE_RSVD_1_Pos                                                                 4U
#define PLATFORM_WKUP_REASON_CORE_RSVD_1_Msk                                                                 (0xFFFUL << PLATFORM_WKUP_REASON_CORE_RSVD_1_Pos)

#define PLATFORM_WKUP_REASON_CORE_RO_WKUP_REASON_Pos                                                         16U
#define PLATFORM_WKUP_REASON_CORE_RO_WKUP_REASON_Msk                                                         (0xFUL << PLATFORM_WKUP_REASON_CORE_RO_WKUP_REASON_Pos)

#define PLATFORM_WKUP_REASON_CORE_RSVD_Pos                                                                   20U
#define PLATFORM_WKUP_REASON_CORE_RSVD_Msk                                                                   (0xFFFUL << PLATFORM_WKUP_REASON_CORE_RSVD_Pos)

/* 0x00AC   0x4000_60ac
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_TYPE;

/*0x4000_60ac PLATFORM_Reserved*/
#define PLATFORM_Reserved_RSVD_Pos                                                                           0U
#define PLATFORM_Reserved_RSVD_Msk                                                                           (0xFFFFFFFFUL << PLATFORM_Reserved_RSVD_Pos)

/* 0x00B0   0x4000_60b0
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_1_TYPE;

