rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_60b0 PLATFORM_Reserved_1*/
#define PLATFORM_Reserved_1_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_1_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_1_RSVD_Pos)

/* 0x00B4   0x4000_60b4
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_2_TYPE;

/*0x4000_60b4 PLATFORM_Reserved_2*/
#define PLATFORM_Reserved_2_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_2_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_2_RSVD_Pos)

/* 0x00B8   0x4000_60b8
    1:0     R/W     RSVD_3                                              2'h0
    4:2     R       RSVD_2                                              3'h0
    7:5     R/W     RSVD_1                                              3'h0
    31:8    R       RSVD                                                24'h0
 */
typedef union _PLATFORM_REG_SNPS_SRAM_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD_3: 2;
        uint32_t RSVD_2: 3;
        uint32_t RSVD_1: 3;
        uint32_t RSVD: 24;
    };
} PLATFORM_REG_SNPS_SRAM_CTRL_TYPE;

/*0x4000_60b8 PLATFORM_REG_SNPS_SRAM_CTRL*/
#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_3_Pos                                                               0U
#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_3_Msk                                                               (0x3UL << PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_3_Pos)

#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_2_Pos                                                               2U
#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_2_Msk                                                               (0x7UL << PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_2_Pos)

#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_1_Pos                                                               5U
#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_1_Msk                                                               (0x7UL << PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_1_Pos)

#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_Pos                                                                 8U
#define PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_Msk                                                                 (0xFFFFFFUL << PLATFORM_REG_SNPS_SRAM_CTRL_RSVD_Pos)

/* 0x00BC   0x4000_60bc
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_3_TYPE;

/*0x4000_60bc PLATFORM_Reserved_3*/
#define PLATFORM_Reserved_3_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_3_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_3_RSVD_Pos)

/* 0x00C0   0x4000_60c0
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_4_TYPE;

/*0x4000_60c0 PLATFORM_Reserved_4*/
#define PLATFORM_Reserved_4_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_4_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_4_RSVD_Pos)

/* 0x00C4   0x4000_60c4
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_5_TYPE;

/*0x4000_60c4 PLATFORM_Reserved_5*/
#define PLATFORM_Reserved_5_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_5_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_5_RSVD_Pos)

/* 0x00C8   0x4000_60c8
    0       R/W     bisr_remap_rstn_data_ram                            1'b0
    1       R/W     bisr_load_fuse_data_ram                             1'b0
    19:2    R/W     bisr_remap_sig_data_ram                             18'h0
    20      R/W     bisr_second_run_data_ram                            1'b0
    21      R/W     bisr_hold_remap_data_ram                            1'b0
    22      R/W     bisr_pwr_rstn_data_ram                              1'b1
    31:23   R       RSVD                                                9'h0
 */
typedef union _PLATFORM_REG_MBISR_DATA_SRAM_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bisr_remap_rstn_data_ram: 1;
        uint32_t bisr_load_fuse_data_ram: 1;
        uint32_t bisr_remap_sig_data_ram: 18;
        uint32_t bisr_second_run_data_ram: 1;
        uint32_t bisr_hold_remap_data_ram: 1;
        uint32_t bisr_pwr_rstn_data_ram: 1;
        uint32_t RSVD: 9;
    };
} PLATFORM_REG_MBISR_DATA_SRAM_CTRL_TYPE;

/*0x4000_60c8 PLATFORM_REG_MBISR_DATA_SRAM_CTRL*/
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_remap_rstn_data_ram_Pos                                       0U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_remap_rstn_data_ram_Msk                                       (0x1UL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_remap_rstn_data_ram_Pos)

#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_load_fuse_data_ram_Pos                                        1U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_load_fuse_data_ram_Msk                                        (0x1UL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_load_fuse_data_ram_Pos)

#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_remap_sig_data_ram_Pos                                        2U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_remap_sig_data_ram_Msk                                        (0x3FFFFUL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_remap_sig_data_ram_Pos)

