rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_second_run_data_ram_Pos                                       20U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_second_run_data_ram_Msk                                       (0x1UL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_second_run_data_ram_Pos)

#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_hold_remap_data_ram_Pos                                       21U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_hold_remap_data_ram_Msk                                       (0x1UL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_hold_remap_data_ram_Pos)

#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_pwr_rstn_data_ram_Pos                                         22U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_pwr_rstn_data_ram_Msk                                         (0x1UL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_bisr_pwr_rstn_data_ram_Pos)

#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_RSVD_Pos                                                           23U
#define PLATFORM_REG_MBISR_DATA_SRAM_CTRL_RSVD_Msk                                                           (0x1FFUL << PLATFORM_REG_MBISR_DATA_SRAM_CTRL_RSVD_Pos)

/* 0x00CC   0x4000_60cc
    0       R/W     bisr_remap_rstn_buffer_ram                          1'b0
    1       R/W     bisr_load_fuse_buffer_ram                           1'b0
    8:2     R/W     bisr_remap_sig_buffer_ram                           7'h0
    9       R/W     bisr_second_run_buffer_ram                          1'b0
    10      R/W     bisr_hold_remap_buffer_ram                          1'b0
    11      R/W     bisr_pwr_rstn_buffer_ram                            1'b1
    31:12   R       RSVD                                                20'h0
 */
typedef union _PLATFORM_REG_MBISR_BUF_SRAM_CTRL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bisr_remap_rstn_buffer_ram: 1;
        uint32_t bisr_load_fuse_buffer_ram: 1;
        uint32_t bisr_remap_sig_buffer_ram: 7;
        uint32_t bisr_second_run_buffer_ram: 1;
        uint32_t bisr_hold_remap_buffer_ram: 1;
        uint32_t bisr_pwr_rstn_buffer_ram: 1;
        uint32_t RSVD: 20;
    };
} PLATFORM_REG_MBISR_BUF_SRAM_CTRL_TYPE;

/*0x4000_60cc PLATFORM_REG_MBISR_BUF_SRAM_CTRL*/
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_remap_rstn_buffer_ram_Pos                                      0U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_remap_rstn_buffer_ram_Msk                                      (0x1UL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_remap_rstn_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_load_fuse_buffer_ram_Pos                                       1U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_load_fuse_buffer_ram_Msk                                       (0x1UL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_load_fuse_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_remap_sig_buffer_ram_Pos                                       2U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_remap_sig_buffer_ram_Msk                                       (0x7FUL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_remap_sig_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_second_run_buffer_ram_Pos                                      9U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_second_run_buffer_ram_Msk                                      (0x1UL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_second_run_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_hold_remap_buffer_ram_Pos                                      10U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_hold_remap_buffer_ram_Msk                                      (0x1UL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_hold_remap_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_pwr_rstn_buffer_ram_Pos                                        11U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_pwr_rstn_buffer_ram_Msk                                        (0x1UL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_bisr_pwr_rstn_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_RSVD_Pos                                                            12U
#define PLATFORM_REG_MBISR_BUF_SRAM_CTRL_RSVD_Msk                                                            (0xFFFFFUL << PLATFORM_REG_MBISR_BUF_SRAM_CTRL_RSVD_Pos)

/* 0x00D0   0x4000_60d0
    6:0     R       bisr_out_buffer_ram                                 7'h0
    7       R       bisr_repaired_buffer_ram                            0
    9:8     R       RSVD_1                                              2'h0
    27:10   R       bisr_out_data_ram                                   18'h0
    28      R       bisr_repaired_data_ram                              0
    31:29   R       RSVD                                                3'h0
 */
typedef union _PLATFORM_REG_MBISR_SRAM_RESULT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bisr_out_buffer_ram: 7;
        uint32_t bisr_repaired_buffer_ram: 1;
        uint32_t RSVD_1: 2;
        uint32_t bisr_out_data_ram: 18;
        uint32_t bisr_repaired_data_ram: 1;
        uint32_t RSVD: 3;
    };
} PLATFORM_REG_MBISR_SRAM_RESULT_TYPE;

/*0x4000_60d0 PLATFORM_REG_MBISR_SRAM_RESULT*/
#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_out_buffer_ram_Pos                                               0U
#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_out_buffer_ram_Msk                                               (0x7FUL << PLATFORM_REG_MBISR_SRAM_RESULT_bisr_out_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_repaired_buffer_ram_Pos                                          7U
#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_repaired_buffer_ram_Msk                                          (0x1UL << PLATFORM_REG_MBISR_SRAM_RESULT_bisr_repaired_buffer_ram_Pos)

#define PLATFORM_REG_MBISR_SRAM_RESULT_RSVD_1_Pos                                                            8U
#define PLATFORM_REG_MBISR_SRAM_RESULT_RSVD_1_Msk                                                            (0x3UL << PLATFORM_REG_MBISR_SRAM_RESULT_RSVD_1_Pos)

