rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_out_data_ram_Pos                                                 10U
#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_out_data_ram_Msk                                                 (0x3FFFFUL << PLATFORM_REG_MBISR_SRAM_RESULT_bisr_out_data_ram_Pos)

#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_repaired_data_ram_Pos                                            28U
#define PLATFORM_REG_MBISR_SRAM_RESULT_bisr_repaired_data_ram_Msk                                            (0x1UL << PLATFORM_REG_MBISR_SRAM_RESULT_bisr_repaired_data_ram_Pos)

#define PLATFORM_REG_MBISR_SRAM_RESULT_RSVD_Pos                                                              29U
#define PLATFORM_REG_MBISR_SRAM_RESULT_RSVD_Msk                                                              (0x7UL << PLATFORM_REG_MBISR_SRAM_RESULT_RSVD_Pos)

/* 0x00D4   0x4000_60d4
    0       R/W     bist_dyn_read_en_data_ram                           0
    1       R/W     bist_dyn_read_en_cpu_ram                            0
    2       R/W     bist_dyn_read_en_usb_ram                            0
    3       R/W     bist_dyn_read_en_can_ram                            0
    4       R/W     bist_dyn_read_en_leslv_ram                          0
    5       R/W     bist_dyn_read_en_lecis_ram                          0
    6       R/W     bist_dyn_read_en_lebis_ram                          0
    7       R/W     bist_dyn_read_en_buffer_ram                         0
    8       R/W     bist_dyn_read_en_audio_ram                          0
    9       R/W     bist_dyn_read_en_btphy_ram                          0
    10      R/W     bist_dyn_read_en_ccmp_ram                           0
    11      R/W     bist_dyn_read_en_btrx_ram                           0
    12      R/W     bist_dyn_read_en_bttx_ram                           0
    13      R/W     bist_dyn_read_en_lepa_ram                           0
    14      R/W     bist_dyn_read_en_lemst_ram                          0
    15      R/W     bist_dyn_read_en_cache_ram                          0
    16      R/W     bist_dyn_read_en_amu_ram                            0
    31:17   R       RSVD                                                15'h0
 */
typedef union _PLATFORM_REG_DYN_READ_EN_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_dyn_read_en_data_ram: 1;
        uint32_t bist_dyn_read_en_cpu_ram: 1;
        uint32_t bist_dyn_read_en_usb_ram: 1;
        uint32_t bist_dyn_read_en_can_ram: 1;
        uint32_t bist_dyn_read_en_leslv_ram: 1;
        uint32_t bist_dyn_read_en_lecis_ram: 1;
        uint32_t bist_dyn_read_en_lebis_ram: 1;
        uint32_t bist_dyn_read_en_buffer_ram: 1;
        uint32_t bist_dyn_read_en_audio_ram: 1;
        uint32_t bist_dyn_read_en_btphy_ram: 1;
        uint32_t bist_dyn_read_en_ccmp_ram: 1;
        uint32_t bist_dyn_read_en_btrx_ram: 1;
        uint32_t bist_dyn_read_en_bttx_ram: 1;
        uint32_t bist_dyn_read_en_lepa_ram: 1;
        uint32_t bist_dyn_read_en_lemst_ram: 1;
        uint32_t bist_dyn_read_en_cache_ram: 1;
        uint32_t bist_dyn_read_en_amu_ram: 1;
        uint32_t RSVD: 15;
    };
} PLATFORM_REG_DYN_READ_EN_TYPE;

/*0x4000_60d4 PLATFORM_REG_DYN_READ_EN*/
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_data_ram_Pos                                               0U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_data_ram_Msk                                               (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_data_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_cpu_ram_Pos                                                1U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_cpu_ram_Msk                                                (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_cpu_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_usb_ram_Pos                                                2U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_usb_ram_Msk                                                (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_usb_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_can_ram_Pos                                                3U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_can_ram_Msk                                                (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_can_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_leslv_ram_Pos                                              4U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_leslv_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_leslv_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lecis_ram_Pos                                              5U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lecis_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lecis_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lebis_ram_Pos                                              6U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lebis_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lebis_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_buffer_ram_Pos                                             7U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_buffer_ram_Msk                                             (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_buffer_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_audio_ram_Pos                                              8U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_audio_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_audio_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_btphy_ram_Pos                                              9U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_btphy_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_btphy_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_ccmp_ram_Pos                                               10U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_ccmp_ram_Msk                                               (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_ccmp_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_btrx_ram_Pos                                               11U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_btrx_ram_Msk                                               (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_btrx_ram_Pos)

