rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_bttx_ram_Pos                                               12U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_bttx_ram_Msk                                               (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_bttx_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lepa_ram_Pos                                               13U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lepa_ram_Msk                                               (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lepa_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lemst_ram_Pos                                              14U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lemst_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_lemst_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_cache_ram_Pos                                              15U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_cache_ram_Msk                                              (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_cache_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_amu_ram_Pos                                                16U
#define PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_amu_ram_Msk                                                (0x1UL << PLATFORM_REG_DYN_READ_EN_bist_dyn_read_en_amu_ram_Pos)

#define PLATFORM_REG_DYN_READ_EN_RSVD_Pos                                                                    17U
#define PLATFORM_REG_DYN_READ_EN_RSVD_Msk                                                                    (0x7FFFUL << PLATFORM_REG_DYN_READ_EN_RSVD_Pos)

/* 0x00D8   0x4000_60d8
    0       R/W     bist_loop_mode_data_ram                             0
    1       R/W     bist_loop_mode_cpu_ram                              0
    2       R/W     bist_loop_mode_usb_ram                              0
    3       R/W     bist_loop_mode_can_ram                              0
    4       R/W     bist_loop_mode_cache_ram                            0
    5       R/W     bist_loop_mode_amu_ram                              0
    31:6    R       RSVD                                                26'h0
 */
typedef union _PLATFORM_REG_BIST_LOOP_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_loop_mode_data_ram: 1;
        uint32_t bist_loop_mode_cpu_ram: 1;
        uint32_t bist_loop_mode_usb_ram: 1;
        uint32_t bist_loop_mode_can_ram: 1;
        uint32_t bist_loop_mode_cache_ram: 1;
        uint32_t bist_loop_mode_amu_ram: 1;
        uint32_t RSVD: 26;
    };
} PLATFORM_REG_BIST_LOOP_MODE_TYPE;

/*0x4000_60d8 PLATFORM_REG_BIST_LOOP_MODE*/
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_data_ram_Pos                                              0U
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_data_ram_Msk                                              (0x1UL << PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_data_ram_Pos)

#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_cpu_ram_Pos                                               1U
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_cpu_ram_Msk                                               (0x1UL << PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_cpu_ram_Pos)

#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_usb_ram_Pos                                               2U
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_usb_ram_Msk                                               (0x1UL << PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_usb_ram_Pos)

#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_can_ram_Pos                                               3U
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_can_ram_Msk                                               (0x1UL << PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_can_ram_Pos)

#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_cache_ram_Pos                                             4U
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_cache_ram_Msk                                             (0x1UL << PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_cache_ram_Pos)

#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_amu_ram_Pos                                               5U
#define PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_amu_ram_Msk                                               (0x1UL << PLATFORM_REG_BIST_LOOP_MODE_bist_loop_mode_amu_ram_Pos)

#define PLATFORM_REG_BIST_LOOP_MODE_RSVD_Pos                                                                 6U
#define PLATFORM_REG_BIST_LOOP_MODE_RSVD_Msk                                                                 (0x3FFFFFFUL << PLATFORM_REG_BIST_LOOP_MODE_RSVD_Pos)

/* 0x00DC   0x4000_60dc
    0       R/W     bist_loop_mode_leslv_ram                            0
    1       R/W     bist_loop_mode_lecis_ram                            0
    2       R/W     bist_loop_mode_lebis_ram                            0
    3       R/W     bist_loop_mode_buffer_ram                           0
    4       R/W     bist_loop_mode_audio_ram                            0
    5       R/W     bist_loop_mode_btphy_ram                            0
    6       R/W     bist_loop_mode_ccmp_ram                             0
    7       R/W     bist_loop_mode_btrx_ram                             0
    8       R/W     bist_loop_mode_bttx_ram                             0
    9       R/W     bist_loop_mode_lepa_ram                             0
    10      R/W     bist_loop_mode_lemst_ram                            0
    11      R       RSVD_2                                              0
    12      R/W     RSVD_1                                              0
    31:13   R       RSVD                                                19'h0
 */
typedef union _PLATFORM_REG_BT_BIST_LOOP_MODE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_loop_mode_leslv_ram: 1;
        uint32_t bist_loop_mode_lecis_ram: 1;
        uint32_t bist_loop_mode_lebis_ram: 1;
        uint32_t bist_loop_mode_buffer_ram: 1;
        uint32_t bist_loop_mode_audio_ram: 1;
        uint32_t bist_loop_mode_btphy_ram: 1;
        uint32_t bist_loop_mode_ccmp_ram: 1;
        uint32_t bist_loop_mode_btrx_ram: 1;
        uint32_t bist_loop_mode_bttx_ram: 1;
        uint32_t bist_loop_mode_lepa_ram: 1;
        uint32_t bist_loop_mode_lemst_ram: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 19;
    };
} PLATFORM_REG_BT_BIST_LOOP_MODE_TYPE;

/*0x4000_60dc PLATFORM_REG_BT_BIST_LOOP_MODE*/
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_leslv_ram_Pos                                          0U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_leslv_ram_Msk                                          (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_leslv_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lecis_ram_Pos                                          1U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lecis_ram_Msk                                          (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lecis_ram_Pos)

