rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lebis_ram_Pos                                          2U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lebis_ram_Msk                                          (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lebis_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_buffer_ram_Pos                                         3U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_buffer_ram_Msk                                         (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_buffer_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_audio_ram_Pos                                          4U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_audio_ram_Msk                                          (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_audio_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_btphy_ram_Pos                                          5U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_btphy_ram_Msk                                          (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_btphy_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_ccmp_ram_Pos                                           6U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_ccmp_ram_Msk                                           (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_ccmp_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_btrx_ram_Pos                                           7U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_btrx_ram_Msk                                           (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_btrx_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_bttx_ram_Pos                                           8U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_bttx_ram_Msk                                           (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_bttx_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lepa_ram_Pos                                           9U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lepa_ram_Msk                                           (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lepa_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lemst_ram_Pos                                          10U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lemst_ram_Msk                                          (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_bist_loop_mode_lemst_ram_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_2_Pos                                                            11U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_2_Msk                                                            (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_2_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_1_Pos                                                            12U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_1_Msk                                                            (0x1UL << PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_1_Pos)

#define PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_Pos                                                              13U
#define PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_Msk                                                              (0x7FFFFUL << PLATFORM_REG_BT_BIST_LOOP_MODE_RSVD_Pos)

/* 0x00E0   0x4000_60e0
    0       R/W     bist_rstn_leslv_ram                                 0
    1       R/W     bist_rstn_lecis_ram                                 0
    2       R/W     bist_rstn_lebis_ram                                 0
    3       R/W     bist_rstn_buffer_ram                                0
    4       R/W     bist_rstn_audio_ram                                 0
    5       R/W     bist_rstn_btphy_ram                                 0
    6       R/W     bist_rstn_ccmp_ram                                  0
    7       R/W     bist_rstn_btrx_ram                                  0
    8       R/W     bist_rstn_bttx_ram                                  0
    9       R/W     bist_rstn_lepa_ram                                  0
    10      R/W     bist_rstn_lemst_ram                                 0
    11      R       RSVD_2                                              0
    12      R/W     RSVD_1                                              0
    31:13   R       RSVD                                                19'h0
 */
typedef union _PLATFORM_REG_BT_BIST_RSTN_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_rstn_leslv_ram: 1;
        uint32_t bist_rstn_lecis_ram: 1;
        uint32_t bist_rstn_lebis_ram: 1;
        uint32_t bist_rstn_buffer_ram: 1;
        uint32_t bist_rstn_audio_ram: 1;
        uint32_t bist_rstn_btphy_ram: 1;
        uint32_t bist_rstn_ccmp_ram: 1;
        uint32_t bist_rstn_btrx_ram: 1;
        uint32_t bist_rstn_bttx_ram: 1;
        uint32_t bist_rstn_lepa_ram: 1;
        uint32_t bist_rstn_lemst_ram: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 19;
    };
} PLATFORM_REG_BT_BIST_RSTN_TYPE;

/*0x4000_60e0 PLATFORM_REG_BT_BIST_RSTN*/
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_leslv_ram_Pos                                                    0U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_leslv_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_leslv_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_lecis_ram_Pos                                                    1U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_lecis_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_lecis_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_lebis_ram_Pos                                                    2U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_lebis_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_lebis_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_buffer_ram_Pos                                                   3U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_buffer_ram_Msk                                                   (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_buffer_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_audio_ram_Pos                                                    4U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_audio_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_audio_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_btphy_ram_Pos                                                    5U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_btphy_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_btphy_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_ccmp_ram_Pos                                                     6U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_ccmp_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_ccmp_ram_Pos)

#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_btrx_ram_Pos                                                     7U
#define PLATFORM_REG_BT_BIST_RSTN_bist_rstn_btrx_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_RSTN_bist_rstn_btrx_ram_Pos)

