rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_60e8 PLATFORM_REG_BT_DRF_BIST_MODE*/
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_leslv_ram_Pos                                            0U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_leslv_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_leslv_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lecis_ram_Pos                                            1U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lecis_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lecis_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lebis_ram_Pos                                            2U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lebis_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lebis_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_buffer_ram_Pos                                           3U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_buffer_ram_Msk                                           (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_buffer_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_audio_ram_Pos                                            4U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_audio_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_audio_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_btphy_ram_Pos                                            5U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_btphy_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_btphy_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_ccmp_ram_Pos                                             6U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_ccmp_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_ccmp_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_btrx_ram_Pos                                             7U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_btrx_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_btrx_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_bttx_ram_Pos                                             8U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_bttx_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_bttx_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lepa_ram_Pos                                             9U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lepa_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lepa_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lemst_ram_Pos                                            10U
#define PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lemst_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_bist_mode_drf_lemst_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_2_Pos                                                             11U
#define PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_2_Msk                                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_2_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_1_Pos                                                             12U
#define PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_1_Msk                                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_1_Pos)

#define PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_Pos                                                               13U
#define PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_Msk                                                               (0x7FFFFUL << PLATFORM_REG_BT_DRF_BIST_MODE_RSVD_Pos)

/* 0x00EC   0x4000_60ec
    0       R/W     bist_test_resume_leslv_ram                          0
    1       R/W     bist_test_resume_lecis_ram                          0
    2       R/W     bist_test_resume_lebis_ram                          0
    3       R/W     bist_test_resume_buffer_ram                         0
    4       R/W     bist_test_resume_audio_ram                          0
    5       R/W     bist_test_resume_btphy_ram                          0
    6       R/W     bist_test_resume_ccmp_ram                           0
    7       R/W     bist_test_resume_btrx_ram                           0
    8       R/W     bist_test_resume_bttx_ram                           0
    9       R/W     bist_test_resume_lepa_ram                           0
    10      R/W     bist_test_resume_lemst_ram                          0
    11      R       RSVD_2                                              0
    12      R/W     RSVD_1                                              0
    31:13   R       RSVD                                                19'h0
 */
typedef union _PLATFORM_REG_BT_BIST_TEST_RESUME_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_test_resume_leslv_ram: 1;
        uint32_t bist_test_resume_lecis_ram: 1;
        uint32_t bist_test_resume_lebis_ram: 1;
        uint32_t bist_test_resume_buffer_ram: 1;
        uint32_t bist_test_resume_audio_ram: 1;
        uint32_t bist_test_resume_btphy_ram: 1;
        uint32_t bist_test_resume_ccmp_ram: 1;
        uint32_t bist_test_resume_btrx_ram: 1;
        uint32_t bist_test_resume_bttx_ram: 1;
        uint32_t bist_test_resume_lepa_ram: 1;
        uint32_t bist_test_resume_lemst_ram: 1;
        uint32_t RSVD_2: 1;
        uint32_t RSVD_1: 1;
        uint32_t RSVD: 19;
    };
} PLATFORM_REG_BT_BIST_TEST_RESUME_TYPE;

/*0x4000_60ec PLATFORM_REG_BT_BIST_TEST_RESUME*/
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_leslv_ram_Pos                                      0U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_leslv_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_leslv_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lecis_ram_Pos                                      1U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lecis_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lecis_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lebis_ram_Pos                                      2U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lebis_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lebis_ram_Pos)

