rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_buffer_ram_Pos                                     3U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_buffer_ram_Msk                                     (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_buffer_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_audio_ram_Pos                                      4U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_audio_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_audio_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_btphy_ram_Pos                                      5U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_btphy_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_btphy_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_ccmp_ram_Pos                                       6U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_ccmp_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_ccmp_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_btrx_ram_Pos                                       7U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_btrx_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_btrx_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_bttx_ram_Pos                                       8U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_bttx_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_bttx_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lepa_ram_Pos                                       9U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lepa_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lepa_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lemst_ram_Pos                                      10U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lemst_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_bist_test_resume_lemst_ram_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_2_Pos                                                          11U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_2_Msk                                                          (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_2_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_1_Pos                                                          12U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_1_Msk                                                          (0x1UL << PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_1_Pos)

#define PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_Pos                                                            13U
#define PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_Msk                                                            (0x7FFFFUL << PLATFORM_REG_BT_BIST_TEST_RESUME_RSVD_Pos)

/* 0x00F0   0x4000_60f0
    0       R       bist_start_pause_leslv_ram                          0
    1       R       bist_start_pause_lecis_ram                          0
    2       R       bist_start_pause_lebis_ram                          0
    3       R       bist_start_pause_buffer_ram                         0
    4       R       bist_start_pause_audio_ram                          0
    5       R       bist_start_pause_btphy_ram                          0
    6       R       bist_start_pause_ccmp_ram                           0
    7       R       bist_start_pause_btrx_ram                           0
    8       R       bist_start_pause_bttx_ram                           0
    9       R       bist_start_pause_lepa_ram                           0
    10      R       bist_start_pause_lemst_ram                          0
    11      R       RSVD_1                                              0
    12      R       bist_start_pause_buffer_8k_ram                      0
    31:13   R       RSVD                                                19'h0
 */
typedef union _PLATFORM_REG_BT_BIST_START_PAUSE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_start_pause_leslv_ram: 1;
        uint32_t bist_start_pause_lecis_ram: 1;
        uint32_t bist_start_pause_lebis_ram: 1;
        uint32_t bist_start_pause_buffer_ram: 1;
        uint32_t bist_start_pause_audio_ram: 1;
        uint32_t bist_start_pause_btphy_ram: 1;
        uint32_t bist_start_pause_ccmp_ram: 1;
        uint32_t bist_start_pause_btrx_ram: 1;
        uint32_t bist_start_pause_bttx_ram: 1;
        uint32_t bist_start_pause_lepa_ram: 1;
        uint32_t bist_start_pause_lemst_ram: 1;
        uint32_t RSVD_1: 1;
        uint32_t bist_start_pause_buffer_8k_ram: 1;
        uint32_t RSVD: 19;
    };
} PLATFORM_REG_BT_BIST_START_PAUSE_TYPE;

/*0x4000_60f0 PLATFORM_REG_BT_BIST_START_PAUSE*/
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_leslv_ram_Pos                                      0U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_leslv_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_leslv_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lecis_ram_Pos                                      1U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lecis_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lecis_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lebis_ram_Pos                                      2U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lebis_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lebis_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_buffer_ram_Pos                                     3U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_buffer_ram_Msk                                     (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_buffer_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_audio_ram_Pos                                      4U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_audio_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_audio_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_btphy_ram_Pos                                      5U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_btphy_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_btphy_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_ccmp_ram_Pos                                       6U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_ccmp_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_ccmp_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_btrx_ram_Pos                                       7U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_btrx_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_btrx_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_bttx_ram_Pos                                       8U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_bttx_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_bttx_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lepa_ram_Pos                                       9U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lepa_ram_Msk                                       (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lepa_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lemst_ram_Pos                                      10U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lemst_ram_Msk                                      (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_lemst_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_RSVD_1_Pos                                                          11U
#define PLATFORM_REG_BT_BIST_START_PAUSE_RSVD_1_Msk                                                          (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_RSVD_1_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_buffer_8k_ram_Pos                                  12U
#define PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_buffer_8k_ram_Msk                                  (0x1UL << PLATFORM_REG_BT_BIST_START_PAUSE_bist_start_pause_buffer_8k_ram_Pos)

#define PLATFORM_REG_BT_BIST_START_PAUSE_RSVD_Pos                                                            13U
#define PLATFORM_REG_BT_BIST_START_PAUSE_RSVD_Msk                                                            (0x7FFFFUL << PLATFORM_REG_BT_BIST_START_PAUSE_RSVD_Pos)

/* 0x00F4   0x4000_60f4
    0       R       bist_done_leslv_ram                                 0
    1       R       bist_done_lecis_ram                                 0
    2       R       bist_done_lebis_ram                                 0
    3       R       bist_done_buffer_ram                                0
    4       R       bist_done_audio_ram                                 0
    5       R       bist_done_btphy_ram                                 0
    6       R       bist_done_ccmp_ram                                  0
    7       R       bist_done_btrx_ram                                  0
    8       R       bist_done_bttx_ram                                  0
    9       R       bist_done_lepa_ram                                  0
    10      R       bist_done_lemst_ram                                 0
    11      R       RSVD_1                                              0
    12      R       bist_done_buffer_8k_ram                             0
    31:13   R       RSVD                                                19'h0
 */
typedef union _PLATFORM_REG_BT_BIST_DONE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_done_leslv_ram: 1;
        uint32_t bist_done_lecis_ram: 1;
        uint32_t bist_done_lebis_ram: 1;
        uint32_t bist_done_buffer_ram: 1;
        uint32_t bist_done_audio_ram: 1;
        uint32_t bist_done_btphy_ram: 1;
        uint32_t bist_done_ccmp_ram: 1;
        uint32_t bist_done_btrx_ram: 1;
        uint32_t bist_done_bttx_ram: 1;
        uint32_t bist_done_lepa_ram: 1;
        uint32_t bist_done_lemst_ram: 1;
        uint32_t RSVD_1: 1;
        uint32_t bist_done_buffer_8k_ram: 1;
        uint32_t RSVD: 19;
    };
} PLATFORM_REG_BT_BIST_DONE_TYPE;

/*0x4000_60f4 PLATFORM_REG_BT_BIST_DONE*/
#define PLATFORM_REG_BT_BIST_DONE_bist_done_leslv_ram_Pos                                                    0U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_leslv_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_leslv_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_lecis_ram_Pos                                                    1U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_lecis_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_lecis_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_lebis_ram_Pos                                                    2U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_lebis_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_lebis_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_buffer_ram_Pos                                                   3U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_buffer_ram_Msk                                                   (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_buffer_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_audio_ram_Pos                                                    4U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_audio_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_audio_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_btphy_ram_Pos                                                    5U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_btphy_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_btphy_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_ccmp_ram_Pos                                                     6U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_ccmp_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_ccmp_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_btrx_ram_Pos                                                     7U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_btrx_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_btrx_ram_Pos)

