rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_BT_BIST_DONE_bist_done_bttx_ram_Pos                                                     8U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_bttx_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_bttx_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_lepa_ram_Pos                                                     9U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_lepa_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_lepa_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_lemst_ram_Pos                                                    10U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_lemst_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_lemst_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_RSVD_1_Pos                                                                 11U
#define PLATFORM_REG_BT_BIST_DONE_RSVD_1_Msk                                                                 (0x1UL << PLATFORM_REG_BT_BIST_DONE_RSVD_1_Pos)

#define PLATFORM_REG_BT_BIST_DONE_bist_done_buffer_8k_ram_Pos                                                12U
#define PLATFORM_REG_BT_BIST_DONE_bist_done_buffer_8k_ram_Msk                                                (0x1UL << PLATFORM_REG_BT_BIST_DONE_bist_done_buffer_8k_ram_Pos)

#define PLATFORM_REG_BT_BIST_DONE_RSVD_Pos                                                                   13U
#define PLATFORM_REG_BT_BIST_DONE_RSVD_Msk                                                                   (0x7FFFFUL << PLATFORM_REG_BT_BIST_DONE_RSVD_Pos)

/* 0x00F8   0x4000_60f8
    0       R       bist_fail_leslv_ram                                 0
    1       R       bist_fail_lecis_ram                                 0
    2       R       bist_fail_lebis_ram                                 0
    3       R       bist_fail_buffer_ram                                0
    4       R       bist_fail_audio_ram                                 0
    8:5     R       bist_fail_btphy_ram                                 4'b0000
    11:9    R       bist_fail_ccmp_ram                                  3'b000
    12      R       bist_fail_btrx_ram                                  0
    13      R       bist_fail_bttx_ram                                  0
    14      R       bist_fail_lepa_ram                                  0
    15      R       bist_fail_lemst_ram                                 0
    16      R       RSVD_1                                              0
    17      R       bist_fail_buffer_8k_ram                             0
    31:18   R       RSVD                                                14'h0
 */
typedef union _PLATFORM_REG_BT_BIST_FAIL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_fail_leslv_ram: 1;
        uint32_t bist_fail_lecis_ram: 1;
        uint32_t bist_fail_lebis_ram: 1;
        uint32_t bist_fail_buffer_ram: 1;
        uint32_t bist_fail_audio_ram: 1;
        uint32_t bist_fail_btphy_ram: 4;
        uint32_t bist_fail_ccmp_ram: 3;
        uint32_t bist_fail_btrx_ram: 1;
        uint32_t bist_fail_bttx_ram: 1;
        uint32_t bist_fail_lepa_ram: 1;
        uint32_t bist_fail_lemst_ram: 1;
        uint32_t RSVD_1: 1;
        uint32_t bist_fail_buffer_8k_ram: 1;
        uint32_t RSVD: 14;
    };
} PLATFORM_REG_BT_BIST_FAIL_TYPE;

/*0x4000_60f8 PLATFORM_REG_BT_BIST_FAIL*/
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_leslv_ram_Pos                                                    0U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_leslv_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_leslv_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lecis_ram_Pos                                                    1U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lecis_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_lecis_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lebis_ram_Pos                                                    2U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lebis_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_lebis_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_buffer_ram_Pos                                                   3U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_buffer_ram_Msk                                                   (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_buffer_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_audio_ram_Pos                                                    4U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_audio_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_audio_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_btphy_ram_Pos                                                    5U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_btphy_ram_Msk                                                    (0xFUL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_btphy_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_ccmp_ram_Pos                                                     9U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_ccmp_ram_Msk                                                     (0x7UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_ccmp_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_btrx_ram_Pos                                                     12U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_btrx_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_btrx_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_bttx_ram_Pos                                                     13U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_bttx_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_bttx_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lepa_ram_Pos                                                     14U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lepa_ram_Msk                                                     (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_lepa_ram_Pos)

