rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lemst_ram_Pos                                                    15U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_lemst_ram_Msk                                                    (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_lemst_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_RSVD_1_Pos                                                                 16U
#define PLATFORM_REG_BT_BIST_FAIL_RSVD_1_Msk                                                                 (0x1UL << PLATFORM_REG_BT_BIST_FAIL_RSVD_1_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_buffer_8k_ram_Pos                                                17U
#define PLATFORM_REG_BT_BIST_FAIL_bist_fail_buffer_8k_ram_Msk                                                (0x1UL << PLATFORM_REG_BT_BIST_FAIL_bist_fail_buffer_8k_ram_Pos)

#define PLATFORM_REG_BT_BIST_FAIL_RSVD_Pos                                                                   18U
#define PLATFORM_REG_BT_BIST_FAIL_RSVD_Msk                                                                   (0x3FFFUL << PLATFORM_REG_BT_BIST_FAIL_RSVD_Pos)

/* 0x00FC   0x4000_60fc
    0       R       bist_done_drf_leslv_ram                             0
    1       R       bist_done_drf_lecis_ram                             0
    2       R       bist_done_drf_lebis_ram                             0
    3       R       bist_done_drf_buffer_ram                            0
    4       R       bist_done_drf_audio_ram                             0
    5       R       bist_done_drf_btphy_ram                             0
    6       R       bist_done_drf_ccmp_ram                              0
    7       R       bist_done_drf_btrx_ram                              0
    8       R       bist_done_drf_bttx_ram                              0
    9       R       bist_done_drf_lepa_ram                              0
    10      R       bist_done_drf_lemst_ram                             0
    11      R       RSVD_1                                              0
    12      R       bist_done_drf_buffer_8k_ram                         0
    31:13   R       RSVD                                                19'h0
 */
typedef union _PLATFORM_REG_BT_DRF_BIST_DONE_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t bist_done_drf_leslv_ram: 1;
        uint32_t bist_done_drf_lecis_ram: 1;
        uint32_t bist_done_drf_lebis_ram: 1;
        uint32_t bist_done_drf_buffer_ram: 1;
        uint32_t bist_done_drf_audio_ram: 1;
        uint32_t bist_done_drf_btphy_ram: 1;
        uint32_t bist_done_drf_ccmp_ram: 1;
        uint32_t bist_done_drf_btrx_ram: 1;
        uint32_t bist_done_drf_bttx_ram: 1;
        uint32_t bist_done_drf_lepa_ram: 1;
        uint32_t bist_done_drf_lemst_ram: 1;
        uint32_t RSVD_1: 1;
        uint32_t bist_done_drf_buffer_8k_ram: 1;
        uint32_t RSVD: 19;
    };
} PLATFORM_REG_BT_DRF_BIST_DONE_TYPE;

/*0x4000_60fc PLATFORM_REG_BT_DRF_BIST_DONE*/
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_leslv_ram_Pos                                            0U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_leslv_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_leslv_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lecis_ram_Pos                                            1U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lecis_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lecis_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lebis_ram_Pos                                            2U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lebis_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lebis_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_buffer_ram_Pos                                           3U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_buffer_ram_Msk                                           (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_buffer_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_audio_ram_Pos                                            4U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_audio_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_audio_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_btphy_ram_Pos                                            5U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_btphy_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_btphy_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_ccmp_ram_Pos                                             6U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_ccmp_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_ccmp_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_btrx_ram_Pos                                             7U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_btrx_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_btrx_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_bttx_ram_Pos                                             8U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_bttx_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_bttx_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lepa_ram_Pos                                             9U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lepa_ram_Msk                                             (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lepa_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lemst_ram_Pos                                            10U
#define PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lemst_ram_Msk                                            (0x1UL << PLATFORM_REG_BT_DRF_BIST_DONE_bist_done_drf_lemst_ram_Pos)

