rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_BT_DRF_BIST_FAIL_bist_fail_drf_buffer_8k_ram_Pos                                        17U
#define PLATFORM_REG_BT_DRF_BIST_FAIL_bist_fail_drf_buffer_8k_ram_Msk                                        (0x1UL << PLATFORM_REG_BT_DRF_BIST_FAIL_bist_fail_drf_buffer_8k_ram_Pos)

#define PLATFORM_REG_BT_DRF_BIST_FAIL_RSVD_Pos                                                               18U
#define PLATFORM_REG_BT_DRF_BIST_FAIL_RSVD_Msk                                                               (0x3FFFUL << PLATFORM_REG_BT_DRF_BIST_FAIL_RSVD_Pos)

/* 0x0130   0x4000_6130
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_6_TYPE;

/*0x4000_6130 PLATFORM_Reserved_6*/
#define PLATFORM_Reserved_6_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_6_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_6_RSVD_Pos)

/* 0x0134   0x4000_6134
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_7_TYPE;

/*0x4000_6134 PLATFORM_Reserved_7*/
#define PLATFORM_Reserved_7_RSVD_Pos                                                                         0U
#define PLATFORM_Reserved_7_RSVD_Msk                                                                         (0xFFFFFFFFUL << PLATFORM_Reserved_7_RSVD_Pos)

/* 0x01E0   0x4000_61e0
    27:0    R/W     WDT_CNT_LIMIT                                       28'h4E200
    29:28   R/W     WDT_MODE                                            2'h0
    30      R/W1C   WDT_TO                                              1'h0
    31      R/W     WDT_EN                                              1'h0
 */
typedef union _PLATFORM_REG_WDT_CTL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WDT_CNT_LIMIT: 28;
        uint32_t WDT_MODE: 2;
        uint32_t WDT_TO: 1;
        uint32_t WDT_EN: 1;
    };
} PLATFORM_REG_WDT_CTL_TYPE;

/*0x4000_61e0 PLATFORM_REG_WDT_CTL*/
#define PLATFORM_REG_WDT_CTL_WDT_CNT_LIMIT_Pos                                                               0U
#define PLATFORM_REG_WDT_CTL_WDT_CNT_LIMIT_Msk                                                               (0xFFFFFFFUL << PLATFORM_REG_WDT_CTL_WDT_CNT_LIMIT_Pos)

#define PLATFORM_REG_WDT_CTL_WDT_MODE_Pos                                                                    28U
#define PLATFORM_REG_WDT_CTL_WDT_MODE_Msk                                                                    (0x3UL << PLATFORM_REG_WDT_CTL_WDT_MODE_Pos)

#define PLATFORM_REG_WDT_CTL_WDT_TO_Pos                                                                      30U
#define PLATFORM_REG_WDT_CTL_WDT_TO_Msk                                                                      (0x1UL << PLATFORM_REG_WDT_CTL_WDT_TO_Pos)

#define PLATFORM_REG_WDT_CTL_WDT_EN_Pos                                                                      31U
#define PLATFORM_REG_WDT_CTL_WDT_EN_Msk                                                                      (0x1UL << PLATFORM_REG_WDT_CTL_WDT_EN_Pos)

/* 0x01E4   0x4000_61e4
    15:0    R/WAC   WDT_KICK                                            16'h0
    31:16   R       RESERVED                                            16'h0
 */
typedef union _PLATFORM_REG_WDT_KICK_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WDT_KICK: 16;
        uint32_t RESERVED: 16;
    };
} PLATFORM_REG_WDT_KICK_TYPE;

/*0x4000_61e4 PLATFORM_REG_WDT_KICK*/
#define PLATFORM_REG_WDT_KICK_WDT_KICK_Pos                                                                   0U
#define PLATFORM_REG_WDT_KICK_WDT_KICK_Msk                                                                   (0xFFFFUL << PLATFORM_REG_WDT_KICK_WDT_KICK_Pos)

#define PLATFORM_REG_WDT_KICK_RESERVED_Pos                                                                   16U
#define PLATFORM_REG_WDT_KICK_RESERVED_Msk                                                                   (0xFFFFUL << PLATFORM_REG_WDT_KICK_RESERVED_Pos)

/* 0x01E8   0x4000_61e8
    27:0    R       WDT_CURRENT                                         28'h0
    31:28   R       RESERVED                                            4'h0
 */
typedef union _PLATFORM_REG_WDT_CURRENT_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WDT_CURRENT: 28;
        uint32_t RESERVED: 4;
    };
} PLATFORM_REG_WDT_CURRENT_TYPE;

/*0x4000_61e8 PLATFORM_REG_WDT_CURRENT*/
#define PLATFORM_REG_WDT_CURRENT_WDT_CURRENT_Pos                                                             0U
#define PLATFORM_REG_WDT_CURRENT_WDT_CURRENT_Msk                                                             (0xFFFFFFFUL << PLATFORM_REG_WDT_CURRENT_WDT_CURRENT_Pos)

#define PLATFORM_REG_WDT_CURRENT_RESERVED_Pos                                                                28U
#define PLATFORM_REG_WDT_CURRENT_RESERVED_Msk                                                                (0xFUL << PLATFORM_REG_WDT_CURRENT_RESERVED_Pos)

/* 0x01EC   0x4000_61ec
    31:0    R       WDT_VER                                             32'h2409030A
 */
typedef union _PLATFORM_REG_WDT_VER_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WDT_VER;
    };
} PLATFORM_REG_WDT_VER_TYPE;

/*0x4000_61ec PLATFORM_REG_WDT_VER*/
#define PLATFORM_REG_WDT_VER_WDT_VER_Pos                                                                     0U
#define PLATFORM_REG_WDT_VER_WDT_VER_Msk                                                                     (0xFFFFFFFFUL << PLATFORM_REG_WDT_VER_WDT_VER_Pos)

/* 0x01F0   0x4000_61f0
    0       R/W     WDT_CLK_QACTIVE_MAN_DATA                            1'h0
    1       R/W     WDT_CLK_QACTIVE_MAN_ENABLE                          1'h0
    31:2    R       RESERVED                                            30'h0
 */
typedef union _PLATFORM_REG_WDT_CLK_QACTIVE_CTL_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t WDT_CLK_QACTIVE_MAN_DATA: 1;
        uint32_t WDT_CLK_QACTIVE_MAN_ENABLE: 1;
        uint32_t RESERVED: 30;
    };
} PLATFORM_REG_WDT_CLK_QACTIVE_CTL_TYPE;

/*0x4000_61f0 PLATFORM_REG_WDT_CLK_QACTIVE_CTL*/
#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL_WDT_CLK_QACTIVE_MAN_DATA_Pos                                        0U
#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL_WDT_CLK_QACTIVE_MAN_DATA_Msk                                        (0x1UL << PLATFORM_REG_WDT_CLK_QACTIVE_CTL_WDT_CLK_QACTIVE_MAN_DATA_Pos)

#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL_WDT_CLK_QACTIVE_MAN_ENABLE_Pos                                      1U
#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL_WDT_CLK_QACTIVE_MAN_ENABLE_Msk                                      (0x1UL << PLATFORM_REG_WDT_CLK_QACTIVE_CTL_WDT_CLK_QACTIVE_MAN_ENABLE_Pos)

