rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL_RESERVED_Pos                                                        2U
#define PLATFORM_REG_WDT_CLK_QACTIVE_CTL_RESERVED_Msk                                                        (0x3FFFFFFFUL << PLATFORM_REG_WDT_CLK_QACTIVE_CTL_RESERVED_Pos)

/* 0x0200   0x4000_6200
    0       R/W     rng_srst                                            0
    1       R/W     clk_hf_sel                                          0
    2       R/W     corrector_bypass                                    0
    3       R/W     cali_srst                                           0
    4       R       RSVD_1                                              0
    5       R/W     corrector_imode                                     0
    10:6    R/W     dbg0_sel                                            5'h0
    15:11   R/W     dbg1_sel                                            5'h1
    16      R/W     lfsr_bypass_1                                       1
    17      R/W     lfsr_mode                                           0
    18      R/W     st_en                                               0
    19      R/W     mode                                                0
    31:20   R       RSVD                                                12'h0
 */
typedef union _PLATFORM_RNGControlRegister_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t rng_srst: 1;
        uint32_t clk_hf_sel: 1;
        uint32_t corrector_bypass: 1;
        uint32_t cali_srst: 1;
        uint32_t RSVD_1: 1;
        uint32_t corrector_imode: 1;
        uint32_t dbg0_sel: 5;
        uint32_t dbg1_sel: 5;
        uint32_t lfsr_bypass_1: 1;
        uint32_t lfsr_mode: 1;
        uint32_t st_en: 1;
        uint32_t mode: 1;
        uint32_t RSVD: 12;
    };
} PLATFORM_RNGControlRegister_TYPE;

/*0x4000_6200 PLATFORM_RNGControlRegister*/
#define PLATFORM_RNGControlRegister_rng_srst_Pos                                                             0U
#define PLATFORM_RNGControlRegister_rng_srst_Msk                                                             (0x1UL << PLATFORM_RNGControlRegister_rng_srst_Pos)

#define PLATFORM_RNGControlRegister_clk_hf_sel_Pos                                                           1U
#define PLATFORM_RNGControlRegister_clk_hf_sel_Msk                                                           (0x1UL << PLATFORM_RNGControlRegister_clk_hf_sel_Pos)

#define PLATFORM_RNGControlRegister_corrector_bypass_Pos                                                     2U
#define PLATFORM_RNGControlRegister_corrector_bypass_Msk                                                     (0x1UL << PLATFORM_RNGControlRegister_corrector_bypass_Pos)

#define PLATFORM_RNGControlRegister_cali_srst_Pos                                                            3U
#define PLATFORM_RNGControlRegister_cali_srst_Msk                                                            (0x1UL << PLATFORM_RNGControlRegister_cali_srst_Pos)

#define PLATFORM_RNGControlRegister_RSVD_1_Pos                                                               4U
#define PLATFORM_RNGControlRegister_RSVD_1_Msk                                                               (0x1UL << PLATFORM_RNGControlRegister_RSVD_1_Pos)

#define PLATFORM_RNGControlRegister_corrector_imode_Pos                                                      5U
#define PLATFORM_RNGControlRegister_corrector_imode_Msk                                                      (0x1UL << PLATFORM_RNGControlRegister_corrector_imode_Pos)

#define PLATFORM_RNGControlRegister_dbg0_sel_Pos                                                             6U
#define PLATFORM_RNGControlRegister_dbg0_sel_Msk                                                             (0x1FUL << PLATFORM_RNGControlRegister_dbg0_sel_Pos)

#define PLATFORM_RNGControlRegister_dbg1_sel_Pos                                                             11U
#define PLATFORM_RNGControlRegister_dbg1_sel_Msk                                                             (0x1FUL << PLATFORM_RNGControlRegister_dbg1_sel_Pos)

#define PLATFORM_RNGControlRegister_lfsr_bypass_1_Pos                                                        16U
#define PLATFORM_RNGControlRegister_lfsr_bypass_1_Msk                                                        (0x1UL << PLATFORM_RNGControlRegister_lfsr_bypass_1_Pos)

#define PLATFORM_RNGControlRegister_lfsr_mode_Pos                                                            17U
#define PLATFORM_RNGControlRegister_lfsr_mode_Msk                                                            (0x1UL << PLATFORM_RNGControlRegister_lfsr_mode_Pos)

#define PLATFORM_RNGControlRegister_st_en_Pos                                                                18U
#define PLATFORM_RNGControlRegister_st_en_Msk                                                                (0x1UL << PLATFORM_RNGControlRegister_st_en_Pos)

#define PLATFORM_RNGControlRegister_mode_Pos                                                                 19U
#define PLATFORM_RNGControlRegister_mode_Msk                                                                 (0x1UL << PLATFORM_RNGControlRegister_mode_Pos)

#define PLATFORM_RNGControlRegister_RSVD_Pos                                                                 20U
#define PLATFORM_RNGControlRegister_RSVD_Msk                                                                 (0xFFFUL << PLATFORM_RNGControlRegister_RSVD_Pos)

/* 0x0204   0x4000_6204
    1:0     R/W     DUMMY_1                                             2'b0
    3:2     R       RSVD_1                                              2'b0
    15:4    R/W     DUMMY                                               12'h889
    31:16   R       RSVD                                                16'h0
 */
typedef union _PLATFORM_Reserved_8_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY_1: 2;
        uint32_t RSVD_1: 2;
        uint32_t DUMMY: 12;
        uint32_t RSVD: 16;
    };
} PLATFORM_Reserved_8_TYPE;

/*0x4000_6204 PLATFORM_Reserved_8*/
#define PLATFORM_Reserved_8_DUMMY_1_Pos                                                                      0U
#define PLATFORM_Reserved_8_DUMMY_1_Msk                                                                      (0x3UL << PLATFORM_Reserved_8_DUMMY_1_Pos)

#define PLATFORM_Reserved_8_RSVD_1_Pos                                                                       2U
#define PLATFORM_Reserved_8_RSVD_1_Msk                                                                       (0x3UL << PLATFORM_Reserved_8_RSVD_1_Pos)

#define PLATFORM_Reserved_8_DUMMY_Pos                                                                        4U
#define PLATFORM_Reserved_8_DUMMY_Msk                                                                        (0xFFFUL << PLATFORM_Reserved_8_DUMMY_Pos)

