rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_Reserved_8_RSVD_Pos                                                                         16U
#define PLATFORM_Reserved_8_RSVD_Msk                                                                         (0xFFFFUL << PLATFORM_Reserved_8_RSVD_Pos)

/* 0x0208   0x4000_6208
    31:0    R/W     DUMMY                                               32'h28001a00
 */
typedef union _PLATFORM_Reserved_9_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY;
    };
} PLATFORM_Reserved_9_TYPE;

/*0x4000_6208 PLATFORM_Reserved_9*/
#define PLATFORM_Reserved_9_DUMMY_Pos                                                                        0U
#define PLATFORM_Reserved_9_DUMMY_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_9_DUMMY_Pos)

/* 0x020C   0x4000_620c
    8:0     R/W     DUMMY_1                                             9'h101
    11:9    R       RSVD                                                3'h0
    31:12   R/W     DUMMY                                               20'h10d0
 */
typedef union _PLATFORM_Reserved_10_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY_1: 9;
        uint32_t RSVD: 3;
        uint32_t DUMMY: 20;
    };
} PLATFORM_Reserved_10_TYPE;

/*0x4000_620c PLATFORM_Reserved_10*/
#define PLATFORM_Reserved_10_DUMMY_1_Pos                                                                     0U
#define PLATFORM_Reserved_10_DUMMY_1_Msk                                                                     (0x1FFUL << PLATFORM_Reserved_10_DUMMY_1_Pos)

#define PLATFORM_Reserved_10_RSVD_Pos                                                                        9U
#define PLATFORM_Reserved_10_RSVD_Msk                                                                        (0x7UL << PLATFORM_Reserved_10_RSVD_Pos)

#define PLATFORM_Reserved_10_DUMMY_Pos                                                                       12U
#define PLATFORM_Reserved_10_DUMMY_Msk                                                                       (0xFFFFFUL << PLATFORM_Reserved_10_DUMMY_Pos)

/* 0x0210   0x4000_6210
    31:0    R       RSVD                                                32'h00020000
 */
typedef union _PLATFORM_Reserved_11_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_11_TYPE;

/*0x4000_6210 PLATFORM_Reserved_11*/
#define PLATFORM_Reserved_11_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_11_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_11_RSVD_Pos)

/* 0x0214   0x4000_6214
    31:0    R/W     DUMMY                                               32'h2b001800
 */
typedef union _PLATFORM_Reserved_12_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY;
    };
} PLATFORM_Reserved_12_TYPE;

/*0x4000_6214 PLATFORM_Reserved_12*/
#define PLATFORM_Reserved_12_DUMMY_Pos                                                                       0U
#define PLATFORM_Reserved_12_DUMMY_Msk                                                                       (0xFFFFFFFFUL << PLATFORM_Reserved_12_DUMMY_Pos)

/* 0x0218   0x4000_6218
    3:0     R/W     DUMMY_1                                             4'h8
    15:4    R/W     RSVD_1                                              12'h0
    19:16   R/W     DUMMY                                               4'h4
    31:20   R/W     RSVD                                                12'h0
 */
typedef union _PLATFORM_Reserved_13_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY_1: 4;
        uint32_t RSVD_1: 12;
        uint32_t DUMMY: 4;
        uint32_t RSVD: 12;
    };
} PLATFORM_Reserved_13_TYPE;

/*0x4000_6218 PLATFORM_Reserved_13*/
#define PLATFORM_Reserved_13_DUMMY_1_Pos                                                                     0U
#define PLATFORM_Reserved_13_DUMMY_1_Msk                                                                     (0xFUL << PLATFORM_Reserved_13_DUMMY_1_Pos)

#define PLATFORM_Reserved_13_RSVD_1_Pos                                                                      4U
#define PLATFORM_Reserved_13_RSVD_1_Msk                                                                      (0xFFFUL << PLATFORM_Reserved_13_RSVD_1_Pos)

#define PLATFORM_Reserved_13_DUMMY_Pos                                                                       16U
#define PLATFORM_Reserved_13_DUMMY_Msk                                                                       (0xFUL << PLATFORM_Reserved_13_DUMMY_Pos)

#define PLATFORM_Reserved_13_RSVD_Pos                                                                        20U
#define PLATFORM_Reserved_13_RSVD_Msk                                                                        (0xFFFUL << PLATFORM_Reserved_13_RSVD_Pos)

/* 0x021C   0x4000_621c
    0       R       out_ready                                           0
    1       R       init_ready                                          0
    31:2    R       RSVD                                                30'h0
 */
typedef union _PLATFORM_RNG_return0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t out_ready: 1;
        uint32_t init_ready: 1;
        uint32_t RSVD: 30;
    };
} PLATFORM_RNG_return0_TYPE;

/*0x4000_621c PLATFORM_RNG_return0*/
#define PLATFORM_RNG_return0_out_ready_Pos                                                                   0U
#define PLATFORM_RNG_return0_out_ready_Msk                                                                   (0x1UL << PLATFORM_RNG_return0_out_ready_Pos)

#define PLATFORM_RNG_return0_init_ready_Pos                                                                  1U
#define PLATFORM_RNG_return0_init_ready_Msk                                                                  (0x1UL << PLATFORM_RNG_return0_init_ready_Pos)

#define PLATFORM_RNG_return0_RSVD_Pos                                                                        2U
#define PLATFORM_RNG_return0_RSVD_Msk                                                                        (0x3FFFFFFFUL << PLATFORM_RNG_return0_RSVD_Pos)

/* 0x0220   0x4000_6220
    31:0    R       valid_bit_num                                       32'h0
 */
typedef union _PLATFORM_RNG_return1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t valid_bit_num;
    };
} PLATFORM_RNG_return1_TYPE;

