rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_6220 PLATFORM_RNG_return1*/
#define PLATFORM_RNG_return1_valid_bit_num_Pos                                                               0U
#define PLATFORM_RNG_return1_valid_bit_num_Msk                                                               (0xFFFFFFFFUL << PLATFORM_RNG_return1_valid_bit_num_Pos)

/* 0x0224   0x4000_6224
    31:0    R       drop_num                                            32'h0
 */
typedef union _PLATFORM_RNG_return2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t drop_num;
    };
} PLATFORM_RNG_return2_TYPE;

/*0x4000_6224 PLATFORM_RNG_return2*/
#define PLATFORM_RNG_return2_drop_num_Pos                                                                    0U
#define PLATFORM_RNG_return2_drop_num_Msk                                                                    (0xFFFFFFFFUL << PLATFORM_RNG_return2_drop_num_Pos)

/* 0x0228   0x4000_6228
    31:0    R       random_out                                          32'h0
 */
typedef union _PLATFORM_RNG_result_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t random_out;
    };
} PLATFORM_RNG_result_TYPE;

/*0x4000_6228 PLATFORM_RNG_result*/
#define PLATFORM_RNG_result_random_out_Pos                                                                   0U
#define PLATFORM_RNG_result_random_out_Msk                                                                   (0xFFFFFFFFUL << PLATFORM_RNG_result_random_out_Pos)

/* 0x022C   0x4000_622c
    31:0    R/W     lfsr_poly_lsb                                       32'h0
 */
typedef union _PLATFORM_RNG_lfsr_poly_lsb_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t lfsr_poly_lsb;
    };
} PLATFORM_RNG_lfsr_poly_lsb_TYPE;

/*0x4000_622c PLATFORM_RNG_lfsr_poly_lsb*/
#define PLATFORM_RNG_lfsr_poly_lsb_lfsr_poly_lsb_Pos                                                         0U
#define PLATFORM_RNG_lfsr_poly_lsb_lfsr_poly_lsb_Msk                                                         (0xFFFFFFFFUL << PLATFORM_RNG_lfsr_poly_lsb_lfsr_poly_lsb_Pos)

/* 0x0230   0x4000_6230
    31:0    R/W     lfsr_poly_msb                                       32'h0
 */
typedef union _PLATFORM_RNG_lfsr_poly_msb_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t lfsr_poly_msb;
    };
} PLATFORM_RNG_lfsr_poly_msb_TYPE;

/*0x4000_6230 PLATFORM_RNG_lfsr_poly_msb*/
#define PLATFORM_RNG_lfsr_poly_msb_lfsr_poly_msb_Pos                                                         0U
#define PLATFORM_RNG_lfsr_poly_msb_lfsr_poly_msb_Msk                                                         (0xFFFFFFFFUL << PLATFORM_RNG_lfsr_poly_msb_lfsr_poly_msb_Pos)

/* 0x0234   0x4000_6234
    31:0    R/W     DUMMY                                               32'hffff0000
 */
typedef union _PLATFORM_Reserved_14_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t DUMMY;
    };
} PLATFORM_Reserved_14_TYPE;

/*0x4000_6234 PLATFORM_Reserved_14*/
#define PLATFORM_Reserved_14_DUMMY_Pos                                                                       0U
#define PLATFORM_Reserved_14_DUMMY_Msk                                                                       (0xFFFFFFFFUL << PLATFORM_Reserved_14_DUMMY_Pos)

/* 0x0238   0x4000_6238
    0       R/W     gating_en                                           1
    31:1    R       RSVD                                                31'h0
 */
typedef union _PLATFORM_RNG_POWER_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t gating_en: 1;
        uint32_t RSVD: 31;
    };
} PLATFORM_RNG_POWER_TYPE;

/*0x4000_6238 PLATFORM_RNG_POWER*/
#define PLATFORM_RNG_POWER_gating_en_Pos                                                                     0U
#define PLATFORM_RNG_POWER_gating_en_Msk                                                                     (0x1UL << PLATFORM_RNG_POWER_gating_en_Pos)

#define PLATFORM_RNG_POWER_RSVD_Pos                                                                          1U
#define PLATFORM_RNG_POWER_RSVD_Msk                                                                          (0x7FFFFFFFUL << PLATFORM_RNG_POWER_RSVD_Pos)

/* 0x023C   0x4000_623c
    7:0     R/W     thr_done_rep                                        8'h0
    15:8    R/W     thr_err_rep                                         8'h5
    17:16   R/W     window_size_adap2                                   2'b1
    19:18   R/W     window_size_adap1                                   2'b1
    20      R/W     compare_unit_adap2                                  0
    21      R/W     compare_unit_adap1                                  0
    22      R/W     compare_unit_rep                                    1
    23      R       RSVD                                                0
    27:24   R/W     thr_done_adap2                                      4'h4
    31:28   R/W     thr_done_adap1                                      4'h4
 */
typedef union _PLATFORM_RNG_st_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t thr_done_rep: 8;
        uint32_t thr_err_rep: 8;
        uint32_t window_size_adap2: 2;
        uint32_t window_size_adap1: 2;
        uint32_t compare_unit_adap2: 1;
        uint32_t compare_unit_adap1: 1;
        uint32_t compare_unit_rep: 1;
        uint32_t RSVD: 1;
        uint32_t thr_done_adap2: 4;
        uint32_t thr_done_adap1: 4;
    };
} PLATFORM_RNG_st_TYPE;

/*0x4000_623c PLATFORM_RNG_st*/
#define PLATFORM_RNG_st_thr_done_rep_Pos                                                                     0U
#define PLATFORM_RNG_st_thr_done_rep_Msk                                                                     (0xFFUL << PLATFORM_RNG_st_thr_done_rep_Pos)

#define PLATFORM_RNG_st_thr_err_rep_Pos                                                                      8U
#define PLATFORM_RNG_st_thr_err_rep_Msk                                                                      (0xFFUL << PLATFORM_RNG_st_thr_err_rep_Pos)

#define PLATFORM_RNG_st_window_size_adap2_Pos                                                                16U
#define PLATFORM_RNG_st_window_size_adap2_Msk                                                                (0x3UL << PLATFORM_RNG_st_window_size_adap2_Pos)

