rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_RNG_st_window_size_adap1_Pos                                                                18U
#define PLATFORM_RNG_st_window_size_adap1_Msk                                                                (0x3UL << PLATFORM_RNG_st_window_size_adap1_Pos)

#define PLATFORM_RNG_st_compare_unit_adap2_Pos                                                               20U
#define PLATFORM_RNG_st_compare_unit_adap2_Msk                                                               (0x1UL << PLATFORM_RNG_st_compare_unit_adap2_Pos)

#define PLATFORM_RNG_st_compare_unit_adap1_Pos                                                               21U
#define PLATFORM_RNG_st_compare_unit_adap1_Msk                                                               (0x1UL << PLATFORM_RNG_st_compare_unit_adap1_Pos)

#define PLATFORM_RNG_st_compare_unit_rep_Pos                                                                 22U
#define PLATFORM_RNG_st_compare_unit_rep_Msk                                                                 (0x1UL << PLATFORM_RNG_st_compare_unit_rep_Pos)

#define PLATFORM_RNG_st_RSVD_Pos                                                                             23U
#define PLATFORM_RNG_st_RSVD_Msk                                                                             (0x1UL << PLATFORM_RNG_st_RSVD_Pos)

#define PLATFORM_RNG_st_thr_done_adap2_Pos                                                                   24U
#define PLATFORM_RNG_st_thr_done_adap2_Msk                                                                   (0xFUL << PLATFORM_RNG_st_thr_done_adap2_Pos)

#define PLATFORM_RNG_st_thr_done_adap1_Pos                                                                   28U
#define PLATFORM_RNG_st_thr_done_adap1_Msk                                                                   (0xFUL << PLATFORM_RNG_st_thr_done_adap1_Pos)

/* 0x0240   0x4000_6240
    0       R/W     err_adap2                                           0
    1       R/W     err_adap1                                           0
    2       R/W     err_rep                                             0
    3       R/W     err                                                 0
    4       R       done_adap2                                          0
    5       R       done_adap1                                          0
    6       R       done_rep                                            0
    7       R       done                                                0
    31:8    R       RSVD                                                24'h0
 */
typedef union _PLATFORM_RNG_st_return_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t err_adap2: 1;
        uint32_t err_adap1: 1;
        uint32_t err_rep: 1;
        uint32_t err: 1;
        uint32_t done_adap2: 1;
        uint32_t done_adap1: 1;
        uint32_t done_rep: 1;
        uint32_t done: 1;
        uint32_t RSVD: 24;
    };
} PLATFORM_RNG_st_return_TYPE;

/*0x4000_6240 PLATFORM_RNG_st_return*/
#define PLATFORM_RNG_st_return_err_adap2_Pos                                                                 0U
#define PLATFORM_RNG_st_return_err_adap2_Msk                                                                 (0x1UL << PLATFORM_RNG_st_return_err_adap2_Pos)

#define PLATFORM_RNG_st_return_err_adap1_Pos                                                                 1U
#define PLATFORM_RNG_st_return_err_adap1_Msk                                                                 (0x1UL << PLATFORM_RNG_st_return_err_adap1_Pos)

#define PLATFORM_RNG_st_return_err_rep_Pos                                                                   2U
#define PLATFORM_RNG_st_return_err_rep_Msk                                                                   (0x1UL << PLATFORM_RNG_st_return_err_rep_Pos)

#define PLATFORM_RNG_st_return_err_Pos                                                                       3U
#define PLATFORM_RNG_st_return_err_Msk                                                                       (0x1UL << PLATFORM_RNG_st_return_err_Pos)

#define PLATFORM_RNG_st_return_done_adap2_Pos                                                                4U
#define PLATFORM_RNG_st_return_done_adap2_Msk                                                                (0x1UL << PLATFORM_RNG_st_return_done_adap2_Pos)

#define PLATFORM_RNG_st_return_done_adap1_Pos                                                                5U
#define PLATFORM_RNG_st_return_done_adap1_Msk                                                                (0x1UL << PLATFORM_RNG_st_return_done_adap1_Pos)

#define PLATFORM_RNG_st_return_done_rep_Pos                                                                  6U
#define PLATFORM_RNG_st_return_done_rep_Msk                                                                  (0x1UL << PLATFORM_RNG_st_return_done_rep_Pos)

#define PLATFORM_RNG_st_return_done_Pos                                                                      7U
#define PLATFORM_RNG_st_return_done_Msk                                                                      (0x1UL << PLATFORM_RNG_st_return_done_Pos)

#define PLATFORM_RNG_st_return_RSVD_Pos                                                                      8U
#define PLATFORM_RNG_st_return_RSVD_Msk                                                                      (0xFFFFFFUL << PLATFORM_RNG_st_return_RSVD_Pos)

/* 0x0244   0x4000_6244
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_15_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_15_TYPE;

/*0x4000_6244 PLATFORM_Reserved_15*/
#define PLATFORM_Reserved_15_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_15_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_15_RSVD_Pos)

/* 0x0248   0x4000_6248
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_16_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_16_TYPE;

/*0x4000_6248 PLATFORM_Reserved_16*/
#define PLATFORM_Reserved_16_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_16_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_16_RSVD_Pos)

/* 0x024C   0x4000_624c
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_17_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_17_TYPE;

