rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_624c PLATFORM_Reserved_17*/
#define PLATFORM_Reserved_17_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_17_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_17_RSVD_Pos)

/* 0x0250   0x4000_6250
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_18_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_18_TYPE;

/*0x4000_6250 PLATFORM_Reserved_18*/
#define PLATFORM_Reserved_18_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_18_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_18_RSVD_Pos)

/* 0x0254   0x4000_6254
    0       W       write_data                                          0
    1       R/W1S   otp                                                 0
    2       R/W1S   parity                                              0
    3       R/W1S   st_err                                              0
    31:4    R       RSVD                                                28'h0
 */
typedef union _PLATFORM_RNGinterrupt_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t write_data: 1;
        uint32_t otp: 1;
        uint32_t parity: 1;
        uint32_t st_err: 1;
        uint32_t RSVD: 28;
    };
} PLATFORM_RNGinterrupt_TYPE;

/*0x4000_6254 PLATFORM_RNGinterrupt*/
#define PLATFORM_RNGinterrupt_write_data_Pos                                                                 0U
#define PLATFORM_RNGinterrupt_write_data_Msk                                                                 (0x1UL << PLATFORM_RNGinterrupt_write_data_Pos)

#define PLATFORM_RNGinterrupt_otp_Pos                                                                        1U
#define PLATFORM_RNGinterrupt_otp_Msk                                                                        (0x1UL << PLATFORM_RNGinterrupt_otp_Pos)

#define PLATFORM_RNGinterrupt_parity_Pos                                                                     2U
#define PLATFORM_RNGinterrupt_parity_Msk                                                                     (0x1UL << PLATFORM_RNGinterrupt_parity_Pos)

#define PLATFORM_RNGinterrupt_st_err_Pos                                                                     3U
#define PLATFORM_RNGinterrupt_st_err_Msk                                                                     (0x1UL << PLATFORM_RNGinterrupt_st_err_Pos)

#define PLATFORM_RNGinterrupt_RSVD_Pos                                                                       4U
#define PLATFORM_RNGinterrupt_RSVD_Msk                                                                       (0xFFFFFFFUL << PLATFORM_RNGinterrupt_RSVD_Pos)

/* 0x0258   0x4000_6258
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_19_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_19_TYPE;

/*0x4000_6258 PLATFORM_Reserved_19*/
#define PLATFORM_Reserved_19_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_19_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_19_RSVD_Pos)

/* 0x025C   0x4000_625c
    31:0    R       RSVD                                                32'h0
 */
typedef union _PLATFORM_Reserved_20_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t RSVD;
    };
} PLATFORM_Reserved_20_TYPE;

/*0x4000_625c PLATFORM_Reserved_20*/
#define PLATFORM_Reserved_20_RSVD_Pos                                                                        0U
#define PLATFORM_Reserved_20_RSVD_Msk                                                                        (0xFFFFFFFFUL << PLATFORM_Reserved_20_RSVD_Pos)

/* 0x0260   0x4000_6260
    15:0    R/W     adap2                                               16'h270
    31:16   R/W     adap1                                               16'h270
 */
typedef union _PLATFORM_RNG_st_thr_err_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t adap2: 16;
        uint32_t adap1: 16;
    };
} PLATFORM_RNG_st_thr_err_TYPE;

/*0x4000_6260 PLATFORM_RNG_st_thr_err*/
#define PLATFORM_RNG_st_thr_err_adap2_Pos                                                                    0U
#define PLATFORM_RNG_st_thr_err_adap2_Msk                                                                    (0xFFFFUL << PLATFORM_RNG_st_thr_err_adap2_Pos)

#define PLATFORM_RNG_st_thr_err_adap1_Pos                                                                    16U
#define PLATFORM_RNG_st_thr_err_adap1_Msk                                                                    (0xFFFFUL << PLATFORM_RNG_st_thr_err_adap1_Pos)

/* 0x0264   0x4000_6264
    0       W       write_data                                          0
    1       R/W     otp                                                 0
    2       R/W     parity                                              0
    3       R/W     st_err                                              0
    31:4    R       RSVD                                                28'h0
 */
typedef union _PLATFORM_RNGinterruptenable_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t write_data: 1;
        uint32_t otp: 1;
        uint32_t parity: 1;
        uint32_t st_err: 1;
        uint32_t RSVD: 28;
    };
} PLATFORM_RNGinterruptenable_TYPE;

/*0x4000_6264 PLATFORM_RNGinterruptenable*/
#define PLATFORM_RNGinterruptenable_write_data_Pos                                                           0U
#define PLATFORM_RNGinterruptenable_write_data_Msk                                                           (0x1UL << PLATFORM_RNGinterruptenable_write_data_Pos)

#define PLATFORM_RNGinterruptenable_otp_Pos                                                                  1U
#define PLATFORM_RNGinterruptenable_otp_Msk                                                                  (0x1UL << PLATFORM_RNGinterruptenable_otp_Pos)

#define PLATFORM_RNGinterruptenable_parity_Pos                                                               2U
#define PLATFORM_RNGinterruptenable_parity_Msk                                                               (0x1UL << PLATFORM_RNGinterruptenable_parity_Pos)

#define PLATFORM_RNGinterruptenable_st_err_Pos                                                               3U
#define PLATFORM_RNGinterruptenable_st_err_Msk                                                               (0x1UL << PLATFORM_RNGinterruptenable_st_err_Pos)

#define PLATFORM_RNGinterruptenable_RSVD_Pos                                                                 4U
#define PLATFORM_RNGinterruptenable_RSVD_Msk                                                                 (0xFFFFFFFUL << PLATFORM_RNGinterruptenable_RSVD_Pos)

/* 0x02cc   0x4000_62cc
    31:0    R/W     spic0_pgm_fifo_init_0                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup0_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_0;
    };
} PLATFORM_SPIC0PGMfifointerrtup0_TYPE;

/*0x4000_62cc PLATFORM_SPIC0PGMfifointerrtup0*/
#define PLATFORM_SPIC0PGMfifointerrtup0_spic0_pgm_fifo_init_0_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup0_spic0_pgm_fifo_init_0_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup0_spic0_pgm_fifo_init_0_Pos)

