rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/* 0x02d0   0x4000_62d0
    31:0    R/W     spic0_pgm_fifo_init_1                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup1_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_1;
    };
} PLATFORM_SPIC0PGMfifointerrtup1_TYPE;

/*0x4000_62d0 PLATFORM_SPIC0PGMfifointerrtup1*/
#define PLATFORM_SPIC0PGMfifointerrtup1_spic0_pgm_fifo_init_1_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup1_spic0_pgm_fifo_init_1_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup1_spic0_pgm_fifo_init_1_Pos)

/* 0x02d4   0x4000_62d4
    31:0    R/W     spic0_pgm_fifo_init_2                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup2_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_2;
    };
} PLATFORM_SPIC0PGMfifointerrtup2_TYPE;

/*0x4000_62d4 PLATFORM_SPIC0PGMfifointerrtup2*/
#define PLATFORM_SPIC0PGMfifointerrtup2_spic0_pgm_fifo_init_2_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup2_spic0_pgm_fifo_init_2_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup2_spic0_pgm_fifo_init_2_Pos)

/* 0x02d8   0x4000_62d8
    31:0    R/W     spic0_pgm_fifo_init_3                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup3_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_3;
    };
} PLATFORM_SPIC0PGMfifointerrtup3_TYPE;

/*0x4000_62d8 PLATFORM_SPIC0PGMfifointerrtup3*/
#define PLATFORM_SPIC0PGMfifointerrtup3_spic0_pgm_fifo_init_3_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup3_spic0_pgm_fifo_init_3_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup3_spic0_pgm_fifo_init_3_Pos)

/* 0x02dc   0x4000_62dc
    31:0    R/W     spic0_pgm_fifo_init_4                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup4_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_4;
    };
} PLATFORM_SPIC0PGMfifointerrtup4_TYPE;

/*0x4000_62dc PLATFORM_SPIC0PGMfifointerrtup4*/
#define PLATFORM_SPIC0PGMfifointerrtup4_spic0_pgm_fifo_init_4_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup4_spic0_pgm_fifo_init_4_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup4_spic0_pgm_fifo_init_4_Pos)

/* 0x02e0   0x4000_62e0
    31:0    R/W     spic0_pgm_fifo_init_5                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup5_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_5;
    };
} PLATFORM_SPIC0PGMfifointerrtup5_TYPE;

/*0x4000_62e0 PLATFORM_SPIC0PGMfifointerrtup5*/
#define PLATFORM_SPIC0PGMfifointerrtup5_spic0_pgm_fifo_init_5_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup5_spic0_pgm_fifo_init_5_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup5_spic0_pgm_fifo_init_5_Pos)

/* 0x02e4   0x4000_62e4
    31:0    R/W     spic0_pgm_fifo_init_6                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup6_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_6;
    };
} PLATFORM_SPIC0PGMfifointerrtup6_TYPE;

/*0x4000_62e4 PLATFORM_SPIC0PGMfifointerrtup6*/
#define PLATFORM_SPIC0PGMfifointerrtup6_spic0_pgm_fifo_init_6_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup6_spic0_pgm_fifo_init_6_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup6_spic0_pgm_fifo_init_6_Pos)

/* 0x02e8   0x4000_62e8
    31:0    R/W     spic0_pgm_fifo_init_7                               32'h0
 */
typedef union _PLATFORM_SPIC0PGMfifointerrtup7_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t spic0_pgm_fifo_init_7;
    };
} PLATFORM_SPIC0PGMfifointerrtup7_TYPE;

/*0x4000_62e8 PLATFORM_SPIC0PGMfifointerrtup7*/
#define PLATFORM_SPIC0PGMfifointerrtup7_spic0_pgm_fifo_init_7_Pos                                            0U
#define PLATFORM_SPIC0PGMfifointerrtup7_spic0_pgm_fifo_init_7_Msk                                            (0xFFFFFFFFUL << PLATFORM_SPIC0PGMfifointerrtup7_spic0_pgm_fifo_init_7_Pos)

/* 0x02ec   0x4000_62ec
    0       R/W1C   r_ENHTIMER_EVNT_ACTIVE_sts                          1'b0
    1       R/W1C   r_ENHTIMER_EVNT_LCH_CNT0_FIFO_FULL_sts              1'b0
    2       R/W1C   r_ENHTIMER_EVNT_LCH_CNT0_FIFO_MET_TH_sts            1'b0
    3       R/W1C   r_ENHTIMER_EVNT_STOP_sts                            1'b0
    4       R/W1C   r_ENHTIMER_EVNT_TIMEOUT_sts                         1'b0
    15:5    R       reserved_1                                          11'h0000
    16      R/W1C   r_ENHTIMER_TASK_DISABLE_sts                         1'b0
    17      R/W1C   r_ENHTIMER_TASK_PAUSE_sts                           1'b0
    18      R/W1C   r_ENHTIMER_TASK_START_sts                           1'b0
    31:19   R       reserved                                            13'h0000
 */
typedef union _PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_ENHTIMER_EVNT_ACTIVE_sts: 1;
        uint32_t r_ENHTIMER_EVNT_LCH_CNT0_FIFO_FULL_sts: 1;
        uint32_t r_ENHTIMER_EVNT_LCH_CNT0_FIFO_MET_TH_sts: 1;
        uint32_t r_ENHTIMER_EVNT_STOP_sts: 1;
        uint32_t r_ENHTIMER_EVNT_TIMEOUT_sts: 1;
        uint32_t reserved_1: 11;
        uint32_t r_ENHTIMER_TASK_DISABLE_sts: 1;
        uint32_t r_ENHTIMER_TASK_PAUSE_sts: 1;
        uint32_t r_ENHTIMER_TASK_START_sts: 1;
        uint32_t reserved: 13;
    };
} PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_TYPE;

/*0x4000_62ec PLATFORM_REG_ENHTIMER_TASK_EVNT_STS*/
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_ACTIVE_sts_Pos                                   0U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_ACTIVE_sts_Msk                                   (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_ACTIVE_sts_Pos)

