rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_LCH_CNT0_FIFO_FULL_sts_Pos                       1U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_LCH_CNT0_FIFO_FULL_sts_Msk                       (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_LCH_CNT0_FIFO_FULL_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_LCH_CNT0_FIFO_MET_TH_sts_Pos                     2U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_LCH_CNT0_FIFO_MET_TH_sts_Msk                     (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_LCH_CNT0_FIFO_MET_TH_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_STOP_sts_Pos                                     3U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_STOP_sts_Msk                                     (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_TIMEOUT_sts_Pos                                  4U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_TIMEOUT_sts_Msk                                  (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_reserved_1_Pos                                                   5U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_reserved_1_Msk                                                   (0x7FFUL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_DISABLE_sts_Pos                                  16U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_DISABLE_sts_Msk                                  (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_PAUSE_sts_Pos                                    17U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_PAUSE_sts_Msk                                    (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_START_sts_Pos                                    18U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_START_sts_Msk                                    (0x1UL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_r_ENHTIMER_TASK_START_sts_Pos)

#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_reserved_Pos                                                     19U
#define PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_reserved_Msk                                                     (0x1FFFUL << PLATFORM_REG_ENHTIMER_TASK_EVNT_STS_reserved_Pos)

/* 0x02f0   0x4000_62f0
    0       R/W1C   r_KEYSCAN_EVNT_MANUAL_DONE_sts                      1'b0
    15:1    R       reserved_1                                          15'h0000
    16      R/W1C   r_KEYSCAN_TASK_MANUAL_sts                           1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_KEYSCAN_EVNT_MANUAL_DONE_sts: 1;
        uint32_t reserved_1: 15;
        uint32_t r_KEYSCAN_TASK_MANUAL_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_TYPE;

/*0x4000_62f0 PLATFORM_REG_KEYSCAN_TASK_EVNT_STS*/
#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_r_KEYSCAN_EVNT_MANUAL_DONE_sts_Pos                                0U
#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_r_KEYSCAN_EVNT_MANUAL_DONE_sts_Msk                                (0x1UL << PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_r_KEYSCAN_EVNT_MANUAL_DONE_sts_Pos)

#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_reserved_1_Pos                                                    1U
#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_reserved_1_Msk                                                    (0x7FFFUL << PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_r_KEYSCAN_TASK_MANUAL_sts_Pos                                     16U
#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_r_KEYSCAN_TASK_MANUAL_sts_Msk                                     (0x1UL << PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_r_KEYSCAN_TASK_MANUAL_sts_Pos)

#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_reserved_Pos                                                      17U
#define PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_reserved_Msk                                                      (0x7FFFUL << PLATFORM_REG_KEYSCAN_TASK_EVNT_STS_reserved_Pos)

/* 0x02f4   0x4000_62f4
    0       R/W1C   r_TIMER1_CH0_EVNT_ACTIVE_sts                        1'b0
    1       R/W1C   r_TIMER1_CH0_EVNT_STOP_sts                          1'b0
    2       R/W1C   r_TIMER1_CH0_EVNT_TIMEOUT_sts                       1'b0
    3       R/W1C   r_TIMER1_CH1_EVNT_ACTIVE_sts                        1'b0
    4       R/W1C   r_TIMER1_CH1_EVNT_STOP_sts                          1'b0
    5       R/W1C   r_TIMER1_CH1_EVNT_TIMEOUT_sts                       1'b0
    6       R/W1C   r_TIMER1_CH2_EVNT_ACTIVE_sts                        1'b0
    7       R/W1C   r_TIMER1_CH2_EVNT_STOP_sts                          1'b0
    8       R/W1C   r_TIMER1_CH2_EVNT_TIMEOUT_sts                       1'b0
    9       R/W1C   r_TIMER1_CH3_EVNT_ACTIVE_sts                        1'b0
    10      R/W1C   r_TIMER1_CH3_EVNT_STOP_sts                          1'b0
    11      R/W1C   r_TIMER1_CH3_EVNT_TIMEOUT_sts                       1'b0
    12      R/W1C   r_TIMER1_CH4_EVNT_ACTIVE_sts                        1'b0
    13      R/W1C   r_TIMER1_CH4_EVNT_STOP_sts                          1'b0
    14      R/W1C   r_TIMER1_CH4_EVNT_TIMEOUT_sts                       1'b0
    15      R/W1C   r_TIMER1_CH5_EVNT_ACTIVE_sts                        1'b0
    16      R/W1C   r_TIMER1_CH5_EVNT_STOP_sts                          1'b0
    17      R/W1C   r_TIMER1_CH5_EVNT_TIMEOUT_sts                       1'b0
    18      R/W1C   r_TIMER1_CH6_EVNT_ACTIVE_sts                        1'b0
    19      R/W1C   r_TIMER1_CH6_EVNT_STOP_sts                          1'b0
    20      R/W1C   r_TIMER1_CH6_EVNT_TIMEOUT_sts                       1'b0
    21      R/W1C   r_TIMER1_CH7_EVNT_ACTIVE_sts                        1'b0
    22      R/W1C   r_TIMER1_CH7_EVNT_STOP_sts                          1'b0
    23      R/W1C   r_TIMER1_CH7_EVNT_TIMEOUT_sts                       1'b0
    24      R/W1C   r_TIMER1_CH8_EVNT_ACTIVE_sts                        1'b0
    25      R/W1C   r_TIMER1_CH8_EVNT_STOP_sts                          1'b0
    26      R/W1C   r_TIMER1_CH8_EVNT_TIMEOUT_sts                       1'b0
    31:27   R       reserved                                            5'h00
 */
typedef union _PLATFORM_REG_TIMER1_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_TIMER1_CH0_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH0_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH0_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH1_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH1_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH1_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH2_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH2_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH2_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH3_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH3_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH3_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH4_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH4_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH4_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH5_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH5_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH5_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH6_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH6_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH6_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH7_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH7_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH7_EVNT_TIMEOUT_sts: 1;
        uint32_t r_TIMER1_CH8_EVNT_ACTIVE_sts: 1;
        uint32_t r_TIMER1_CH8_EVNT_STOP_sts: 1;
        uint32_t r_TIMER1_CH8_EVNT_TIMEOUT_sts: 1;
        uint32_t reserved: 5;
    };
} PLATFORM_REG_TIMER1_EVNT_STS_TYPE;

/*0x4000_62f4 PLATFORM_REG_TIMER1_EVNT_STS*/
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_ACTIVE_sts_Pos                                        0U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_STOP_sts_Pos                                          1U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_TIMEOUT_sts_Pos                                       2U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH0_EVNT_TIMEOUT_sts_Pos)

