rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_ACTIVE_sts_Pos                                        3U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_STOP_sts_Pos                                          4U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_TIMEOUT_sts_Pos                                       5U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH1_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_ACTIVE_sts_Pos                                        6U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_STOP_sts_Pos                                          7U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_TIMEOUT_sts_Pos                                       8U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH2_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_ACTIVE_sts_Pos                                        9U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_STOP_sts_Pos                                          10U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_TIMEOUT_sts_Pos                                       11U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH3_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_ACTIVE_sts_Pos                                        12U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_STOP_sts_Pos                                          13U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_TIMEOUT_sts_Pos                                       14U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH4_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_ACTIVE_sts_Pos                                        15U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_STOP_sts_Pos                                          16U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_TIMEOUT_sts_Pos                                       17U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH5_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_ACTIVE_sts_Pos                                        18U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_STOP_sts_Pos                                          19U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_TIMEOUT_sts_Pos                                       20U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH6_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_ACTIVE_sts_Pos                                        21U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_STOP_sts_Pos                                          22U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_TIMEOUT_sts_Pos                                       23U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH7_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_ACTIVE_sts_Pos                                        24U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_ACTIVE_sts_Msk                                        (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_ACTIVE_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_STOP_sts_Pos                                          25U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_STOP_sts_Msk                                          (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_STOP_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_TIMEOUT_sts_Pos                                       26U
#define PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_TIMEOUT_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_EVNT_STS_r_TIMER1_CH8_EVNT_TIMEOUT_sts_Pos)

#define PLATFORM_REG_TIMER1_EVNT_STS_reserved_Pos                                                            27U
#define PLATFORM_REG_TIMER1_EVNT_STS_reserved_Msk                                                            (0x1FUL << PLATFORM_REG_TIMER1_EVNT_STS_reserved_Pos)

