rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/* 0x02f8   0x4000_62f8
    0       R/W1C   r_TIMER1_CH0_TASK_DISABLE_sts                       1'b0
    1       R/W1C   r_TIMER1_CH0_TASK_PAUSE_sts                         1'b0
    2       R/W1C   r_TIMER1_CH0_TASK_START_sts                         1'b0
    3       R/W1C   r_TIMER1_CH1_TASK_DISABLE_sts                       1'b0
    4       R/W1C   r_TIMER1_CH1_TASK_PAUSE_sts                         1'b0
    5       R/W1C   r_TIMER1_CH1_TASK_START_sts                         1'b0
    6       R/W1C   r_TIMER1_CH2_TASK_DISABLE_sts                       1'b0
    7       R/W1C   r_TIMER1_CH2_TASK_PAUSE_sts                         1'b0
    8       R/W1C   r_TIMER1_CH2_TASK_START_sts                         1'b0
    9       R/W1C   r_TIMER1_CH3_TASK_DISABLE_sts                       1'b0
    10      R/W1C   r_TIMER1_CH3_TASK_PAUSE_sts                         1'b0
    11      R/W1C   r_TIMER1_CH3_TASK_START_sts                         1'b0
    12      R/W1C   r_TIMER1_CH4_TASK_DISABLE_sts                       1'b0
    13      R/W1C   r_TIMER1_CH4_TASK_PAUSE_sts                         1'b0
    14      R/W1C   r_TIMER1_CH4_TASK_START_sts                         1'b0
    15      R/W1C   r_TIMER1_CH5_TASK_DISABLE_sts                       1'b0
    16      R/W1C   r_TIMER1_CH5_TASK_PAUSE_sts                         1'b0
    17      R/W1C   r_TIMER1_CH5_TASK_START_sts                         1'b0
    18      R/W1C   r_TIMER1_CH6_TASK_DISABLE_sts                       1'b0
    19      R/W1C   r_TIMER1_CH6_TASK_PAUSE_sts                         1'b0
    20      R/W1C   r_TIMER1_CH6_TASK_START_sts                         1'b0
    21      R/W1C   r_TIMER1_CH7_TASK_DISABLE_sts                       1'b0
    22      R/W1C   r_TIMER1_CH7_TASK_PAUSE_sts                         1'b0
    23      R/W1C   r_TIMER1_CH7_TASK_START_sts                         1'b0
    24      R/W1C   r_TIMER1_CH8_TASK_DISABLE_sts                       1'b0
    25      R/W1C   r_TIMER1_CH8_TASK_PAUSE_sts                         1'b0
    26      R/W1C   r_TIMER1_CH8_TASK_START_sts                         1'b0
    31:27   R       reserved                                            5'h00
 */
typedef union _PLATFORM_REG_TIMER1_TASK_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_TIMER1_CH0_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH0_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH0_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH1_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH1_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH1_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH2_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH2_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH2_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH3_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH3_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH3_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH4_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH4_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH4_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH5_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH5_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH5_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH6_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH6_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH6_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH7_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH7_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH7_TASK_START_sts: 1;
        uint32_t r_TIMER1_CH8_TASK_DISABLE_sts: 1;
        uint32_t r_TIMER1_CH8_TASK_PAUSE_sts: 1;
        uint32_t r_TIMER1_CH8_TASK_START_sts: 1;
        uint32_t reserved: 5;
    };
} PLATFORM_REG_TIMER1_TASK_STS_TYPE;

/*0x4000_62f8 PLATFORM_REG_TIMER1_TASK_STS*/
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_DISABLE_sts_Pos                                       0U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_PAUSE_sts_Pos                                         1U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_START_sts_Pos                                         2U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH0_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_DISABLE_sts_Pos                                       3U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_PAUSE_sts_Pos                                         4U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_START_sts_Pos                                         5U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH1_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_DISABLE_sts_Pos                                       6U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_PAUSE_sts_Pos                                         7U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_START_sts_Pos                                         8U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH2_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_DISABLE_sts_Pos                                       9U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_DISABLE_sts_Pos)

