rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_PAUSE_sts_Pos                                         10U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_START_sts_Pos                                         11U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH3_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_DISABLE_sts_Pos                                       12U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_PAUSE_sts_Pos                                         13U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_START_sts_Pos                                         14U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH4_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_DISABLE_sts_Pos                                       15U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_PAUSE_sts_Pos                                         16U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_START_sts_Pos                                         17U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH5_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_DISABLE_sts_Pos                                       18U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_PAUSE_sts_Pos                                         19U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_START_sts_Pos                                         20U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH6_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_DISABLE_sts_Pos                                       21U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_PAUSE_sts_Pos                                         22U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_START_sts_Pos                                         23U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH7_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_DISABLE_sts_Pos                                       24U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_DISABLE_sts_Msk                                       (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_DISABLE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_PAUSE_sts_Pos                                         25U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_PAUSE_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_PAUSE_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_START_sts_Pos                                         26U
#define PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_TIMER1_TASK_STS_r_TIMER1_CH8_TASK_START_sts_Pos)

#define PLATFORM_REG_TIMER1_TASK_STS_reserved_Pos                                                            27U
#define PLATFORM_REG_TIMER1_TASK_STS_reserved_Msk                                                            (0x1FUL << PLATFORM_REG_TIMER1_TASK_STS_reserved_Pos)

/* 0x02fc   0x4000_62fc
    0       R/W1C   r_GPIO0_0_EVNT_IN_sts                               1'b0
    1       R/W1C   r_GPIO0_1_EVNT_IN_sts                               1'b0
    2       R/W1C   r_GPIO0_2_EVNT_IN_sts                               1'b0
    3       R/W1C   r_GPIO0_3_EVNT_IN_sts                               1'b0
    4       R/W1C   r_GPIO0_4_EVNT_IN_sts                               1'b0
    5       R/W1C   r_GPIO0_5_EVNT_IN_sts                               1'b0
    6       R/W1C   r_GPIO0_6_EVNT_IN_sts                               1'b0
    7       R/W1C   r_GPIO0_7_EVNT_IN_sts                               1'b0
    8       R/W1C   r_GPIO0_8_EVNT_IN_sts                               1'b0
    9       R/W1C   r_GPIO0_9_EVNT_IN_sts                               1'b0
    10      R/W1C   r_GPIO0_10_EVNT_IN_sts                              1'b0
    11      R/W1C   r_GPIO0_11_EVNT_IN_sts                              1'b0
    12      R/W1C   r_GPIO0_12_EVNT_IN_sts                              1'b0
    13      R/W1C   r_GPIO0_13_EVNT_IN_sts                              1'b0
    14      R/W1C   r_GPIO0_14_EVNT_IN_sts                              1'b0
    15      R/W1C   r_GPIO0_15_EVNT_IN_sts                              1'b0
    16      R/W1C   r_GPIO0_16_EVNT_IN_sts                              1'b0
    17      R/W1C   r_GPIO0_17_EVNT_IN_sts                              1'b0
    18      R/W1C   r_GPIO0_18_EVNT_IN_sts                              1'b0
    19      R/W1C   r_GPIO0_19_EVNT_IN_sts                              1'b0
    20      R/W1C   r_GPIO0_20_EVNT_IN_sts                              1'b0
    21      R/W1C   r_GPIO0_21_EVNT_IN_sts                              1'b0
    22      R/W1C   r_GPIO0_22_EVNT_IN_sts                              1'b0
    23      R/W1C   r_GPIO0_23_EVNT_IN_sts                              1'b0
    24      R/W1C   r_GPIO0_24_EVNT_IN_sts                              1'b0
    25      R/W1C   r_GPIO0_25_EVNT_IN_sts                              1'b0
    26      R/W1C   r_GPIO0_26_EVNT_IN_sts                              1'b0
    27      R/W1C   r_GPIO0_27_EVNT_IN_sts                              1'b0
    28      R/W1C   r_GPIO0_28_EVNT_IN_sts                              1'b0
    29      R/W1C   r_GPIO0_29_EVNT_IN_sts                              1'b0
    30      R/W1C   r_GPIO0_30_EVNT_IN_sts                              1'b0
    31      R/W1C   r_GPIO0_31_EVNT_IN_sts                              1'b0
 */
typedef union _PLATFORM_REG_GPIO_0_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_GPIO0_0_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_1_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_2_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_3_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_4_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_5_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_6_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_7_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_8_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_9_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_10_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_11_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_12_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_13_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_14_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_15_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_16_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_17_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_18_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_19_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_20_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_21_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_22_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_23_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_24_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_25_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_26_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_27_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_28_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_29_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_30_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_31_EVNT_IN_sts: 1;
    };
} PLATFORM_REG_GPIO_0_EVNT_STS_TYPE;

/*0x4000_62fc PLATFORM_REG_GPIO_0_EVNT_STS*/
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_0_EVNT_IN_sts_Pos                                               0U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_0_EVNT_IN_sts_Msk                                               (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_0_EVNT_IN_sts_Pos)

