rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_25_EVNT_IN_sts_Pos                                              25U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_25_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_25_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_26_EVNT_IN_sts_Pos                                              26U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_26_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_26_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_27_EVNT_IN_sts_Pos                                              27U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_27_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_27_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_28_EVNT_IN_sts_Pos                                              28U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_28_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_28_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_29_EVNT_IN_sts_Pos                                              29U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_29_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_29_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_30_EVNT_IN_sts_Pos                                              30U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_30_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_30_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_31_EVNT_IN_sts_Pos                                              31U
#define PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_31_EVNT_IN_sts_Msk                                              (0x1UL << PLATFORM_REG_GPIO_0_EVNT_STS_r_GPIO0_31_EVNT_IN_sts_Pos)

/* 0x0300   0x4000_6300
    0       R/W1C   r_GPIO0_32_EVNT_IN_sts                              1'b0
    1       R/W1C   r_GPIO0_33_EVNT_IN_sts                              1'b0
    2       R/W1C   r_GPIO0_34_EVNT_IN_sts                              1'b0
    3       R/W1C   r_GPIO0_35_EVNT_IN_sts                              1'b0
    4       R/W1C   r_GPIO0_36_EVNT_IN_sts                              1'b0
    5       R/W1C   r_GPIO0_37_EVNT_IN_sts                              1'b0
    6       R/W1C   r_GPIO0_38_EVNT_IN_sts                              1'b0
    7       R/W1C   r_GPIO0_39_EVNT_IN_sts                              1'b0
    8       R/W1C   r_GPIO0_40_EVNT_IN_sts                              1'b0
    9       R/W1C   r_GPIO0_41_EVNT_IN_sts                              1'b0
    10      R/W1C   r_GPIO0_42_EVNT_IN_sts                              1'b0
    11      R/W1C   r_GPIO0_43_EVNT_IN_sts                              1'b0
    12      R/W1C   r_GPIO0_44_EVNT_IN_sts                              1'b0
    13      R/W1C   r_GPIO0_45_EVNT_IN_sts                              1'b0
    14      R/W1C   r_GPIO0_46_EVNT_IN_sts                              1'b0
    15      R/W1C   r_GPIO0_47_EVNT_IN_sts                              1'b0
    16      R/W1C   r_GPIO0_48_EVNT_IN_sts                              1'b0
    17      R/W1C   r_GPIO0_49_EVNT_IN_sts                              1'b0
    31:18   R       reserved                                            14'h0000
 */
typedef union _PLATFORM_REG_GPIO_1_EVENT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_GPIO0_32_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_33_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_34_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_35_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_36_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_37_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_38_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_39_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_40_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_41_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_42_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_43_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_44_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_45_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_46_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_47_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_48_EVNT_IN_sts: 1;
        uint32_t r_GPIO0_49_EVNT_IN_sts: 1;
        uint32_t reserved: 14;
    };
} PLATFORM_REG_GPIO_1_EVENT_STS_TYPE;

/*0x4000_6300 PLATFORM_REG_GPIO_1_EVENT_STS*/
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_32_EVNT_IN_sts_Pos                                             0U
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_32_EVNT_IN_sts_Msk                                             (0x1UL << PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_32_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_33_EVNT_IN_sts_Pos                                             1U
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_33_EVNT_IN_sts_Msk                                             (0x1UL << PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_33_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_34_EVNT_IN_sts_Pos                                             2U
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_34_EVNT_IN_sts_Msk                                             (0x1UL << PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_34_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_35_EVNT_IN_sts_Pos                                             3U
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_35_EVNT_IN_sts_Msk                                             (0x1UL << PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_35_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_36_EVNT_IN_sts_Pos                                             4U
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_36_EVNT_IN_sts_Msk                                             (0x1UL << PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_36_EVNT_IN_sts_Pos)

#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_37_EVNT_IN_sts_Pos                                             5U
#define PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_37_EVNT_IN_sts_Msk                                             (0x1UL << PLATFORM_REG_GPIO_1_EVENT_STS_r_GPIO0_37_EVNT_IN_sts_Pos)

