rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_1_TASK_DRCLR_sts_Pos                                      1U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_1_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_1_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_2_TASK_DRCLR_sts_Pos                                      2U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_2_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_2_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_3_TASK_DRCLR_sts_Pos                                      3U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_3_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_3_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_4_TASK_DRCLR_sts_Pos                                      4U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_4_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_4_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_5_TASK_DRCLR_sts_Pos                                      5U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_5_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_5_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_6_TASK_DRCLR_sts_Pos                                      6U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_6_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_6_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_7_TASK_DRCLR_sts_Pos                                      7U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_7_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_7_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_8_TASK_DRCLR_sts_Pos                                      8U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_8_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_8_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_9_TASK_DRCLR_sts_Pos                                      9U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_9_TASK_DRCLR_sts_Msk                                      (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_9_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_10_TASK_DRCLR_sts_Pos                                     10U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_10_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_10_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_11_TASK_DRCLR_sts_Pos                                     11U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_11_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_11_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_12_TASK_DRCLR_sts_Pos                                     12U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_12_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_12_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_13_TASK_DRCLR_sts_Pos                                     13U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_13_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_13_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_14_TASK_DRCLR_sts_Pos                                     14U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_14_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_14_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_15_TASK_DRCLR_sts_Pos                                     15U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_15_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_15_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_16_TASK_DRCLR_sts_Pos                                     16U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_16_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_16_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_17_TASK_DRCLR_sts_Pos                                     17U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_17_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_17_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_18_TASK_DRCLR_sts_Pos                                     18U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_18_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_18_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_19_TASK_DRCLR_sts_Pos                                     19U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_19_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_19_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_20_TASK_DRCLR_sts_Pos                                     20U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_20_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_20_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_21_TASK_DRCLR_sts_Pos                                     21U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_21_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_21_TASK_DRCLR_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_22_TASK_DRCLR_sts_Pos                                     22U
#define PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_22_TASK_DRCLR_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRCLR_STS_r_GPIO0_22_TASK_DRCLR_sts_Pos)

