rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_27_TASK_DRSET_sts_Pos                                     27U
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_27_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_27_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_28_TASK_DRSET_sts_Pos                                     28U
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_28_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_28_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_29_TASK_DRSET_sts_Pos                                     29U
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_29_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_29_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_30_TASK_DRSET_sts_Pos                                     30U
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_30_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_30_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_31_TASK_DRSET_sts_Pos                                     31U
#define PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_31_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRSET_STS_r_GPIO0_31_TASK_DRSET_sts_Pos)

/* 0x0320   0x4000_6320
    0       R/W1C   r_GPIO0_32_TASK_DRSET_sts                           1'b0
    1       R/W1C   r_GPIO0_33_TASK_DRSET_sts                           1'b0
    2       R/W1C   r_GPIO0_34_TASK_DRSET_sts                           1'b0
    3       R/W1C   r_GPIO0_35_TASK_DRSET_sts                           1'b0
    4       R/W1C   r_GPIO0_36_TASK_DRSET_sts                           1'b0
    5       R/W1C   r_GPIO0_37_TASK_DRSET_sts                           1'b0
    6       R/W1C   r_GPIO0_38_TASK_DRSET_sts                           1'b0
    7       R/W1C   r_GPIO0_39_TASK_DRSET_sts                           1'b0
    8       R/W1C   r_GPIO0_40_TASK_DRSET_sts                           1'b0
    9       R/W1C   r_GPIO0_41_TASK_DRSET_sts                           1'b0
    10      R/W1C   r_GPIO0_42_TASK_DRSET_sts                           1'b0
    11      R/W1C   r_GPIO0_43_TASK_DRSET_sts                           1'b0
    12      R/W1C   r_GPIO0_44_TASK_DRSET_sts                           1'b0
    13      R/W1C   r_GPIO0_45_TASK_DRSET_sts                           1'b0
    14      R/W1C   r_GPIO0_46_TASK_DRSET_sts                           1'b0
    15      R/W1C   r_GPIO0_47_TASK_DRSET_sts                           1'b0
    16      R/W1C   r_GPIO0_48_TASK_DRSET_sts                           1'b0
    17      R/W1C   r_GPIO0_49_TASK_DRSET_sts                           1'b0
    31:18   R       reserved                                            14'h0000
 */
typedef union _PLATFORM_REG_GPIO_1_TASK_DRSET_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_GPIO0_32_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_33_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_34_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_35_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_36_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_37_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_38_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_39_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_40_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_41_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_42_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_43_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_44_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_45_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_46_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_47_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_48_TASK_DRSET_sts: 1;
        uint32_t r_GPIO0_49_TASK_DRSET_sts: 1;
        uint32_t reserved: 14;
    };
} PLATFORM_REG_GPIO_1_TASK_DRSET_STS_TYPE;

/*0x4000_6320 PLATFORM_REG_GPIO_1_TASK_DRSET_STS*/
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_32_TASK_DRSET_sts_Pos                                     0U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_32_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_32_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_33_TASK_DRSET_sts_Pos                                     1U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_33_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_33_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_34_TASK_DRSET_sts_Pos                                     2U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_34_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_34_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_35_TASK_DRSET_sts_Pos                                     3U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_35_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_35_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_36_TASK_DRSET_sts_Pos                                     4U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_36_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_36_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_37_TASK_DRSET_sts_Pos                                     5U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_37_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_37_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_38_TASK_DRSET_sts_Pos                                     6U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_38_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_38_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_39_TASK_DRSET_sts_Pos                                     7U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_39_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_39_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_40_TASK_DRSET_sts_Pos                                     8U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_40_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_40_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_41_TASK_DRSET_sts_Pos                                     9U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_41_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_41_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_42_TASK_DRSET_sts_Pos                                     10U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_42_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_42_TASK_DRSET_sts_Pos)

