rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_43_TASK_DRSET_sts_Pos                                     11U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_43_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_43_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_44_TASK_DRSET_sts_Pos                                     12U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_44_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_44_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_45_TASK_DRSET_sts_Pos                                     13U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_45_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_45_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_46_TASK_DRSET_sts_Pos                                     14U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_46_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_46_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_47_TASK_DRSET_sts_Pos                                     15U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_47_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_47_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_48_TASK_DRSET_sts_Pos                                     16U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_48_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_48_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_49_TASK_DRSET_sts_Pos                                     17U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_49_TASK_DRSET_sts_Msk                                     (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_r_GPIO0_49_TASK_DRSET_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_reserved_Pos                                                      18U
#define PLATFORM_REG_GPIO_1_TASK_DRSET_STS_reserved_Msk                                                      (0x3FFFUL << PLATFORM_REG_GPIO_1_TASK_DRSET_STS_reserved_Pos)

/* 0x0324   0x4000_6324
    0       R/W1C   r_GPIO0_0_TASK_DRTOGGLE_sts                         1'b0
    1       R/W1C   r_GPIO0_1_TASK_DRTOGGLE_sts                         1'b0
    2       R/W1C   r_GPIO0_2_TASK_DRTOGGLE_sts                         1'b0
    3       R/W1C   r_GPIO0_3_TASK_DRTOGGLE_sts                         1'b0
    4       R/W1C   r_GPIO0_4_TASK_DRTOGGLE_sts                         1'b0
    5       R/W1C   r_GPIO0_5_TASK_DRTOGGLE_sts                         1'b0
    6       R/W1C   r_GPIO0_6_TASK_DRTOGGLE_sts                         1'b0
    7       R/W1C   r_GPIO0_7_TASK_DRTOGGLE_sts                         1'b0
    8       R/W1C   r_GPIO0_8_TASK_DRTOGGLE_sts                         1'b0
    9       R/W1C   r_GPIO0_9_TASK_DRTOGGLE_sts                         1'b0
    10      R/W1C   r_GPIO0_10_TASK_DRTOGGLE_sts                        1'b0
    11      R/W1C   r_GPIO0_11_TASK_DRTOGGLE_sts                        1'b0
    12      R/W1C   r_GPIO0_12_TASK_DRTOGGLE_sts                        1'b0
    13      R/W1C   r_GPIO0_13_TASK_DRTOGGLE_sts                        1'b0
    14      R/W1C   r_GPIO0_14_TASK_DRTOGGLE_sts                        1'b0
    15      R/W1C   r_GPIO0_15_TASK_DRTOGGLE_sts                        1'b0
    16      R/W1C   r_GPIO0_16_TASK_DRTOGGLE_sts                        1'b0
    17      R/W1C   r_GPIO0_17_TASK_DRTOGGLE_sts                        1'b0
    18      R/W1C   r_GPIO0_18_TASK_DRTOGGLE_sts                        1'b0
    19      R/W1C   r_GPIO0_19_TASK_DRTOGGLE_sts                        1'b0
    20      R/W1C   r_GPIO0_20_TASK_DRTOGGLE_sts                        1'b0
    21      R/W1C   r_GPIO0_21_TASK_DRTOGGLE_sts                        1'b0
    22      R/W1C   r_GPIO0_22_TASK_DRTOGGLE_sts                        1'b0
    23      R/W1C   r_GPIO0_23_TASK_DRTOGGLE_sts                        1'b0
    24      R/W1C   r_GPIO0_24_TASK_DRTOGGLE_sts                        1'b0
    25      R/W1C   r_GPIO0_25_TASK_DRTOGGLE_sts                        1'b0
    26      R/W1C   r_GPIO0_26_TASK_DRTOGGLE_sts                        1'b0
    27      R/W1C   r_GPIO0_27_TASK_DRTOGGLE_sts                        1'b0
    28      R/W1C   r_GPIO0_28_TASK_DRTOGGLE_sts                        1'b0
    29      R/W1C   r_GPIO0_29_TASK_DRTOGGLE_sts                        1'b0
    30      R/W1C   r_GPIO0_30_TASK_DRTOGGLE_sts                        1'b0
    31      R/W1C   r_GPIO0_31_TASK_DRTOGGLE_sts                        1'b0
 */
typedef union _PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_GPIO0_0_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_1_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_2_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_3_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_4_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_5_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_6_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_7_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_8_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_9_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_10_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_11_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_12_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_13_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_14_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_15_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_16_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_17_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_18_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_19_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_20_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_21_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_22_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_23_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_24_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_25_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_26_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_27_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_28_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_29_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_30_TASK_DRTOGGLE_sts: 1;
        uint32_t r_GPIO0_31_TASK_DRTOGGLE_sts: 1;
    };
} PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_TYPE;

/*0x4000_6324 PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS*/
#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_0_TASK_DRTOGGLE_sts_Pos                                0U
#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_0_TASK_DRTOGGLE_sts_Msk                                (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_0_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_1_TASK_DRTOGGLE_sts_Pos                                1U
#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_1_TASK_DRTOGGLE_sts_Msk                                (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_1_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_2_TASK_DRTOGGLE_sts_Pos                                2U
#define PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_2_TASK_DRTOGGLE_sts_Msk                                (0x1UL << PLATFORM_REG_GPIO_0_TASK_DRTOGGLE_STS_r_GPIO0_2_TASK_DRTOGGLE_sts_Pos)

