rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_35_TASK_DRTOGGLE_sts_Pos                               3U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_35_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_35_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_36_TASK_DRTOGGLE_sts_Pos                               4U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_36_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_36_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_37_TASK_DRTOGGLE_sts_Pos                               5U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_37_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_37_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_38_TASK_DRTOGGLE_sts_Pos                               6U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_38_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_38_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_39_TASK_DRTOGGLE_sts_Pos                               7U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_39_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_39_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_40_TASK_DRTOGGLE_sts_Pos                               8U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_40_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_40_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_41_TASK_DRTOGGLE_sts_Pos                               9U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_41_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_41_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_42_TASK_DRTOGGLE_sts_Pos                               10U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_42_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_42_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_43_TASK_DRTOGGLE_sts_Pos                               11U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_43_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_43_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_44_TASK_DRTOGGLE_sts_Pos                               12U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_44_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_44_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_45_TASK_DRTOGGLE_sts_Pos                               13U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_45_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_45_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_46_TASK_DRTOGGLE_sts_Pos                               14U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_46_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_46_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_47_TASK_DRTOGGLE_sts_Pos                               15U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_47_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_47_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_48_TASK_DRTOGGLE_sts_Pos                               16U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_48_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_48_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_49_TASK_DRTOGGLE_sts_Pos                               17U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_49_TASK_DRTOGGLE_sts_Msk                               (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_49_TASK_DRTOGGLE_sts_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_reserved_Pos                                                   18U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_reserved_Msk                                                   (0x1FFFUL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_reserved_Pos)

#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_TASK_NOP_sts_Pos                                       31U
#define PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_TASK_NOP_sts_Msk                                       (0x1UL << PLATFORM_REG_GPIO_1_TASK_DRTOGGLE_STS_r_GPIO0_TASK_NOP_sts_Pos)

/* 0x0344   0x4000_6344
    0       R/W1C   r_GIRDA_EVNT_TXDONE_sts                             1'b0
    1       R/W1C   r_GIRDA_EVNT_RXDONE_sts                             1'b0
    15:2    R       reserved_1                                          14'h0000
    16      R/W1C   r_GIRDA_TASK_START_TX_sts                           1'b0
    17      R/W1C   r_GIRDA_TASK_START_RX_sts                           1'b0
    31:18   R       reserved                                            14'h0000
 */
typedef union _PLATFORM_REG_GIRDA_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_GIRDA_EVNT_TXDONE_sts: 1;
        uint32_t r_GIRDA_EVNT_RXDONE_sts: 1;
        uint32_t reserved_1: 14;
        uint32_t r_GIRDA_TASK_START_TX_sts: 1;
        uint32_t r_GIRDA_TASK_START_RX_sts: 1;
        uint32_t reserved: 14;
    };
} PLATFORM_REG_GIRDA_TASK_EVNT_STS_TYPE;

