rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
/*0x4000_6344 PLATFORM_REG_GIRDA_TASK_EVNT_STS*/
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_EVNT_TXDONE_sts_Pos                                         0U
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_EVNT_TXDONE_sts_Msk                                         (0x1UL << PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_EVNT_TXDONE_sts_Pos)

#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_EVNT_RXDONE_sts_Pos                                         1U
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_EVNT_RXDONE_sts_Msk                                         (0x1UL << PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_EVNT_RXDONE_sts_Pos)

#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_reserved_1_Pos                                                      2U
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_reserved_1_Msk                                                      (0x3FFFUL << PLATFORM_REG_GIRDA_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_TASK_START_TX_sts_Pos                                       16U
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_TASK_START_TX_sts_Msk                                       (0x1UL << PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_TASK_START_TX_sts_Pos)

#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_TASK_START_RX_sts_Pos                                       17U
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_TASK_START_RX_sts_Msk                                       (0x1UL << PLATFORM_REG_GIRDA_TASK_EVNT_STS_r_GIRDA_TASK_START_RX_sts_Pos)

#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_reserved_Pos                                                        18U
#define PLATFORM_REG_GIRDA_TASK_EVNT_STS_reserved_Msk                                                        (0x3FFFUL << PLATFORM_REG_GIRDA_TASK_EVNT_STS_reserved_Pos)

/* 0x0348   0x4000_6348
    0       R/W1C   r_I2C0_EVNT_ERROR_sts                               1'b0
    1       R/W1C   r_I2C0_EVNT_STARTED_sts                             1'b0
    2       R/W1C   r_I2C0_EVNT_STOPPED_sts                             1'b0
    15:3    R       reserved_1                                          13'h0000
    16      R/W1C   r_I2C0_TASK_START_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_I2C0_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_I2C0_EVNT_ERROR_sts: 1;
        uint32_t r_I2C0_EVNT_STARTED_sts: 1;
        uint32_t r_I2C0_EVNT_STOPPED_sts: 1;
        uint32_t reserved_1: 13;
        uint32_t r_I2C0_TASK_START_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_I2C0_TASK_EVNT_STS_TYPE;

/*0x4000_6348 PLATFORM_REG_I2C0_TASK_EVNT_STS*/
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_ERROR_sts_Pos                                            0U
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_ERROR_sts_Msk                                            (0x1UL << PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_ERROR_sts_Pos)

#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_STARTED_sts_Pos                                          1U
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_STARTED_sts_Msk                                          (0x1UL << PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_STARTED_sts_Pos)

#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_STOPPED_sts_Pos                                          2U
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_STOPPED_sts_Msk                                          (0x1UL << PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_EVNT_STOPPED_sts_Pos)

#define PLATFORM_REG_I2C0_TASK_EVNT_STS_reserved_1_Pos                                                       3U
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_reserved_1_Msk                                                       (0x1FFFUL << PLATFORM_REG_I2C0_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_TASK_START_sts_Pos                                            16U
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_TASK_START_sts_Msk                                            (0x1UL << PLATFORM_REG_I2C0_TASK_EVNT_STS_r_I2C0_TASK_START_sts_Pos)

#define PLATFORM_REG_I2C0_TASK_EVNT_STS_reserved_Pos                                                         17U
#define PLATFORM_REG_I2C0_TASK_EVNT_STS_reserved_Msk                                                         (0x7FFFUL << PLATFORM_REG_I2C0_TASK_EVNT_STS_reserved_Pos)

/* 0x034c   0x4000_634c
    0       R/W1C   r_I2C1_EVNT_ERROR_sts                               1'b0
    1       R/W1C   r_I2C1_EVNT_STARTED_sts                             1'b0
    2       R/W1C   r_I2C1_EVNT_STOPPED_sts                             1'b0
    15:3    R       reserved_1                                          13'h0000
    16      R/W1C   r_I2C1_TASK_START_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_I2C1_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_I2C1_EVNT_ERROR_sts: 1;
        uint32_t r_I2C1_EVNT_STARTED_sts: 1;
        uint32_t r_I2C1_EVNT_STOPPED_sts: 1;
        uint32_t reserved_1: 13;
        uint32_t r_I2C1_TASK_START_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_I2C1_TASK_EVNT_STS_TYPE;

/*0x4000_634c PLATFORM_REG_I2C1_TASK_EVNT_STS*/
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_ERROR_sts_Pos                                            0U
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_ERROR_sts_Msk                                            (0x1UL << PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_ERROR_sts_Pos)

#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_STARTED_sts_Pos                                          1U
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_STARTED_sts_Msk                                          (0x1UL << PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_STARTED_sts_Pos)

#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_STOPPED_sts_Pos                                          2U
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_STOPPED_sts_Msk                                          (0x1UL << PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_EVNT_STOPPED_sts_Pos)

