rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_reserved_1_Pos                                                       3U
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_reserved_1_Msk                                                       (0x1FFFUL << PLATFORM_REG_I2C1_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_TASK_START_sts_Pos                                            16U
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_TASK_START_sts_Msk                                            (0x1UL << PLATFORM_REG_I2C1_TASK_EVNT_STS_r_I2C1_TASK_START_sts_Pos)

#define PLATFORM_REG_I2C1_TASK_EVNT_STS_reserved_Pos                                                         17U
#define PLATFORM_REG_I2C1_TASK_EVNT_STS_reserved_Msk                                                         (0x7FFFUL << PLATFORM_REG_I2C1_TASK_EVNT_STS_reserved_Pos)

/* 0x0350   0x4000_6350
    0       R/W1C   r_AUXADC_EVNT_DONE_sts                              1'b0
    15:1    R       reserved_1                                          15'h0000
    16      R/W1C   r_AUXADC_TASK_ONE_SHOT_SAMPLE_sts                   1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_AUXADC_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_AUXADC_EVNT_DONE_sts: 1;
        uint32_t reserved_1: 15;
        uint32_t r_AUXADC_TASK_ONE_SHOT_SAMPLE_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_AUXADC_TASK_EVNT_STS_TYPE;

/*0x4000_6350 PLATFORM_REG_AUXADC_TASK_EVNT_STS*/
#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_r_AUXADC_EVNT_DONE_sts_Pos                                         0U
#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_r_AUXADC_EVNT_DONE_sts_Msk                                         (0x1UL << PLATFORM_REG_AUXADC_TASK_EVNT_STS_r_AUXADC_EVNT_DONE_sts_Pos)

#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_reserved_1_Pos                                                     1U
#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_reserved_1_Msk                                                     (0x7FFFUL << PLATFORM_REG_AUXADC_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_r_AUXADC_TASK_ONE_SHOT_SAMPLE_sts_Pos                              16U
#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_r_AUXADC_TASK_ONE_SHOT_SAMPLE_sts_Msk                              (0x1UL << PLATFORM_REG_AUXADC_TASK_EVNT_STS_r_AUXADC_TASK_ONE_SHOT_SAMPLE_sts_Pos)

#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_reserved_Pos                                                       17U
#define PLATFORM_REG_AUXADC_TASK_EVNT_STS_reserved_Msk                                                       (0x7FFFUL << PLATFORM_REG_AUXADC_TASK_EVNT_STS_reserved_Pos)

/* 0x0354   0x4000_6354
    0       R/W1C   r_SPI3W_EVNT_END_sts                                1'b0
    15:1    R       reserved_1                                          15'h0000
    16      R/W1C   r_SPI3W_TASK_START_sts                              1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_SPI3W_EVNT_END_sts: 1;
        uint32_t reserved_1: 15;
        uint32_t r_SPI3W_TASK_START_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_TYPE;

/*0x4000_6354 PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS*/
#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_r_SPI3W_EVNT_END_sts_Pos                                         0U
#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_r_SPI3W_EVNT_END_sts_Msk                                         (0x1UL << PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_r_SPI3W_EVNT_END_sts_Pos)

#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_reserved_1_Pos                                                   1U
#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_reserved_1_Msk                                                   (0x7FFFUL << PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_r_SPI3W_TASK_START_sts_Pos                                       16U
#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_r_SPI3W_TASK_START_sts_Msk                                       (0x1UL << PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_r_SPI3W_TASK_START_sts_Pos)

#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_reserved_Pos                                                     17U
#define PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_reserved_Msk                                                     (0x7FFFUL << PLATFORM_REG_SPI3WIRE_TASK_EVNT_STS_reserved_Pos)

/* 0x0358   0x4000_6358
    0       R/W1C   r_SPI0_EVNT_START_sts                               1'b0
    1       R/W1C   r_SPI0_EVNT_END_sts                                 1'b0
    15:2    R       reserved_1                                          14'h0000
    16      R/W1C   r_SPI0_TASK_START_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_SPI0_EVNT_START_sts: 1;
        uint32_t r_SPI0_EVNT_END_sts: 1;
        uint32_t reserved_1: 14;
        uint32_t r_SPI0_TASK_START_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_TYPE;

/*0x4000_6358 PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS*/
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_EVNT_START_sts_Pos                                        0U
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_EVNT_START_sts_Msk                                        (0x1UL << PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_EVNT_START_sts_Pos)

#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_EVNT_END_sts_Pos                                          1U
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_EVNT_END_sts_Msk                                          (0x1UL << PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_EVNT_END_sts_Pos)

#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_reserved_1_Pos                                                   2U
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_reserved_1_Msk                                                   (0x3FFFUL << PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_TASK_START_sts_Pos                                        16U
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_TASK_START_sts_Msk                                        (0x1UL << PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_r_SPI0_TASK_START_sts_Pos)

#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_reserved_Pos                                                     17U
#define PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_reserved_Msk                                                     (0x7FFFUL << PLATFORM_REG_SPI0DUAL_TASK_EVNT_STS_reserved_Pos)

/* 0x035c   0x4000_635c
    0       R/W1C   r_SPI1_EVNT_START_sts                               1'b0
    1       R/W1C   r_SPI1_EVNT_END_sts                                 1'b0
    15:2    R       reserved_1                                          14'h0000
    16      R/W1C   r_SPI1_TASK_START_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_SPI1MST_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_SPI1_EVNT_START_sts: 1;
        uint32_t r_SPI1_EVNT_END_sts: 1;
        uint32_t reserved_1: 14;
        uint32_t r_SPI1_TASK_START_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_SPI1MST_TASK_EVNT_STS_TYPE;

/*0x4000_635c PLATFORM_REG_SPI1MST_TASK_EVNT_STS*/
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_EVNT_START_sts_Pos                                         0U
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_EVNT_START_sts_Msk                                         (0x1UL << PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_EVNT_START_sts_Pos)

#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_EVNT_END_sts_Pos                                           1U
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_EVNT_END_sts_Msk                                           (0x1UL << PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_EVNT_END_sts_Pos)

