rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_reserved_1_Pos                                                    2U
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_reserved_1_Msk                                                    (0x3FFFUL << PLATFORM_REG_SPI1MST_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_TASK_START_sts_Pos                                         16U
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_TASK_START_sts_Msk                                         (0x1UL << PLATFORM_REG_SPI1MST_TASK_EVNT_STS_r_SPI1_TASK_START_sts_Pos)

#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_reserved_Pos                                                      17U
#define PLATFORM_REG_SPI1MST_TASK_EVNT_STS_reserved_Msk                                                      (0x7FFFUL << PLATFORM_REG_SPI1MST_TASK_EVNT_STS_reserved_Pos)

/* 0x0364   0x4000_6364
    0       R/W1C   r_METER_EVNT_DATARDY_sts                            1'b0
    1       R/W1C   r_METER_EVNT_ABS_COMP0_sts                          1'b0
    2       R/W1C   r_METER_EVNT_ABS_COMP1_sts                          1'b0
    3       R/W1C   r_METER_EVNT_ABS_COMP2_sts                          1'b0
    4       R/W1C   r_METER_EVNT_ABS_COMP3_sts                          1'b0
    5       R/W1C   r_METER_EVNT_REL_COMP0_sts                          1'b0
    6       R/W1C   r_METER_EVNT_REL_COMP1_sts                          1'b0
    7       R/W1C   r_METER_EVNT_REL_COMP2_sts                          1'b0
    8       R/W1C   r_METER_EVNT_REL_COMP3_sts                          1'b0
    9       R/W1C   r_METER_EVNT_FW_REL_COMP_sts                        1'b0
    15:10   R       reserved_1                                          6'h0
    16      R/W1C   r_METER_TASK_ONE_SHOT_sts                           1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_TMETER_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_METER_EVNT_DATARDY_sts: 1;
        uint32_t r_METER_EVNT_ABS_COMP0_sts: 1;
        uint32_t r_METER_EVNT_ABS_COMP1_sts: 1;
        uint32_t r_METER_EVNT_ABS_COMP2_sts: 1;
        uint32_t r_METER_EVNT_ABS_COMP3_sts: 1;
        uint32_t r_METER_EVNT_REL_COMP0_sts: 1;
        uint32_t r_METER_EVNT_REL_COMP1_sts: 1;
        uint32_t r_METER_EVNT_REL_COMP2_sts: 1;
        uint32_t r_METER_EVNT_REL_COMP3_sts: 1;
        uint32_t r_METER_EVNT_FW_REL_COMP_sts: 1;
        uint32_t reserved_1: 6;
        uint32_t r_METER_TASK_ONE_SHOT_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_TMETER_TASK_EVNT_STS_TYPE;

/*0x4000_6364 PLATFORM_REG_TMETER_TASK_EVNT_STS*/
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_DATARDY_sts_Pos                                       0U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_DATARDY_sts_Msk                                       (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_DATARDY_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP0_sts_Pos                                     1U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP0_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP0_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP1_sts_Pos                                     2U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP1_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP1_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP2_sts_Pos                                     3U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP2_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP2_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP3_sts_Pos                                     4U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP3_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_ABS_COMP3_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP0_sts_Pos                                     5U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP0_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP0_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP1_sts_Pos                                     6U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP1_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP1_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP2_sts_Pos                                     7U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP2_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP2_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP3_sts_Pos                                     8U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP3_sts_Msk                                     (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_REL_COMP3_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_FW_REL_COMP_sts_Pos                                   9U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_FW_REL_COMP_sts_Msk                                   (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_EVNT_FW_REL_COMP_sts_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_reserved_1_Pos                                                     10U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_reserved_1_Msk                                                     (0x3FUL << PLATFORM_REG_TMETER_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_TASK_ONE_SHOT_sts_Pos                                      16U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_TASK_ONE_SHOT_sts_Msk                                      (0x1UL << PLATFORM_REG_TMETER_TASK_EVNT_STS_r_METER_TASK_ONE_SHOT_sts_Pos)

