rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_reserved_Pos                                                       17U
#define PLATFORM_REG_TMETER_TASK_EVNT_STS_reserved_Msk                                                       (0x7FFFUL << PLATFORM_REG_TMETER_TASK_EVNT_STS_reserved_Pos)

/* 0x0368   0x4000_6368
    0       R/W1C   r_DMA_EVNT_INT_TFR3_sts                             1'b0
    1       R/W1C   r_DMA_EVNT_INT_TFR4_sts                             1'b0
    2       R/W1C   r_DMA_EVNT_INT_BLK3_sts                             1'b0
    3       R/W1C   r_DMA_EVNT_INT_BLK4_sts                             1'b0
    15:4    R       reserved_1                                          12'd0
    16      R/W1C   r_DMA_TASK_CHN_EN3_sts                              1'b0
    17      R/W1C   r_DMA_TASK_CHN_EN4_sts                              1'b0
    31:18   R       reserved                                            14'd0
 */
typedef union _PLATFORM_REG_DMA_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_DMA_EVNT_INT_TFR3_sts: 1;
        uint32_t r_DMA_EVNT_INT_TFR4_sts: 1;
        uint32_t r_DMA_EVNT_INT_BLK3_sts: 1;
        uint32_t r_DMA_EVNT_INT_BLK4_sts: 1;
        uint32_t reserved_1: 12;
        uint32_t r_DMA_TASK_CHN_EN3_sts: 1;
        uint32_t r_DMA_TASK_CHN_EN4_sts: 1;
        uint32_t reserved: 14;
    };
} PLATFORM_REG_DMA_TASK_EVNT_STS_TYPE;

/*0x4000_6368 PLATFORM_REG_DMA_TASK_EVNT_STS*/
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_TFR3_sts_Pos                                           0U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_TFR3_sts_Msk                                           (0x1UL << PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_TFR3_sts_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_TFR4_sts_Pos                                           1U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_TFR4_sts_Msk                                           (0x1UL << PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_TFR4_sts_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_BLK3_sts_Pos                                           2U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_BLK3_sts_Msk                                           (0x1UL << PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_BLK3_sts_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_BLK4_sts_Pos                                           3U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_BLK4_sts_Msk                                           (0x1UL << PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_EVNT_INT_BLK4_sts_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_reserved_1_Pos                                                        4U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_reserved_1_Msk                                                        (0xFFFUL << PLATFORM_REG_DMA_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_TASK_CHN_EN3_sts_Pos                                            16U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_TASK_CHN_EN3_sts_Msk                                            (0x1UL << PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_TASK_CHN_EN3_sts_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_TASK_CHN_EN4_sts_Pos                                            17U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_TASK_CHN_EN4_sts_Msk                                            (0x1UL << PLATFORM_REG_DMA_TASK_EVNT_STS_r_DMA_TASK_CHN_EN4_sts_Pos)

#define PLATFORM_REG_DMA_TASK_EVNT_STS_reserved_Pos                                                          18U
#define PLATFORM_REG_DMA_TASK_EVNT_STS_reserved_Msk                                                          (0x3FFFUL << PLATFORM_REG_DMA_TASK_EVNT_STS_reserved_Pos)

/* 0x036C   0x4000_636c
    0       R/W1C   r_SDMK_EVNT_DONE_sts                                1'b0
    15:1    R       reserved_1                                          15'h0000
    16      R/W1C   r_SDMK_TASK_START_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_SDMK_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_SDMK_EVNT_DONE_sts: 1;
        uint32_t reserved_1: 15;
        uint32_t r_SDMK_TASK_START_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_SDMK_TASK_EVNT_STS_TYPE;

/*0x4000_636c PLATFORM_REG_SDMK_TASK_EVNT_STS*/
#define PLATFORM_REG_SDMK_TASK_EVNT_STS_r_SDMK_EVNT_DONE_sts_Pos                                             0U
#define PLATFORM_REG_SDMK_TASK_EVNT_STS_r_SDMK_EVNT_DONE_sts_Msk                                             (0x1UL << PLATFORM_REG_SDMK_TASK_EVNT_STS_r_SDMK_EVNT_DONE_sts_Pos)

#define PLATFORM_REG_SDMK_TASK_EVNT_STS_reserved_1_Pos                                                       1U
#define PLATFORM_REG_SDMK_TASK_EVNT_STS_reserved_1_Msk                                                       (0x7FFFUL << PLATFORM_REG_SDMK_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_SDMK_TASK_EVNT_STS_r_SDMK_TASK_START_sts_Pos                                            16U
#define PLATFORM_REG_SDMK_TASK_EVNT_STS_r_SDMK_TASK_START_sts_Msk                                            (0x1UL << PLATFORM_REG_SDMK_TASK_EVNT_STS_r_SDMK_TASK_START_sts_Pos)

#define PLATFORM_REG_SDMK_TASK_EVNT_STS_reserved_Pos                                                         17U
#define PLATFORM_REG_SDMK_TASK_EVNT_STS_reserved_Msk                                                         (0x7FFFUL << PLATFORM_REG_SDMK_TASK_EVNT_STS_reserved_Pos)

/* 0x0370   0x4000_6370
    0       R/W1C   r_OSC10M_EVNT_CAL_DONE_sts                          1'b0
    15:1    R       reserved_1                                          15'h0000
    16      R/W1C   r_OSC10M_TASK_CAL_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_OSC10M_EVNT_CAL_DONE_sts: 1;
        uint32_t reserved_1: 15;
        uint32_t r_OSC10M_TASK_CAL_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_TYPE;

/*0x4000_6370 PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS*/
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_r_OSC10M_EVNT_CAL_DONE_sts_Pos                                 0U
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_r_OSC10M_EVNT_CAL_DONE_sts_Msk                                 (0x1UL << PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_r_OSC10M_EVNT_CAL_DONE_sts_Pos)

#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_reserved_1_Pos                                                 1U
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_reserved_1_Msk                                                 (0x7FFFUL << PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_r_OSC10M_TASK_CAL_sts_Pos                                      16U
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_r_OSC10M_TASK_CAL_sts_Msk                                      (0x1UL << PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_r_OSC10M_TASK_CAL_sts_Pos)

