rtkconnectivity/hal_realtek_mainline/bee/soc/inc/rtl87x2j/platform_reg.h
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_reserved_Pos                                                   17U
#define PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_reserved_Msk                                                   (0x7FFFUL << PLATFORM_REG_OSC10M_CAL_TASK_EVNT_STS_reserved_Pos)

/* 0x0374   0x4000_6374
    0       R/W1C   r_OSC80M_EVNT_CAL_DONE_sts                          1'b0
    15:1    R       reserved_1                                          15'h0000
    16      R/W1C   r_OSC80M_TASK_CAL_sts                               1'b0
    31:17   R       reserved                                            15'h0000
 */
typedef union _PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_TYPE
{
    uint32_t d32;
    struct
    {
        uint32_t r_OSC80M_EVNT_CAL_DONE_sts: 1;
        uint32_t reserved_1: 15;
        uint32_t r_OSC80M_TASK_CAL_sts: 1;
        uint32_t reserved: 15;
    };
} PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_TYPE;

/*0x4000_6374 PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS*/
#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_r_OSC80M_EVNT_CAL_DONE_sts_Pos                                 0U
#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_r_OSC80M_EVNT_CAL_DONE_sts_Msk                                 (0x1UL << PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_r_OSC80M_EVNT_CAL_DONE_sts_Pos)

#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_reserved_1_Pos                                                 1U
#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_reserved_1_Msk                                                 (0x7FFFUL << PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_reserved_1_Pos)

#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_r_OSC80M_TASK_CAL_sts_Pos                                      16U
#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_r_OSC80M_TASK_CAL_sts_Msk                                      (0x1UL << PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_r_OSC80M_TASK_CAL_sts_Pos)

#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_reserved_Pos                                                   17U
#define PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_reserved_Msk                                                   (0x7FFFUL << PLATFORM_REG_OSC80M_CAL_TASK_EVNT_STS_reserved_Pos)


#define PLATFORM_REG_BASE 0x40006000

#define PLATFORM_REG_READ(Offset)\
    ((uint32_t)*((volatile uint32_t*)(PLATFORM_REG_BASE+(Offset))))

#define PLATFORM_REG_WRITE(Offset, Value)\
    ((*((volatile uint32_t*)(PLATFORM_REG_BASE + (Offset)))) = (Value))

#define PLATFORM_REG_UPDATE(Offset, Mask, Value) \
    do {\
        uint32_t temp;\
        temp = PLATFORM_REG_READ(Offset) & ~(Mask);\
        PLATFORM_REG_WRITE(Offset, (temp | ((Value) & (Mask))));\
    } while(0)

#define PLATFORM_REG_READ_BITFIELD(Offset, Bitfield)                   \
    (((Offset##_TYPE)PLATFORM_REG_READ(Offset)).Bitfield)

#define PLATFORM_REG_WRITE_BITFIELD(Offset, Bitfield, Value)           \
    do {                                                        \
        Offset##_TYPE temp = {.d32 = PLATFORM_REG_READ(Offset)};       \
        temp.Bitfield = Value;                                         \
        PLATFORM_REG_WRITE(Offset, temp.d32);                          \
    } while(0)

#endif //#define PLATFORM_REG_H
